package com.dcits.blacklist.enums;

/** 账户属性 */
public enum AcctNatureNo {
    /** 无特殊用途（外汇账户性质） */
    VALUE_0("0"),
    /** 银行承兑汇票保证金 */
    VALUE_9("9"),
    /** 保函保证金 */
    VALUE_10("10"),
    /** 信用证保证金 */
    VALUE_11("11"),
    /** 信用卡保证金 */
    VALUE_12("12"),
    /** 商票贴现保证金 */
    VALUE_13("13"),
    /** 其他保证金 */
    VALUE_14("14"),
    /** 暂记 */
    VALUE_15("15"),
    /** 单位卡专用户 */
    VALUE_16("16"),
    /** 验资户 */
    VALUE_17("17"),
    /** 个人外币储蓄户 */
    VALUE_18("18"),
    /** 个人资本项目外汇帐户 */
    VALUE_19("19"),
    /** 个人经常项目外币定期存款 */
    VALUE_20("20"),
    /** 个人资本项目外币定期存款 */
    VALUE_21("21"),
    /** 外汇买卖保证金 */
    VALUE_22("22"),
    /** 衍生金融产品保证金 */
    VALUE_23("23"),
    /** 银行本票保证金 */
    VALUE_24("24"),
    /** 银行承兑汇票保证金(额度池) */
    VALUE_26("26"),
    /** 经常项目-外汇结算账户 */
    VALUE_1000("1000"),
    /** 基本存款账户 */
    VALUE_11001("11001"),
    /** 一般存款账户 */
    VALUE_11002("11002"),
    /** 临时存款账户 */
    VALUE_11003("11003"),
    /** 专用存款账户 */
    VALUE_11004("11004"),
    /** 对公人民币定期存款账户 */
    VALUE_11005("11005"),
    /** 跨境人民币同业往来账户 */
    VALUE_11006("11006"),
    /** 一户通账户 */
    VALUE_11007("11007"),
    /** 经常项目-待核查账户 */
    VALUE_1101("1101"),
    /** 经常项目-国际贸易结算中心专用外汇账户 */
    VALUE_1104("1104"),
    /** 对公外币活期存款账户 */
    VALUE_12001("12001"),
    /** 对公外币定期存款账户 */
    VALUE_12002("12002"),
    /** 经常项目-捐赠账户 */
    VALUE_1202("1202"),
    /** 保险机构资金运用外汇账户 */
    VALUE_1602("1602"),
    /** 支付机构外汇备付金账户 */
    VALUE_1603("1603"),
    /** 个人人民币结算账户 */
    VALUE_21001("21001"),
    /** 个人人民币储蓄账户 */
    VALUE_21002("21002"),
    /** 个人人民币定期存款账户 */
    VALUE_21003("21003"),
    /** 资本项目-前期费用外汇账户 */
    VALUE_2101("2101"),
    /** 资本项目-外汇资本金账户 */
    VALUE_2102("2102"),
    /** 资本项目-资产变现账户 */
    VALUE_2103("2103"),
    /** 资本项目-保证金专用账户 */
    VALUE_2104("2104"),
    /** 资本项目-人民币前期费用专用存款账户 */
    VALUE_2108("2108"),
    /** 资本项目-人民币资本金专用存款账户 */
    VALUE_2109("2109"),
    /** 资本项目-人民币并购专用存款账户 */
    VALUE_2110("2110"),
    /** 资本项目-人民币股权转让专用存款账户 */
    VALUE_2111("2111"),
    /** 资本项目-人民币再投资专用存款账户 */
    VALUE_2112("2112"),
    /** 资本项目-结汇待支付账户 */
    VALUE_2113("2113"),
    /** 个人外汇储蓄账户 */
    VALUE_22001("22001"),
    /** 个人外汇结算账户 */
    VALUE_22002("22002"),
    /** 个人资本项目账户 */
    VALUE_22003("22003"),
    /** 资本项目-境外放款专用账户 */
    VALUE_2202("2202"),
    /** 资本项目-外债专户 */
    VALUE_2301("2301"),
    /** 资本项目-外债转贷款专户 */
    VALUE_2302("2302"),
    /** 资本项目-国内外汇贷款专户 */
    VALUE_2303("2303"),
    /** 资本项目-居民境外证券与衍生品账户 */
    VALUE_2403("2403"),
    /** 资本项目-合格境外机构投资者账户 */
    VALUE_2410("2410"),
    /** 资本项目-QDII境内托管账户 */
    VALUE_2412("2412"),
    /** 资本项目-境内外投资者B股交易结算资金账户 */
    VALUE_2416("2416"),
    /** 资本项目-非银行金融机构客户资金账户 */
    VALUE_2417("2417"),
    /** 资本项目-非银行金融机构自有外汇资金账户 */
    VALUE_2418("2418"),
    /** 资本项目-定期存款户 */
    VALUE_2421("2421"),
    /** 资本项目-其他资本项目专用外汇账户 */
    VALUE_2499("2499"),
    /** 离岸外汇账户 */
    VALUE_3300("3300"),
    /** 境外机构/个人境内外汇账户 */
    VALUE_3400("3400"),
    /** 国内资金主账户 */
    VALUE_3601("3601"),
    /** 自贸区内机构自由贸易账户FTE */
    VALUE_3603("3603"),
    /** 境外机构自由贸易账户FTN */
    VALUE_3604("3604"),
    /** 自贸区内个人自由贸易账户FTI */
    VALUE_3605("3605"),
    /** 自贸区内境外个人自由贸易账户FTF */
    VALUE_3606("3606"),
    /** 内部账户 */
    VALUE_39001("39001"),
    /** 暂存户-开证、付汇保证金账户 */
    VALUE_4200("4200"),
    /** 暂存户-其他暂存户 */
    VALUE_4600("4600"),
    /** 委托存款账户 */
    VALUE_91001("91001"),
    /** 保证金账户 */
    VALUE_99001("99001"),
    /** 结算账户 */
    Z9001("Z9001"),
    /** 非结算账户 */
    Z9002("Z9002"),
    /** 同业机构自由贸易账户-FTU */
    VALUE_3607("3607");

    private String value;

    private AcctNatureNo(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static AcctNatureNo byValue(String value) {
        for (AcctNatureNo item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}