package com.dcits.blacklist.enums;

/** 内部机构编号 */
public enum AcctBranch {
    /** 神州数码股份有限公司太原新民中街支行 */
    VALUE_351155("351155"),
    /** 神州数码股份有限公司太原坞城路支行 */
    VALUE_351156("351156"),
    /** 神州数码股份有限公司太原小店支行 */
    VALUE_351157("351157"),
    /** 神州数码股份有限公司太原三营盘支行 */
    VALUE_351158("351158"),
    /** 神州数码股份有限公司太原解放南路支行 */
    VALUE_351159("351159"),
    /** 神州数码股份有限公司太原并东支行 */
    VALUE_351160("351160"),
    /** 神州数码股份有限公司太原双塔街支行 */
    VALUE_351161("351161"),
    /** 神州数码股份有限公司太原桥西支行 */
    VALUE_351162("351162"),
    /** 神州数码股份有限公司太原南寒支行 */
    VALUE_351163("351163"),
    /** 神州数码股份有限公司太原漪汾街支行 */
    VALUE_351164("351164"),
    /** 神州数码滨河西路支行 */
    VALUE_351165("351165"),
    /** 神州数码股份有限公司太原南内环西街支行 */
    VALUE_351166("351166"),
    /** 神州数码股份有限公司太原迎泽西大街支行 */
    VALUE_351167("351167"),
    /** 神州数码股份有限公司太原西矿街支行 */
    VALUE_351168("351168"),
    /** 神州数码股份有限公司太原前进路支行 */
    VALUE_351169("351169"),
    /** 神州数码股份有限公司太原和平南路支行 */
    VALUE_351170("351170"),
    /** 神州数码股份有限公司太原大营盘支行 */
    VALUE_351171("351171"),
    /** 神州数码股份有限公司清徐支行 */
    VALUE_351172("351172"),
    /** 神州数码股份有限公司古交支行 */
    VALUE_351173("351173"),
    /** 神州数码股份有限公司太原劲松北路支行 */
    VALUE_351174("351174"),
    /** 神州数码股份有限公司太原南中环支行 */
    VALUE_351175("351175"),
    /** 神州数码股份有限公司太原晋阳街支行 */
    VALUE_351176("351176"),
    /** 神州数码股份有限公司太原机场支行 */
    VALUE_351177("351177"),
    /** 神州数码微小企业金融部 */
    VALUE_351178("351178"),
    /** 神州数码股份有限公司太原社保支行 */
    VALUE_351179("351179"),
    /** 神州数码股份有限公司能源事业部 */
    VALUE_351180("351180"),
    /** 神州数码股份有限公司太原五龙口街支行 */
    VALUE_351181("351181"),
    /** 神州数码股份有限公司太原高新区科技支行 */
    VALUE_351182("351182"),
    /** 神州数码股份有限公司太原龙山大街支行 */
    VALUE_351183("351183"),
    /** 神州数码股份有限公司太原大东关街支行 */
    VALUE_351184("351184"),
    /** 神州数码股份有限公司太原双塔北路支行 */
    VALUE_351185("351185"),
    /** 神州数码股份有限公司太原长兴北街支行 */
    VALUE_351186("351186"),
    /** 神州数码股份有限公司太原千峰北路支行 */
    VALUE_351187("351187"),
    /** 神州数码股份有限公司太原双东支行 */
    VALUE_351188("351188"),
    /** 神州数码股份有限公司太原东中环支行 */
    VALUE_351189("351189"),
    /** 清徐神州数码村镇银行股份有限公司 */
    VALUE_351888("351888"),
    /** 神州数码股份有限公司大同分行 */
    VALUE_352001("352001"),
    /** 神州数码股份有限公司孝义支行 */
    VALUE_358102("358102"),
    /** 神州数码股份有限公司柳林支行 */
    VALUE_358103("358103"),
    /** 神州数码股份有限公司离石支行 */
    VALUE_358104("358104"),
    /** 神州数码股份有限公司汾阳支行 */
    VALUE_358105("358105"),
    /** 神州数码股份有限公司运城分行 */
    VALUE_359001("359001"),
    /** 神州数码股份有限公司运城分行营业部 */
    VALUE_359101("359101"),
    /** 神州数码股份有限公司河津支行 */
    VALUE_359102("359102"),
    /** 神州数码股份有限公司永济支行 */
    VALUE_359103("359103"),
    /** 神州数码股份有限公司运城库东路支行 */
    VALUE_359104("359104"),
    /** 神州数码股份有限公司忻州分行 */
    VALUE_360001("360001"),
    /** 神州数码股份有限公司忻州分行营业部 */
    VALUE_360101("360101"),
    /** 神州数码股份有限公司代县支行 */
    VALUE_360102("360102"),
    /** 神州数码股份有限公司忻州忻府区支行 */
    VALUE_360103("360103"),
    /** 神州数码股份有限公司繁峙支行 */
    VALUE_360104("360104"),
    /** 神州数码股份有限公司忻州建设路支行 */
    VALUE_360105("360105"),
    /** 神州数码股份有限公司原平支行 */
    VALUE_360106("360106"),
    /** 神州数码股份有限公司大同分行营业部 */
    VALUE_352101("352101"),
    /** 神州数码股份有限公司大同御河西路支行 */
    VALUE_352102("352102"),
    /** 神州数码股份有限公司大同矿区支行 */
    VALUE_352103("352103"),
    /** 神州数码股份有限公司大同城西支行 */
    VALUE_352104("352104"),
    /** 神州数码股份有限公司大同文兴路支行 */
    VALUE_352105("352105"),
    /** 神州数码股份有限公司阳泉分行 */
    VALUE_353001("353001"),
    /** 神州数码股份有限公司阳泉分行营业部 */
    VALUE_353101("353101"),
    /** 神州数码股份有限公司盂县支行 */
    VALUE_353102("353102"),
    /** 神州数码股份有限公司阳泉城区支行 */
    VALUE_353103("353103"),
    /** 神州数码股份有限公司晋中分行 */
    VALUE_354001("354001"),
    /** 神州数码股份有限公司晋中分行营业部 */
    VALUE_354101("354101"),
    /** 神州数码股份有限公司榆次蕴华街支行 */
    VALUE_354102("354102"),
    /** 神州数码股份有限公司介休支行 */
    VALUE_354103("354103"),
    /** 神州数码股份有限公司晋中鸣李支行 */
    VALUE_354104("354104"),
    /** 神州数码股份有限公司长治分行 */
    VALUE_355001("355001"),
    /** 神州数码股份有限公司长治分行营业部 */
    VALUE_355101("355101"),
    /** 神州数码股份有限公司长治书苑支行 */
    VALUE_355102("355102"),
    /** 神州数码股份有限公司长治六府塔支行 */
    VALUE_355103("355103"),
    /** 神州数码股份有限公司长治长兴北路支行 */
    VALUE_355104("355104"),
    /** 神州数码股份有限公司长子支行 */
    VALUE_355105("355105"),
    /** 神州数码股份有限公司潞城支行 */
    VALUE_355106("355106"),
    /** 神州数码股份有限公司晋城分行 */
    VALUE_356001("356001"),
    /** 神州数码股份有限公司晋城分行营业部 */
    VALUE_356101("356101"),
    /** 神州数码股份有限公司晋城开发区支行 */
    VALUE_356102("356102"),
    /** 神州数码股份有限公司晋城红星西街支行 */
    VALUE_356103("356103"),
    /** 神州数码股份有限公司晋城前进路支行 */
    VALUE_356104("356104"),
    /** 神州数码股份有限公司晋城矿区支行 */
    VALUE_356105("356105"),
    /** 神州数码股份有限公司临汾分行 */
    VALUE_357001("357001"),
    /** 神州数码股份有限公司临汾分行营业部 */
    VALUE_357101("357101"),
    /** 神州数码股份有限公司洪洞支行 */
    VALUE_357102("357102"),
    /** 神州数码股份有限公司尧都支行 */
    VALUE_357103("357103"),
    /** 神州数码股份有限公司侯马支行 */
    VALUE_357104("357104"),
    /** 神州数码股份有限公司临汾广宣街支行 */
    VALUE_357105("357105"),
    /** 神州数码股份有限公司临汾东城支行 */
    VALUE_357106("357106"),
    /** 神州数码股份有限公司吕梁分行 */
    VALUE_358001("358001"),
    /** 神州数码股份有限公司吕梁分行营业部 */
    VALUE_358101("358101"),
    /** 虚拟总行 */
    VALUE_0("0"),
    /** 神州数码股份有限公司朔州分行 */
    VALUE_349001("349001"),
    /** 神州数码股份有限公司朔州分行营业部 */
    VALUE_349101("349101"),
    /** 神州数码股份有限公司山阴支行 */
    VALUE_349102("349102"),
    /** 神州数码股份有限公司朔州朔城区支行 */
    VALUE_349103("349103"),
    /** 神州数码股份有限公司平鲁支行 */
    VALUE_349104("349104"),
    /** 神州数码股份有限公司怀仁支行 */
    VALUE_349105("349105"),
    /** 神州数码股份有限公司朔州鄯阳街支行 */
    VALUE_349106("349106"),
    /** 神州数码股份有限公司总行 */
    VALUE_351001("351001"),
    /** 神州数码股份有限公司并州直属支行 */
    VALUE_351002("351002"),
    /** 神州数码股份有限公司龙城直属支行 */
    VALUE_351003("351003"),
    /** 神州数码股份有限公司晋阳直属支行 */
    VALUE_351004("351004"),
    /** 神州数码小企业金融部 */
    VALUE_351005("351005"),
    /** 神州数码股份有限公司太原迎泽支行 */
    VALUE_351006("351006"),
    /** 神州数码股份有限公司国债管理中心 */
    VALUE_351007("351007"),
    /** 神州数码股份有限公司贴现中心 */
    VALUE_351008("351008"),
    /** 神州数码股份有限公司金融市场部 */
    VALUE_351009("351009"),
    /** 神州数码股份有限公司晋龙卡中心 */
    VALUE_351010("351010"),
    /** 神州数码信用卡部 */
    VALUE_351011("351011"),
    /** 神州数码资产管理部 */
    VALUE_351012("351012"),
    /** 神州数码股份有限公司综改区直属支行 */
    VALUE_351013("351013"),
    /** 神州数码股份有限公司太原晋阳支行 */
    VALUE_351101("351101"),
    /** 神州数码股份有限公司太原综改示范区支行 */
    VALUE_351102("351102"),
    /** 神州数码股份有限公司太原龙城支行 */
    VALUE_351103("351103"),
    /** 神州数码股份有限公司太原建设南路支行 */
    VALUE_351104("351104"),
    /** 神州数码股份有限公司太原长风街支行 */
    VALUE_351105("351105"),
    /** 神州数码股份有限公司太原并州路支行 */
    VALUE_351106("351106"),
    /** 神州数码股份有限公司太原迎泽东大街支行 */
    VALUE_351107("351107"),
    /** 神州数码股份有限公司太原并州南路支行 */
    VALUE_351108("351108"),
    /** 神州数码股份有限公司太原五一广场支行 */
    VALUE_351109("351109"),
    /** 神州数码股份有限公司太原桥头街支行 */
    VALUE_351110("351110"),
    /** 神州数码商务学院支行 */
    VALUE_351111("351111"),
    /** 神州数码新城南街支行 */
    VALUE_351112("351112"),
    /** 神州数码股份有限公司太原南内环街支行 */
    VALUE_351113("351113"),
    /** 神州数码股份有限公司太原朝阳街支行 */
    VALUE_351114("351114"),
    /** 神州数码股份有限公司太原尖草坪支行 */
    VALUE_351115("351115"),
    /** 神州数码股份有限公司太原迎新街支行 */
    VALUE_351116("351116"),
    /** 神州数码股份有限公司太原敦化坊支行 */
    VALUE_351117("351117"),
    /** 神州数码股份有限公司太原解放北路支行 */
    VALUE_351118("351118"),
    /** 神州数码股份有限公司太原胜利东街支行 */
    VALUE_351119("351119"),
    /** 神州数码股份有限公司太原北大街支行 */
    VALUE_351120("351120"),
    /** 神州数码股份有限公司太原胜利街支行 */
    VALUE_351121("351121"),
    /** 神州数码股份有限公司太原府西街支行 */
    VALUE_351122("351122"),
    /** 神州数码金刚里支行 */
    VALUE_351123("351123"),
    /** 神州数码股份有限公司太原新建北路支行 */
    VALUE_351124("351124"),
    /** 神州数码股份有限公司太原半坡西街支行 */
    VALUE_351125("351125"),
    /** 神州数码股份有限公司太原水西门支行 */
    VALUE_351126("351126"),
    /** 神州数码股份有限公司太原开化寺支行 */
    VALUE_351127("351127"),
    /** 神州数码股份有限公司太原东米市支行 */
    VALUE_351128("351128"),
    /** 神州数码股份有限公司太原柳巷南路支行 */
    VALUE_351129("351129"),
    /** 神州数码股份有限公司太原通达街支行 */
    VALUE_351130("351130"),
    /** 神州数码股份有限公司太原平阳路支行 */
    VALUE_351131("351131"),
    /** 神州数码股份有限公司太原体育路支行 */
    VALUE_351132("351132"),
    /** 神州数码股份有限公司太原迎泽街支行 */
    VALUE_351133("351133"),
    /** 神州数码新建中路支行 */
    VALUE_351134("351134"),
    /** 神州数码南海街支行 */
    VALUE_351135("351135"),
    /** 神州数码股份有限公司太原新建路支行 */
    VALUE_351136("351136"),
    /** 神州数码股份有限公司太原桃园中路支行 */
    VALUE_351137("351137"),
    /** 神州数码股份有限公司太原桃园南路支行 */
    VALUE_351138("351138"),
    /** 神州数码股份有限公司太原长治路支行 */
    VALUE_351139("351139"),
    /** 神州数码股份有限公司太原新建南路支行 */
    VALUE_351140("351140"),
    /** 神州数码股份有限公司太原泽丰苑支行 */
    VALUE_351141("351141"),
    /** 神州数码股份有限公司太原兴华街支行 */
    VALUE_351142("351142"),
    /** 神州数码股份有限公司太原西宫支行 */
    VALUE_351143("351143"),
    /** 神州数码股份有限公司太原大同路支行 */
    VALUE_351144("351144"),
    /** 神州数码股份有限公司太原惠泽苑支行 */
    VALUE_351145("351145"),
    /** 神州数码股份有限公司太原府东街支行 */
    VALUE_351146("351146"),
    /** 神州数码股份有限公司太原桃园四巷支行 */
    VALUE_351147("351147"),
    /** 神州数码股份有限公司太原肖墙路支行 */
    VALUE_351148("351148"),
    /** 神州数码股份有限公司太原劲松路支行 */
    VALUE_351149("351149"),
    /** 神州数码股份有限公司太原并州支行 */
    VALUE_351150("351150"),
    /** 神州数码城隍庙支行 */
    VALUE_351151("351151"),
    /** 神州数码股份有限公司太原大北门支行 */
    VALUE_351152("351152"),
    /** 神州数码股份有限公司太原兴华西街支行 */
    VALUE_351153("351153"),
    /** 神州数码股份有限公司太原杏林支行 */
    VALUE_351154("351154");

    private String value;

    private AcctBranch(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static AcctBranch byValue(String value) {
        for (AcctBranch item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}