package com.dcits.blacklist.enums;

/** 城市区县 */
public enum City {
    /** 北京市 */
    VALUE_110000("110000"),
    /** 北京市东城区 */
    VALUE_110101("110101"),
    /** 北京市西城区 */
    VALUE_110102("110102"),
    /** 北京市朝阳区 */
    VALUE_110105("110105"),
    /** 北京市丰台区 */
    VALUE_110106("110106"),
    /** 北京市石景山区 */
    VALUE_110107("110107"),
    /** 北京市海淀区 */
    VALUE_110108("110108"),
    /** 北京市门头沟区 */
    VALUE_110109("110109"),
    /** 北京市房山区 */
    VALUE_110111("110111"),
    /** 北京市通州区 */
    VALUE_110112("110112"),
    /** 北京市顺义区 */
    VALUE_110113("110113"),
    /** 北京市昌平区 */
    VALUE_110114("110114"),
    /** 北京市大兴区 */
    VALUE_110115("110115"),
    /** 北京市怀柔区 */
    VALUE_110116("110116"),
    /** 北京市平谷区 */
    VALUE_110117("110117"),
    /** 北京市密云县 */
    VALUE_110228("110228"),
    /** 北京市延庆县 */
    VALUE_110229("110229"),
    /** 天津市 */
    VALUE_120000("120000"),
    /** 天津市和平区 */
    VALUE_120101("120101"),
    /** 天津市河东区 */
    VALUE_120102("120102"),
    /** 天津市河西区 */
    VALUE_120103("120103"),
    /** 天津市南开区 */
    VALUE_120104("120104"),
    /** 天津市河北区 */
    VALUE_120105("120105"),
    /** 天津市红桥区 */
    VALUE_120106("120106"),
    /** 天津市东丽区 */
    VALUE_120110("120110"),
    /** 天津市西青区 */
    VALUE_120111("120111"),
    /** 天津市津南区 */
    VALUE_120112("120112"),
    /** 天津市北辰区 */
    VALUE_120113("120113"),
    /** 天津市武清区 */
    VALUE_120114("120114"),
    /** 天津市宝坻区 */
    VALUE_120115("120115"),
    /** 天津市滨海新区 */
    VALUE_120116("120116"),
    /** 天津市宁河县 */
    VALUE_120221("120221"),
    /** 天津市静海县 */
    VALUE_120223("120223"),
    /** 天津市蓟县 */
    VALUE_120225("120225"),
    /** 石家庄市 */
    VALUE_130100("130100"),
    /** 石家庄长安区 */
    VALUE_130102("130102"),
    /** 石家庄桥西区 */
    VALUE_130104("130104"),
    /** 石家庄新华区 */
    VALUE_130105("130105"),
    /** 石家庄井陉矿区 */
    VALUE_130107("130107"),
    /** 石家庄裕华区 */
    VALUE_130108("130108"),
    /** 石家庄市藁城区 */
    VALUE_130109("130109"),
    /** 石家庄市鹿泉区 */
    VALUE_130110("130110"),
    /** 石家庄市栾城区 */
    VALUE_130111("130111"),
    /** 石家庄井陉县 */
    VALUE_130121("130121"),
    /** 石家庄正定县 */
    VALUE_130123("130123"),
    /** 石家庄行唐县 */
    VALUE_130125("130125"),
    /** 石家庄灵寿县 */
    VALUE_130126("130126"),
    /** 石家庄高邑县 */
    VALUE_130127("130127"),
    /** 石家庄深泽县 */
    VALUE_130128("130128"),
    /** 石家庄赞皇县 */
    VALUE_130129("130129"),
    /** 石家庄无极县 */
    VALUE_130130("130130"),
    /** 石家庄平山县 */
    VALUE_130131("130131"),
    /** 石家庄元氏县 */
    VALUE_130132("130132"),
    /** 石家庄赵县 */
    VALUE_130133("130133"),
    /** 石家庄晋州市 */
    VALUE_130183("130183"),
    /** 石家庄新乐市 */
    VALUE_130184("130184"),
    /** 唐山市 */
    VALUE_130200("130200"),
    /** 唐山路南区 */
    VALUE_130202("130202"),
    /** 唐山路北区 */
    VALUE_130203("130203"),
    /** 唐山古冶区 */
    VALUE_130204("130204"),
    /** 唐山开平区 */
    VALUE_130205("130205"),
    /** 唐山丰南区 */
    VALUE_130207("130207"),
    /** 唐山丰润区 */
    VALUE_130208("130208"),
    /** 唐山市曹妃甸区 */
    VALUE_130209("130209"),
    /** 唐山滦县 */
    VALUE_130223("130223"),
    /** 唐山滦南县 */
    VALUE_130224("130224"),
    /** 唐山乐亭县 */
    VALUE_130225("130225"),
    /** 唐山迁西县 */
    VALUE_130227("130227"),
    /** 唐山玉田县 */
    VALUE_130229("130229"),
    /** 唐山遵化市 */
    VALUE_130281("130281"),
    /** 唐山迁安市 */
    VALUE_130283("130283"),
    /** 秦皇岛市 */
    VALUE_130300("130300"),
    /** 秦皇岛海港区 */
    VALUE_130302("130302"),
    /** 秦皇岛山海关区 */
    VALUE_130303("130303"),
    /** 秦皇岛北戴河区 */
    VALUE_130304("130304"),
    /** 秦皇岛青龙满族自治县 */
    VALUE_130321("130321"),
    /** 秦皇岛昌黎县 */
    VALUE_130322("130322"),
    /** 秦皇岛抚宁县 */
    VALUE_130323("130323"),
    /** 秦皇岛卢龙县 */
    VALUE_130324("130324"),
    /** 邯郸市 */
    VALUE_130400("130400"),
    /** 邯郸邯山区 */
    VALUE_130402("130402"),
    /** 邯郸丛台区 */
    VALUE_130403("130403"),
    /** 邯郸复兴区 */
    VALUE_130404("130404"),
    /** 邯郸峰峰矿区 */
    VALUE_130406("130406"),
    /** 邯郸县 */
    VALUE_130421("130421"),
    /** 邯郸临漳县 */
    VALUE_130423("130423"),
    /** 邯郸成安县 */
    VALUE_130424("130424"),
    /** 邯郸大名县 */
    VALUE_130425("130425"),
    /** 邯郸涉县 */
    VALUE_130426("130426"),
    /** 邯郸磁县 */
    VALUE_130427("130427"),
    /** 邯郸肥乡县 */
    VALUE_130428("130428"),
    /** 邯郸永年县 */
    VALUE_130429("130429"),
    /** 邯郸邱县 */
    VALUE_130430("130430"),
    /** 邯郸鸡泽县 */
    VALUE_130431("130431"),
    /** 邯郸广平县 */
    VALUE_130432("130432"),
    /** 邯郸馆陶县 */
    VALUE_130433("130433"),
    /** 邯郸魏县 */
    VALUE_130434("130434"),
    /** 邯郸曲周县 */
    VALUE_130435("130435"),
    /** 邯郸武安市 */
    VALUE_130481("130481"),
    /** 邢台市 */
    VALUE_130500("130500"),
    /** 邢台桥东区 */
    VALUE_130502("130502"),
    /** 邢台桥西区 */
    VALUE_130503("130503"),
    /** 邢台县 */
    VALUE_130521("130521"),
    /** 邢台临城县 */
    VALUE_130522("130522"),
    /** 邢台内丘县 */
    VALUE_130523("130523"),
    /** 邢台柏乡县 */
    VALUE_130524("130524"),
    /** 邢台隆尧县 */
    VALUE_130525("130525"),
    /** 邢台任县 */
    VALUE_130526("130526"),
    /** 邢台南和县 */
    VALUE_130527("130527"),
    /** 邢台宁晋县 */
    VALUE_130528("130528"),
    /** 邢台巨鹿县 */
    VALUE_130529("130529"),
    /** 邢台新河县 */
    VALUE_130530("130530"),
    /** 邢台广宗县 */
    VALUE_130531("130531"),
    /** 邢台平乡县 */
    VALUE_130532("130532"),
    /** 邢台威县 */
    VALUE_130533("130533"),
    /** 邢台清河县 */
    VALUE_130534("130534"),
    /** 邢台临西县 */
    VALUE_130535("130535"),
    /** 邢台南宫市 */
    VALUE_130581("130581"),
    /** 邢台沙河市 */
    VALUE_130582("130582"),
    /** 保定市 */
    VALUE_130600("130600"),
    /** 保定新市区 */
    VALUE_130602("130602"),
    /** 保定北市区 */
    VALUE_130603("130603"),
    /** 保定南市区 */
    VALUE_130604("130604"),
    /** 保定满城县 */
    VALUE_130621("130621"),
    /** 保定清苑县 */
    VALUE_130622("130622"),
    /** 保定涞水县 */
    VALUE_130623("130623"),
    /** 保定阜平县 */
    VALUE_130624("130624"),
    /** 保定徐水县 */
    VALUE_130625("130625"),
    /** 保定定兴县 */
    VALUE_130626("130626"),
    /** 保定唐县 */
    VALUE_130627("130627"),
    /** 保定高阳县 */
    VALUE_130628("130628"),
    /** 保定容城县 */
    VALUE_130629("130629"),
    /** 保定涞源县 */
    VALUE_130630("130630"),
    /** 保定望都县 */
    VALUE_130631("130631"),
    /** 保定安新县 */
    VALUE_130632("130632"),
    /** 保定易县 */
    VALUE_130633("130633"),
    /** 保定曲阳县 */
    VALUE_130634("130634"),
    /** 保定蠡县 */
    VALUE_130635("130635"),
    /** 保定顺平县 */
    VALUE_130636("130636"),
    /** 保定博野县 */
    VALUE_130637("130637"),
    /** 保定雄县 */
    VALUE_130638("130638"),
    /** 保定涿州市 */
    VALUE_130681("130681"),
    /** 保定安国市 */
    VALUE_130683("130683"),
    /** 保定高碑店市 */
    VALUE_130684("130684"),
    /** 张家口市 */
    VALUE_130700("130700"),
    /** 张家口桥东区 */
    VALUE_130702("130702"),
    /** 张家口桥西区 */
    VALUE_130703("130703"),
    /** 张家口宣化区 */
    VALUE_130705("130705"),
    /** 张家口下花园区 */
    VALUE_130706("130706"),
    /** 张家口宣化县 */
    VALUE_130721("130721"),
    /** 张家口张北县 */
    VALUE_130722("130722"),
    /** 张家口康保县 */
    VALUE_130723("130723"),
    /** 张家口沽源县 */
    VALUE_130724("130724"),
    /** 张家口尚义县 */
    VALUE_130725("130725"),
    /** 张家口蔚县 */
    VALUE_130726("130726"),
    /** 张家口阳原县 */
    VALUE_130727("130727"),
    /** 张家口怀安县 */
    VALUE_130728("130728"),
    /** 张家口万全县 */
    VALUE_130729("130729"),
    /** 张家口怀来县 */
    VALUE_130730("130730"),
    /** 张家口涿鹿县 */
    VALUE_130731("130731"),
    /** 张家口赤城县 */
    VALUE_130732("130732"),
    /** 张家口崇礼县 */
    VALUE_130733("130733"),
    /** 承德市 */
    VALUE_130800("130800"),
    /** 承德双桥区 */
    VALUE_130802("130802"),
    /** 承德双滦区 */
    VALUE_130803("130803"),
    /** 承德鹰手营子矿区 */
    VALUE_130804("130804"),
    /** 承德县 */
    VALUE_130821("130821"),
    /** 承德兴隆县 */
    VALUE_130822("130822"),
    /** 承德平泉县 */
    VALUE_130823("130823"),
    /** 承德滦平县 */
    VALUE_130824("130824"),
    /** 承德隆化县 */
    VALUE_130825("130825"),
    /** 承德丰宁满族自治县 */
    VALUE_130826("130826"),
    /** 承德宽城满族自治县 */
    VALUE_130827("130827"),
    /** 承德围场满族蒙古族自治县 */
    VALUE_130828("130828"),
    /** 沧州市 */
    VALUE_130900("130900"),
    /** 沧州新华区 */
    VALUE_130902("130902"),
    /** 沧州运河区 */
    VALUE_130903("130903"),
    /** 沧州沧县 */
    VALUE_130921("130921"),
    /** 沧州青县 */
    VALUE_130922("130922"),
    /** 沧州东光县 */
    VALUE_130923("130923"),
    /** 沧州海兴县 */
    VALUE_130924("130924"),
    /** 沧州盐山县 */
    VALUE_130925("130925"),
    /** 沧州肃宁县 */
    VALUE_130926("130926"),
    /** 沧州南皮县 */
    VALUE_130927("130927"),
    /** 沧州吴桥县 */
    VALUE_130928("130928"),
    /** 沧州献县 */
    VALUE_130929("130929"),
    /** 沧州孟村回族自治县 */
    VALUE_130930("130930"),
    /** 沧州泊头市 */
    VALUE_130981("130981"),
    /** 沧州任丘市 */
    VALUE_130982("130982"),
    /** 沧州黄骅市 */
    VALUE_130983("130983"),
    /** 沧州河间市 */
    VALUE_130984("130984"),
    /** 廊坊市 */
    VALUE_131000("131000"),
    /** 廊坊安次区 */
    VALUE_131002("131002"),
    /** 廊坊广阳区 */
    VALUE_131003("131003"),
    /** 廊坊固安县 */
    VALUE_131022("131022"),
    /** 廊坊永清县 */
    VALUE_131023("131023"),
    /** 廊坊香河县 */
    VALUE_131024("131024"),
    /** 廊坊大城县 */
    VALUE_131025("131025"),
    /** 廊坊文安县 */
    VALUE_131026("131026"),
    /** 廊坊大厂回族自治县 */
    VALUE_131028("131028"),
    /** 廊坊霸州市 */
    VALUE_131081("131081"),
    /** 廊坊三河市 */
    VALUE_131082("131082"),
    /** 衡水市 */
    VALUE_131100("131100"),
    /** 衡水桃城区 */
    VALUE_131102("131102"),
    /** 衡水枣强县 */
    VALUE_131121("131121"),
    /** 衡水武邑县 */
    VALUE_131122("131122"),
    /** 衡水武强县 */
    VALUE_131123("131123"),
    /** 衡水饶阳县 */
    VALUE_131124("131124"),
    /** 衡水安平县 */
    VALUE_131125("131125"),
    /** 衡水故城县 */
    VALUE_131126("131126"),
    /** 衡水景县 */
    VALUE_131127("131127"),
    /** 衡水阜城县 */
    VALUE_131128("131128"),
    /** 衡水冀州市 */
    VALUE_131181("131181"),
    /** 衡水深州市 */
    VALUE_131182("131182"),
    /** 河北省定州市 */
    VALUE_139001("139001"),
    /** 河北省辛集市 */
    VALUE_139002("139002"),
    /** 太原市 */
    VALUE_140100("140100"),
    /** 太原小店区 */
    VALUE_140105("140105"),
    /** 太原迎泽区 */
    VALUE_140106("140106"),
    /** 太原杏花岭区 */
    VALUE_140107("140107"),
    /** 太原尖草坪区 */
    VALUE_140108("140108"),
    /** 太原万柏林区 */
    VALUE_140109("140109"),
    /** 太原晋源区 */
    VALUE_140110("140110"),
    /** 太原清徐县 */
    VALUE_140121("140121"),
    /** 太原阳曲县 */
    VALUE_140122("140122"),
    /** 太原娄烦县 */
    VALUE_140123("140123"),
    /** 太原古交市 */
    VALUE_140181("140181"),
    /** 大同市 */
    VALUE_140200("140200"),
    /** 大同城区 */
    VALUE_140202("140202"),
    /** 大同矿区 */
    VALUE_140203("140203"),
    /** 大同南郊区 */
    VALUE_140211("140211"),
    /** 大同新荣区 */
    VALUE_140212("140212"),
    /** 大同阳高县 */
    VALUE_140221("140221"),
    /** 大同天镇县 */
    VALUE_140222("140222"),
    /** 大同广灵县 */
    VALUE_140223("140223"),
    /** 大同灵丘县 */
    VALUE_140224("140224"),
    /** 大同浑源县 */
    VALUE_140225("140225"),
    /** 大同左云县 */
    VALUE_140226("140226"),
    /** 大同县 */
    VALUE_140227("140227"),
    /** 阳泉市 */
    VALUE_140300("140300"),
    /** 阳泉城区 */
    VALUE_140302("140302"),
    /** 阳泉矿区 */
    VALUE_140303("140303"),
    /** 阳泉郊区 */
    VALUE_140311("140311"),
    /** 阳泉平定县 */
    VALUE_140321("140321"),
    /** 阳泉盂县 */
    VALUE_140322("140322"),
    /** 长治市 */
    VALUE_140400("140400"),
    /** 长治城区 */
    VALUE_140402("140402"),
    /** 长治郊区 */
    VALUE_140411("140411"),
    /** 长治县 */
    VALUE_140421("140421"),
    /** 长治襄垣县 */
    VALUE_140423("140423"),
    /** 长治屯留县 */
    VALUE_140424("140424"),
    /** 长治平顺县 */
    VALUE_140425("140425"),
    /** 长治黎城县 */
    VALUE_140426("140426"),
    /** 长治壶关县 */
    VALUE_140427("140427"),
    /** 长治长子县 */
    VALUE_140428("140428"),
    /** 长治武乡县 */
    VALUE_140429("140429"),
    /** 长治沁县 */
    VALUE_140430("140430"),
    /** 长治沁源县 */
    VALUE_140431("140431"),
    /** 长治潞城市 */
    VALUE_140481("140481"),
    /** 晋城市 */
    VALUE_140500("140500"),
    /** 晋城城区 */
    VALUE_140502("140502"),
    /** 晋城沁水县 */
    VALUE_140521("140521"),
    /** 晋城阳城县 */
    VALUE_140522("140522"),
    /** 晋城陵川县 */
    VALUE_140524("140524"),
    /** 晋城泽州县 */
    VALUE_140525("140525"),
    /** 晋城高平市 */
    VALUE_140581("140581"),
    /** 朔州市 */
    VALUE_140600("140600"),
    /** 朔州朔城区 */
    VALUE_140602("140602"),
    /** 朔州平鲁区 */
    VALUE_140603("140603"),
    /** 朔州山阴县 */
    VALUE_140621("140621"),
    /** 朔州应县 */
    VALUE_140622("140622"),
    /** 朔州右玉县 */
    VALUE_140623("140623"),
    /** 朔州怀仁县 */
    VALUE_140624("140624"),
    /** 晋中市 */
    VALUE_140700("140700"),
    /** 晋中榆次区 */
    VALUE_140702("140702"),
    /** 晋中榆社县 */
    VALUE_140721("140721"),
    /** 晋中左权县 */
    VALUE_140722("140722"),
    /** 晋中和顺县 */
    VALUE_140723("140723"),
    /** 晋中昔阳县 */
    VALUE_140724("140724"),
    /** 晋中寿阳县 */
    VALUE_140725("140725"),
    /** 晋中太谷县 */
    VALUE_140726("140726"),
    /** 晋中祁县 */
    VALUE_140727("140727"),
    /** 晋中平遥县 */
    VALUE_140728("140728"),
    /** 晋中灵石县 */
    VALUE_140729("140729"),
    /** 晋中介休市 */
    VALUE_140781("140781"),
    /** 运城市 */
    VALUE_140800("140800"),
    /** 运城盐湖区 */
    VALUE_140802("140802"),
    /** 运城临猗县 */
    VALUE_140821("140821"),
    /** 运城万荣县 */
    VALUE_140822("140822"),
    /** 运城闻喜县 */
    VALUE_140823("140823"),
    /** 运城稷山县 */
    VALUE_140824("140824"),
    /** 运城新绛县 */
    VALUE_140825("140825"),
    /** 运城绛县 */
    VALUE_140826("140826"),
    /** 运城垣曲县 */
    VALUE_140827("140827"),
    /** 运城夏县 */
    VALUE_140828("140828"),
    /** 运城平陆县 */
    VALUE_140829("140829"),
    /** 运城芮城县 */
    VALUE_140830("140830"),
    /** 运城永济市 */
    VALUE_140881("140881"),
    /** 运城河津市 */
    VALUE_140882("140882"),
    /** 忻州市 */
    VALUE_140900("140900"),
    /** 忻州忻府区 */
    VALUE_140902("140902"),
    /** 忻州定襄县 */
    VALUE_140921("140921"),
    /** 忻州五台县 */
    VALUE_140922("140922"),
    /** 忻州代县 */
    VALUE_140923("140923"),
    /** 忻州繁峙县 */
    VALUE_140924("140924"),
    /** 忻州宁武县 */
    VALUE_140925("140925"),
    /** 忻州静乐县 */
    VALUE_140926("140926"),
    /** 忻州神池县 */
    VALUE_140927("140927"),
    /** 忻州五寨县 */
    VALUE_140928("140928"),
    /** 忻州岢岚县 */
    VALUE_140929("140929"),
    /** 忻州河曲县 */
    VALUE_140930("140930"),
    /** 忻州保德县 */
    VALUE_140931("140931"),
    /** 忻州偏关县 */
    VALUE_140932("140932"),
    /** 忻州原平市 */
    VALUE_140981("140981"),
    /** 临汾市 */
    VALUE_141000("141000"),
    /** 临汾尧都区 */
    VALUE_141002("141002"),
    /** 临汾曲沃县 */
    VALUE_141021("141021"),
    /** 临汾翼城县 */
    VALUE_141022("141022"),
    /** 临汾襄汾县 */
    VALUE_141023("141023"),
    /** 临汾洪洞县 */
    VALUE_141024("141024"),
    /** 临汾古县 */
    VALUE_141025("141025"),
    /** 临汾安泽县 */
    VALUE_141026("141026"),
    /** 临汾浮山县 */
    VALUE_141027("141027"),
    /** 临汾吉县 */
    VALUE_141028("141028"),
    /** 临汾乡宁县 */
    VALUE_141029("141029"),
    /** 临汾大宁县 */
    VALUE_141030("141030"),
    /** 临汾隰县 */
    VALUE_141031("141031"),
    /** 临汾永和县 */
    VALUE_141032("141032"),
    /** 临汾蒲县 */
    VALUE_141033("141033"),
    /** 临汾汾西县 */
    VALUE_141034("141034"),
    /** 临汾侯马市 */
    VALUE_141081("141081"),
    /** 临汾霍州市 */
    VALUE_141082("141082"),
    /** 吕梁市 */
    VALUE_141100("141100"),
    /** 吕梁离石区 */
    VALUE_141102("141102"),
    /** 吕梁文水县 */
    VALUE_141121("141121"),
    /** 吕梁交城县 */
    VALUE_141122("141122"),
    /** 吕梁兴县 */
    VALUE_141123("141123"),
    /** 吕梁临县 */
    VALUE_141124("141124"),
    /** 吕梁柳林县 */
    VALUE_141125("141125"),
    /** 吕梁石楼县 */
    VALUE_141126("141126"),
    /** 吕梁岚县 */
    VALUE_141127("141127"),
    /** 吕梁方山县 */
    VALUE_141128("141128"),
    /** 吕梁中阳县 */
    VALUE_141129("141129"),
    /** 吕梁交口县 */
    VALUE_141130("141130"),
    /** 吕梁孝义市 */
    VALUE_141181("141181"),
    /** 吕梁汾阳市 */
    VALUE_141182("141182"),
    /** 呼和浩特市 */
    VALUE_150100("150100"),
    /** 呼和浩特新城区 */
    VALUE_150102("150102"),
    /** 呼和浩特回民区 */
    VALUE_150103("150103"),
    /** 呼和浩特玉泉区 */
    VALUE_150104("150104"),
    /** 呼和浩特赛罕区 */
    VALUE_150105("150105"),
    /** 呼和浩特土默特左旗 */
    VALUE_150121("150121"),
    /** 呼和浩特托克托县 */
    VALUE_150122("150122"),
    /** 呼和浩特和林格尔县 */
    VALUE_150123("150123"),
    /** 呼和浩特清水河县 */
    VALUE_150124("150124"),
    /** 呼和浩特武川县 */
    VALUE_150125("150125"),
    /** 包头市 */
    VALUE_150200("150200"),
    /** 包头东河区 */
    VALUE_150202("150202"),
    /** 包头昆都仑区 */
    VALUE_150203("150203"),
    /** 包头青山区 */
    VALUE_150204("150204"),
    /** 包头石拐区 */
    VALUE_150205("150205"),
    /** 包头白云鄂博矿区 */
    VALUE_150206("150206"),
    /** 包头九原区 */
    VALUE_150207("150207"),
    /** 包头土默特右旗 */
    VALUE_150221("150221"),
    /** 包头固阳县 */
    VALUE_150222("150222"),
    /** 包头达尔罕茂明安联合旗 */
    VALUE_150223("150223"),
    /** 乌海市 */
    VALUE_150300("150300"),
    /** 乌海海勃湾区 */
    VALUE_150302("150302"),
    /** 乌海海南区 */
    VALUE_150303("150303"),
    /** 乌海乌达区 */
    VALUE_150304("150304"),
    /** 赤峰市 */
    VALUE_150400("150400"),
    /** 赤峰红山区 */
    VALUE_150402("150402"),
    /** 赤峰元宝山区 */
    VALUE_150403("150403"),
    /** 赤峰松山区 */
    VALUE_150404("150404"),
    /** 赤峰阿鲁科尔沁旗 */
    VALUE_150421("150421"),
    /** 赤峰巴林左旗 */
    VALUE_150422("150422"),
    /** 赤峰巴林右旗 */
    VALUE_150423("150423"),
    /** 赤峰林西县 */
    VALUE_150424("150424"),
    /** 赤峰克什克腾旗 */
    VALUE_150425("150425"),
    /** 赤峰翁牛特旗 */
    VALUE_150426("150426"),
    /** 赤峰喀喇沁旗 */
    VALUE_150428("150428"),
    /** 赤峰宁城县 */
    VALUE_150429("150429"),
    /** 赤峰敖汉旗 */
    VALUE_150430("150430"),
    /** 通辽市 */
    VALUE_150500("150500"),
    /** 通辽科尔沁区 */
    VALUE_150502("150502"),
    /** 通辽科尔沁左翼中旗 */
    VALUE_150521("150521"),
    /** 通辽科尔沁左翼后旗 */
    VALUE_150522("150522"),
    /** 通辽开鲁县 */
    VALUE_150523("150523"),
    /** 通辽库伦旗 */
    VALUE_150524("150524"),
    /** 通辽奈曼旗 */
    VALUE_150525("150525"),
    /** 通辽扎鲁特旗 */
    VALUE_150526("150526"),
    /** 通辽霍林郭勒市 */
    VALUE_150581("150581"),
    /** 鄂尔多斯市 */
    VALUE_150600("150600"),
    /** 鄂尔多斯东胜区 */
    VALUE_150602("150602"),
    /** 鄂尔多斯达拉特旗 */
    VALUE_150621("150621"),
    /** 鄂尔多斯准格尔旗 */
    VALUE_150622("150622"),
    /** 鄂尔多斯鄂托克前旗 */
    VALUE_150623("150623"),
    /** 鄂尔多斯鄂托克旗 */
    VALUE_150624("150624"),
    /** 鄂尔多斯杭锦旗 */
    VALUE_150625("150625"),
    /** 鄂尔多斯乌审旗 */
    VALUE_150626("150626"),
    /** 鄂尔多斯伊金霍洛旗 */
    VALUE_150627("150627"),
    /** 呼伦贝尔市 */
    VALUE_150700("150700"),
    /** 呼伦贝尔海拉尔区 */
    VALUE_150702("150702"),
    /** 呼伦贝尔扎赉诺尔区 */
    VALUE_150703("150703"),
    /** 呼伦贝尔阿荣旗 */
    VALUE_150721("150721"),
    /** 呼伦贝尔莫力达瓦达斡尔族自治旗 */
    VALUE_150722("150722"),
    /** 呼伦贝尔鄂伦春自治旗 */
    VALUE_150723("150723"),
    /** 呼伦贝尔鄂温克族自治旗 */
    VALUE_150724("150724"),
    /** 呼伦贝尔陈巴尔虎旗 */
    VALUE_150725("150725"),
    /** 呼伦贝尔新巴尔虎左旗 */
    VALUE_150726("150726"),
    /** 呼伦贝尔新巴尔虎右旗 */
    VALUE_150727("150727"),
    /** 呼伦贝尔满洲里市 */
    VALUE_150781("150781"),
    /** 呼伦贝尔牙克石市 */
    VALUE_150782("150782"),
    /** 呼伦贝尔扎兰屯市 */
    VALUE_150783("150783"),
    /** 呼伦贝尔额尔古纳市 */
    VALUE_150784("150784"),
    /** 呼伦贝尔根河市 */
    VALUE_150785("150785"),
    /** 巴彦淖尔市 */
    VALUE_150800("150800"),
    /** 巴彦淖尔临河区 */
    VALUE_150802("150802"),
    /** 巴彦淖尔五原县 */
    VALUE_150821("150821"),
    /** 巴彦淖尔磴口县 */
    VALUE_150822("150822"),
    /** 巴彦淖尔乌拉特前旗 */
    VALUE_150823("150823"),
    /** 巴彦淖尔乌拉特中旗 */
    VALUE_150824("150824"),
    /** 巴彦淖尔乌拉特后旗 */
    VALUE_150825("150825"),
    /** 巴彦淖尔杭锦后旗 */
    VALUE_150826("150826"),
    /** 乌兰察布市 */
    VALUE_150900("150900"),
    /** 乌兰察布市集宁区 */
    VALUE_150902("150902"),
    /** 乌兰察布市卓资县 */
    VALUE_150921("150921"),
    /** 乌兰察布市化德县 */
    VALUE_150922("150922"),
    /** 乌兰察布市商都县 */
    VALUE_150923("150923"),
    /** 乌兰察布市兴和县 */
    VALUE_150924("150924"),
    /** 乌兰察布市凉城县 */
    VALUE_150925("150925"),
    /** 乌兰察布市察哈尔右翼前旗 */
    VALUE_150926("150926"),
    /** 乌兰察布市察哈尔右翼中旗 */
    VALUE_150927("150927"),
    /** 乌兰察布市察哈尔右翼后旗 */
    VALUE_150928("150928"),
    /** 乌兰察布市四子王旗 */
    VALUE_150929("150929"),
    /** 乌兰察布市丰镇市 */
    VALUE_150981("150981"),
    /** 兴安盟 */
    VALUE_152200("152200"),
    /** 兴安盟乌兰浩特市 */
    VALUE_152201("152201"),
    /** 兴安盟阿尔山市 */
    VALUE_152202("152202"),
    /** 兴安盟科尔沁右翼前旗 */
    VALUE_152221("152221"),
    /** 兴安盟科尔沁右翼中旗 */
    VALUE_152222("152222"),
    /** 兴安盟扎赉特旗 */
    VALUE_152223("152223"),
    /** 兴安盟突泉县 */
    VALUE_152224("152224"),
    /** 锡林郭勒盟 */
    VALUE_152500("152500"),
    /** 锡林郭勒盟二连浩特市 */
    VALUE_152501("152501"),
    /** 锡林浩特市 */
    VALUE_152502("152502"),
    /** 锡林郭勒盟阿巴嘎旗 */
    VALUE_152522("152522"),
    /** 锡林郭勒盟苏尼特左旗 */
    VALUE_152523("152523"),
    /** 锡林郭勒盟苏尼特右旗 */
    VALUE_152524("152524"),
    /** 锡林郭勒盟东乌珠穆沁旗 */
    VALUE_152525("152525"),
    /** 锡林郭勒盟西乌珠穆沁旗 */
    VALUE_152526("152526"),
    /** 锡林郭勒盟太仆寺旗 */
    VALUE_152527("152527"),
    /** 锡林郭勒盟镶黄旗 */
    VALUE_152528("152528"),
    /** 锡林郭勒盟正镶白旗 */
    VALUE_152529("152529"),
    /** 锡林郭勒盟正蓝旗 */
    VALUE_152530("152530"),
    /** 锡林郭勒盟多伦县 */
    VALUE_152531("152531"),
    /** 阿拉善盟 */
    VALUE_152900("152900"),
    /** 阿拉善左旗 */
    VALUE_152921("152921"),
    /** 阿拉善右旗 */
    VALUE_152922("152922"),
    /** 阿拉善盟额济纳旗 */
    VALUE_152923("152923"),
    /** 沈阳市 */
    VALUE_210100("210100"),
    /** 沈阳和平区 */
    VALUE_210102("210102"),
    /** 沈阳沈河区 */
    VALUE_210103("210103"),
    /** 沈阳大东区 */
    VALUE_210104("210104"),
    /** 沈阳皇姑区 */
    VALUE_210105("210105"),
    /** 沈阳铁西区 */
    VALUE_210106("210106"),
    /** 沈阳苏家屯区 */
    VALUE_210111("210111"),
    /** 沈阳东陵区 */
    VALUE_210112("210112"),
    /** 沈阳沈北新区 */
    VALUE_210113("210113"),
    /** 沈阳于洪区 */
    VALUE_210114("210114"),
    /** 沈阳辽中县 */
    VALUE_210122("210122"),
    /** 沈阳康平县 */
    VALUE_210123("210123"),
    /** 沈阳法库县 */
    VALUE_210124("210124"),
    /** 沈阳新民市 */
    VALUE_210181("210181"),
    /** 大连市 */
    VALUE_210200("210200"),
    /** 大连中山区 */
    VALUE_210202("210202"),
    /** 大连西岗区 */
    VALUE_210203("210203"),
    /** 大连沙河口区 */
    VALUE_210204("210204"),
    /** 大连甘井子区 */
    VALUE_210211("210211"),
    /** 大连旅顺口区 */
    VALUE_210212("210212"),
    /** 大连金州区 */
    VALUE_210213("210213"),
    /** 大连长海县 */
    VALUE_210224("210224"),
    /** 大连瓦房店市 */
    VALUE_210281("210281"),
    /** 大连普兰店市 */
    VALUE_210282("210282"),
    /** 大连庄河市 */
    VALUE_210283("210283"),
    /** 鞍山市 */
    VALUE_210300("210300"),
    /** 鞍山铁东区 */
    VALUE_210302("210302"),
    /** 鞍山铁西区 */
    VALUE_210303("210303"),
    /** 鞍山立山区 */
    VALUE_210304("210304"),
    /** 鞍山千山区 */
    VALUE_210311("210311"),
    /** 鞍山台安县 */
    VALUE_210321("210321"),
    /** 鞍山岫岩满族自治县 */
    VALUE_210323("210323"),
    /** 鞍山海城市 */
    VALUE_210381("210381"),
    /** 抚顺市 */
    VALUE_210400("210400"),
    /** 抚顺新抚区 */
    VALUE_210402("210402"),
    /** 抚顺东洲区 */
    VALUE_210403("210403"),
    /** 抚顺望花区 */
    VALUE_210404("210404"),
    /** 抚顺顺城区 */
    VALUE_210411("210411"),
    /** 抚顺县 */
    VALUE_210421("210421"),
    /** 抚顺新宾满族自治县 */
    VALUE_210422("210422"),
    /** 抚顺清原满族自治县 */
    VALUE_210423("210423"),
    /** 本溪市 */
    VALUE_210500("210500"),
    /** 本溪平山区 */
    VALUE_210502("210502"),
    /** 本溪溪湖区 */
    VALUE_210503("210503"),
    /** 本溪明山区 */
    VALUE_210504("210504"),
    /** 本溪南芬区 */
    VALUE_210505("210505"),
    /** 本溪满族自治县 */
    VALUE_210521("210521"),
    /** 本溪桓仁满族自治县 */
    VALUE_210522("210522"),
    /** 丹东市 */
    VALUE_210600("210600"),
    /** 丹东元宝区 */
    VALUE_210602("210602"),
    /** 丹东振兴区 */
    VALUE_210603("210603"),
    /** 丹东振安区 */
    VALUE_210604("210604"),
    /** 丹东宽甸满族自治县 */
    VALUE_210624("210624"),
    /** 丹东东港市 */
    VALUE_210681("210681"),
    /** 丹东凤城市 */
    VALUE_210682("210682"),
    /** 锦州市 */
    VALUE_210700("210700"),
    /** 锦州古塔区 */
    VALUE_210702("210702"),
    /** 锦州凌河区 */
    VALUE_210703("210703"),
    /** 锦州太和区 */
    VALUE_210711("210711"),
    /** 锦州黑山县 */
    VALUE_210726("210726"),
    /** 锦州义县 */
    VALUE_210727("210727"),
    /** 锦州凌海市 */
    VALUE_210781("210781"),
    /** 锦州北镇市 */
    VALUE_210782("210782"),
    /** 营口市 */
    VALUE_210800("210800"),
    /** 营口站前区 */
    VALUE_210802("210802"),
    /** 营口西市区 */
    VALUE_210803("210803"),
    /** 营口鲅鱼圈区 */
    VALUE_210804("210804"),
    /** 营口老边区 */
    VALUE_210811("210811"),
    /** 营口盖州市 */
    VALUE_210881("210881"),
    /** 营口大石桥市 */
    VALUE_210882("210882"),
    /** 阜新市 */
    VALUE_210900("210900"),
    /** 阜新海州区 */
    VALUE_210902("210902"),
    /** 阜新新邱区 */
    VALUE_210903("210903"),
    /** 阜新太平区 */
    VALUE_210904("210904"),
    /** 阜新清河门区 */
    VALUE_210905("210905"),
    /** 阜新细河区 */
    VALUE_210911("210911"),
    /** 阜新蒙古族自治县 */
    VALUE_210921("210921"),
    /** 阜新彰武县 */
    VALUE_210922("210922"),
    /** 辽阳市 */
    VALUE_211000("211000"),
    /** 辽阳白塔区 */
    VALUE_211002("211002"),
    /** 辽阳文圣区 */
    VALUE_211003("211003"),
    /** 辽阳宏伟区 */
    VALUE_211004("211004"),
    /** 辽阳弓长岭区 */
    VALUE_211005("211005"),
    /** 辽阳太子河区 */
    VALUE_211011("211011"),
    /** 辽阳县 */
    VALUE_211021("211021"),
    /** 辽阳灯塔市 */
    VALUE_211081("211081"),
    /** 盘锦市 */
    VALUE_211100("211100"),
    /** 盘锦双台子区 */
    VALUE_211102("211102"),
    /** 盘锦兴隆台区 */
    VALUE_211103("211103"),
    /** 盘锦大洼县 */
    VALUE_211121("211121"),
    /** 盘锦盘山县 */
    VALUE_211122("211122"),
    /** 铁岭市 */
    VALUE_211200("211200"),
    /** 铁岭银州区 */
    VALUE_211202("211202"),
    /** 铁岭清河区 */
    VALUE_211204("211204"),
    /** 铁岭县 */
    VALUE_211221("211221"),
    /** 铁岭西丰县 */
    VALUE_211223("211223"),
    /** 铁岭昌图县 */
    VALUE_211224("211224"),
    /** 铁岭调兵山市 */
    VALUE_211281("211281"),
    /** 铁岭开原市 */
    VALUE_211282("211282"),
    /** 朝阳市 */
    VALUE_211300("211300"),
    /** 朝阳双塔区 */
    VALUE_211302("211302"),
    /** 朝阳龙城区 */
    VALUE_211303("211303"),
    /** 朝阳县 */
    VALUE_211321("211321"),
    /** 朝阳建平县 */
    VALUE_211322("211322"),
    /** 朝阳喀喇沁左翼蒙古族自治县 */
    VALUE_211324("211324"),
    /** 朝阳北票市 */
    VALUE_211381("211381"),
    /** 朝阳凌源市 */
    VALUE_211382("211382"),
    /** 葫芦岛市 */
    VALUE_211400("211400"),
    /** 葫芦岛连山区 */
    VALUE_211402("211402"),
    /** 葫芦岛龙港区 */
    VALUE_211403("211403"),
    /** 葫芦岛南票区 */
    VALUE_211404("211404"),
    /** 葫芦岛绥中县 */
    VALUE_211421("211421"),
    /** 葫芦岛建昌县 */
    VALUE_211422("211422"),
    /** 葫芦岛兴城市 */
    VALUE_211481("211481"),
    /** 长春市 */
    VALUE_220100("220100"),
    /** 长春南关区 */
    VALUE_220102("220102"),
    /** 长春宽城区 */
    VALUE_220103("220103"),
    /** 长春朝阳区 */
    VALUE_220104("220104"),
    /** 长春二道区 */
    VALUE_220105("220105"),
    /** 长春绿园区 */
    VALUE_220106("220106"),
    /** 长春双阳区 */
    VALUE_220112("220112"),
    /** 长春市九台区 */
    VALUE_220113("220113"),
    /** 长春农安县 */
    VALUE_220122("220122"),
    /** 长春榆树市 */
    VALUE_220182("220182"),
    /** 长春德惠市 */
    VALUE_220183("220183"),
    /** 吉林市 */
    VALUE_220200("220200"),
    /** 吉林昌邑区 */
    VALUE_220202("220202"),
    /** 吉林龙潭区 */
    VALUE_220203("220203"),
    /** 吉林船营区 */
    VALUE_220204("220204"),
    /** 吉林丰满区 */
    VALUE_220211("220211"),
    /** 吉林永吉县 */
    VALUE_220221("220221"),
    /** 吉林蛟河市 */
    VALUE_220281("220281"),
    /** 吉林桦甸市 */
    VALUE_220282("220282"),
    /** 吉林舒兰市 */
    VALUE_220283("220283"),
    /** 吉林磐石市 */
    VALUE_220284("220284"),
    /** 四平市 */
    VALUE_220300("220300"),
    /** 四平铁西区 */
    VALUE_220302("220302"),
    /** 四平铁东区 */
    VALUE_220303("220303"),
    /** 四平梨树县 */
    VALUE_220322("220322"),
    /** 四平伊通满族自治县 */
    VALUE_220323("220323"),
    /** 四平公主岭市 */
    VALUE_220381("220381"),
    /** 四平双辽市 */
    VALUE_220382("220382"),
    /** 辽源市 */
    VALUE_220400("220400"),
    /** 辽源龙山区 */
    VALUE_220402("220402"),
    /** 辽源西安区 */
    VALUE_220403("220403"),
    /** 辽源东丰县 */
    VALUE_220421("220421"),
    /** 辽源东辽县 */
    VALUE_220422("220422"),
    /** 通化市 */
    VALUE_220500("220500"),
    /** 通化东昌区 */
    VALUE_220502("220502"),
    /** 通化二道江区 */
    VALUE_220503("220503"),
    /** 通化县 */
    VALUE_220521("220521"),
    /** 通化辉南县 */
    VALUE_220523("220523"),
    /** 通化柳河县 */
    VALUE_220524("220524"),
    /** 通化梅河口市 */
    VALUE_220581("220581"),
    /** 通化集安市 */
    VALUE_220582("220582"),
    /** 白山市 */
    VALUE_220600("220600"),
    /** 白山浑江区 */
    VALUE_220602("220602"),
    /** 白山市江源区 */
    VALUE_220605("220605"),
    /** 白山抚松县 */
    VALUE_220621("220621"),
    /** 白山靖宇县 */
    VALUE_220622("220622"),
    /** 白山长白朝鲜族自治县 */
    VALUE_220623("220623"),
    /** 白山临江市 */
    VALUE_220681("220681"),
    /** 松原市 */
    VALUE_220700("220700"),
    /** 松原宁江区 */
    VALUE_220702("220702"),
    /** 松原前郭尔罗斯蒙古族自治县 */
    VALUE_220721("220721"),
    /** 松原长岭县 */
    VALUE_220722("220722"),
    /** 松原乾安县 */
    VALUE_220723("220723"),
    /** 松原市扶余市 */
    VALUE_220781("220781"),
    /** 白城市 */
    VALUE_220800("220800"),
    /** 白城洮北区 */
    VALUE_220802("220802"),
    /** 白城镇赉县 */
    VALUE_220821("220821"),
    /** 白城通榆县 */
    VALUE_220822("220822"),
    /** 白城洮南市 */
    VALUE_220881("220881"),
    /** 白城大安市 */
    VALUE_220882("220882"),
    /** 延边朝鲜族自治州 */
    VALUE_222400("222400"),
    /** 延边延吉市 */
    VALUE_222401("222401"),
    /** 延边图们市 */
    VALUE_222402("222402"),
    /** 延边敦化市 */
    VALUE_222403("222403"),
    /** 延边珲春市 */
    VALUE_222404("222404"),
    /** 延边龙井市 */
    VALUE_222405("222405"),
    /** 延边和龙市 */
    VALUE_222406("222406"),
    /** 延边汪清县 */
    VALUE_222424("222424"),
    /** 延边安图县 */
    VALUE_222426("222426"),
    /** 哈尔滨市 */
    VALUE_230100("230100"),
    /** 哈尔滨道里区 */
    VALUE_230102("230102"),
    /** 哈尔滨南岗区 */
    VALUE_230103("230103"),
    /** 哈尔滨道外区 */
    VALUE_230104("230104"),
    /** 哈尔滨平房区 */
    VALUE_230108("230108"),
    /** 哈尔滨松北区 */
    VALUE_230109("230109"),
    /** 哈尔滨香坊区 */
    VALUE_230110("230110"),
    /** 哈尔滨呼兰区 */
    VALUE_230111("230111"),
    /** 哈尔滨阿城区 */
    VALUE_230112("230112"),
    /** 哈尔滨依兰县 */
    VALUE_230123("230123"),
    /** 哈尔滨方正县 */
    VALUE_230124("230124"),
    /** 哈尔滨宾县 */
    VALUE_230125("230125"),
    /** 哈尔滨巴彦县 */
    VALUE_230126("230126"),
    /** 哈尔滨木兰县 */
    VALUE_230127("230127"),
    /** 哈尔滨通河县 */
    VALUE_230128("230128"),
    /** 哈尔滨延寿县 */
    VALUE_230129("230129"),
    /** 哈尔滨双城市 */
    VALUE_230182("230182"),
    /** 哈尔滨尚志市 */
    VALUE_230183("230183"),
    /** 哈尔滨五常市 */
    VALUE_230184("230184"),
    /** 齐齐哈尔市 */
    VALUE_230200("230200"),
    /** 齐齐哈尔龙沙区 */
    VALUE_230202("230202"),
    /** 齐齐哈尔建华区 */
    VALUE_230203("230203"),
    /** 齐齐哈尔铁锋区 */
    VALUE_230204("230204"),
    /** 齐齐哈尔昂昂溪区 */
    VALUE_230205("230205"),
    /** 齐齐哈尔富拉尔基区 */
    VALUE_230206("230206"),
    /** 齐齐哈尔碾子山区 */
    VALUE_230207("230207"),
    /** 齐齐哈尔梅里斯达斡尔族区 */
    VALUE_230208("230208"),
    /** 齐齐哈尔龙江县 */
    VALUE_230221("230221"),
    /** 齐齐哈尔依安县 */
    VALUE_230223("230223"),
    /** 齐齐哈尔泰来县 */
    VALUE_230224("230224"),
    /** 齐齐哈尔甘南县 */
    VALUE_230225("230225"),
    /** 齐齐哈尔富裕县 */
    VALUE_230227("230227"),
    /** 齐齐哈尔克山县 */
    VALUE_230229("230229"),
    /** 齐齐哈尔克东县 */
    VALUE_230230("230230"),
    /** 齐齐哈尔拜泉县 */
    VALUE_230231("230231"),
    /** 齐齐哈尔讷河市 */
    VALUE_230281("230281"),
    /** 鸡西市 */
    VALUE_230300("230300"),
    /** 鸡西鸡冠区 */
    VALUE_230302("230302"),
    /** 鸡西恒山区 */
    VALUE_230303("230303"),
    /** 鸡西滴道区 */
    VALUE_230304("230304"),
    /** 鸡西梨树区 */
    VALUE_230305("230305"),
    /** 鸡西城子河区 */
    VALUE_230306("230306"),
    /** 鸡西麻山区 */
    VALUE_230307("230307"),
    /** 鸡西鸡东县 */
    VALUE_230321("230321"),
    /** 鸡西虎林市 */
    VALUE_230381("230381"),
    /** 鸡西密山市 */
    VALUE_230382("230382"),
    /** 鹤岗市 */
    VALUE_230400("230400"),
    /** 鹤岗向阳区 */
    VALUE_230402("230402"),
    /** 鹤岗工农区 */
    VALUE_230403("230403"),
    /** 鹤岗南山区 */
    VALUE_230404("230404"),
    /** 鹤岗兴安区 */
    VALUE_230405("230405"),
    /** 鹤岗东山区 */
    VALUE_230406("230406"),
    /** 鹤岗兴山区 */
    VALUE_230407("230407"),
    /** 鹤岗萝北县 */
    VALUE_230421("230421"),
    /** 鹤岗绥滨县 */
    VALUE_230422("230422"),
    /** 双鸭山市 */
    VALUE_230500("230500"),
    /** 双鸭山尖山区 */
    VALUE_230502("230502"),
    /** 双鸭山岭东区 */
    VALUE_230503("230503"),
    /** 双鸭山四方台区 */
    VALUE_230505("230505"),
    /** 双鸭山宝山区 */
    VALUE_230506("230506"),
    /** 双鸭山集贤县 */
    VALUE_230521("230521"),
    /** 双鸭山友谊县 */
    VALUE_230522("230522"),
    /** 双鸭山宝清县 */
    VALUE_230523("230523"),
    /** 双鸭山饶河县 */
    VALUE_230524("230524"),
    /** 大庆市 */
    VALUE_230600("230600"),
    /** 大庆市萨尔图区 */
    VALUE_230602("230602"),
    /** 大庆市龙凤区 */
    VALUE_230603("230603"),
    /** 大庆市让胡路区 */
    VALUE_230604("230604"),
    /** 大庆市红岗区 */
    VALUE_230605("230605"),
    /** 大庆市大同区 */
    VALUE_230606("230606"),
    /** 大庆市肇州县 */
    VALUE_230621("230621"),
    /** 大庆市肇源县 */
    VALUE_230622("230622"),
    /** 大庆市林甸县 */
    VALUE_230623("230623"),
    /** 大庆市杜尔伯特蒙古族自治县 */
    VALUE_230624("230624"),
    /** 伊春市 */
    VALUE_230700("230700"),
    /** 伊春区 */
    VALUE_230702("230702"),
    /** 伊春南岔区 */
    VALUE_230703("230703"),
    /** 伊春友好区 */
    VALUE_230704("230704"),
    /** 伊春西林区 */
    VALUE_230705("230705"),
    /** 伊春翠峦区 */
    VALUE_230706("230706"),
    /** 伊春新青区 */
    VALUE_230707("230707"),
    /** 伊春美溪区 */
    VALUE_230708("230708"),
    /** 伊春金山屯区 */
    VALUE_230709("230709"),
    /** 伊春五营区 */
    VALUE_230710("230710"),
    /** 伊春乌马河区 */
    VALUE_230711("230711"),
    /** 伊春汤旺河区 */
    VALUE_230712("230712"),
    /** 伊春带岭区 */
    VALUE_230713("230713"),
    /** 伊春乌伊岭区 */
    VALUE_230714("230714"),
    /** 伊春红星区 */
    VALUE_230715("230715"),
    /** 伊春上甘岭区 */
    VALUE_230716("230716"),
    /** 伊春嘉荫县 */
    VALUE_230722("230722"),
    /** 伊春铁力市 */
    VALUE_230781("230781"),
    /** 佳木斯市 */
    VALUE_230800("230800"),
    /** 佳木斯向阳区 */
    VALUE_230803("230803"),
    /** 佳木斯前进区 */
    VALUE_230804("230804"),
    /** 佳木斯东风区 */
    VALUE_230805("230805"),
    /** 佳木斯郊区 */
    VALUE_230811("230811"),
    /** 佳木斯桦南县 */
    VALUE_230822("230822"),
    /** 佳木斯桦川县 */
    VALUE_230826("230826"),
    /** 佳木斯汤原县 */
    VALUE_230828("230828"),
    /** 佳木斯抚远县 */
    VALUE_230833("230833"),
    /** 佳木斯同江市 */
    VALUE_230881("230881"),
    /** 佳木斯富锦市 */
    VALUE_230882("230882"),
    /** 七台河市 */
    VALUE_230900("230900"),
    /** 七台河新兴区 */
    VALUE_230902("230902"),
    /** 七台河桃山区 */
    VALUE_230903("230903"),
    /** 七台河茄子河区 */
    VALUE_230904("230904"),
    /** 七台河勃利县 */
    VALUE_230921("230921"),
    /** 牡丹江市 */
    VALUE_231000("231000"),
    /** 牡丹江东安区 */
    VALUE_231002("231002"),
    /** 牡丹江阳明区 */
    VALUE_231003("231003"),
    /** 牡丹江爱民区 */
    VALUE_231004("231004"),
    /** 牡丹江西安区 */
    VALUE_231005("231005"),
    /** 牡丹江东宁县 */
    VALUE_231024("231024"),
    /** 牡丹江林口县 */
    VALUE_231025("231025"),
    /** 牡丹江绥芬河市 */
    VALUE_231081("231081"),
    /** 牡丹江海林市 */
    VALUE_231083("231083"),
    /** 牡丹江宁安市 */
    VALUE_231084("231084"),
    /** 牡丹江穆棱市 */
    VALUE_231085("231085"),
    /** 黑河市 */
    VALUE_231100("231100"),
    /** 黑河爱辉区 */
    VALUE_231102("231102"),
    /** 黑河嫩江县 */
    VALUE_231121("231121"),
    /** 黑河逊克县 */
    VALUE_231123("231123"),
    /** 黑河孙吴县 */
    VALUE_231124("231124"),
    /** 黑河北安市 */
    VALUE_231181("231181"),
    /** 黑河五大连池市 */
    VALUE_231182("231182"),
    /** 绥化市 */
    VALUE_231200("231200"),
    /** 绥化北林区 */
    VALUE_231202("231202"),
    /** 绥化望奎县 */
    VALUE_231221("231221"),
    /** 绥化兰西县 */
    VALUE_231222("231222"),
    /** 绥化青冈县 */
    VALUE_231223("231223"),
    /** 绥化庆安县 */
    VALUE_231224("231224"),
    /** 绥化明水县 */
    VALUE_231225("231225"),
    /** 绥化绥棱县 */
    VALUE_231226("231226"),
    /** 绥化安达市 */
    VALUE_231281("231281"),
    /** 绥化肇东市 */
    VALUE_231282("231282"),
    /** 绥化海伦市 */
    VALUE_231283("231283"),
    /** 大兴安岭地区 */
    VALUE_232700("232700"),
    /** 大兴安岭呼玛县 */
    VALUE_232721("232721"),
    /** 大兴安岭塔河县 */
    VALUE_232722("232722"),
    /** 大兴安岭漠河县 */
    VALUE_232723("232723"),
    /** 上海市 */
    VALUE_310000("310000"),
    /** 上海市黄浦区 */
    VALUE_310101("310101"),
    /** 上海市徐汇区 */
    VALUE_310104("310104"),
    /** 上海市长宁区 */
    VALUE_310105("310105"),
    /** 上海市静安区 */
    VALUE_310106("310106"),
    /** 上海市普陀区 */
    VALUE_310107("310107"),
    /** 上海市闸北区 */
    VALUE_310108("310108"),
    /** 上海市虹口区 */
    VALUE_310109("310109"),
    /** 上海市杨浦区 */
    VALUE_310110("310110"),
    /** 上海市闵行区 */
    VALUE_310112("310112"),
    /** 上海市宝山区 */
    VALUE_310113("310113"),
    /** 上海市嘉定区 */
    VALUE_310114("310114"),
    /** 上海市浦东新区 */
    VALUE_310115("310115"),
    /** 上海市金山区 */
    VALUE_310116("310116"),
    /** 上海市松江区 */
    VALUE_310117("310117"),
    /** 上海市青浦区 */
    VALUE_310118("310118"),
    /** 上海市奉贤区 */
    VALUE_310120("310120"),
    /** 上海市崇明县 */
    VALUE_310230("310230"),
    /** 南京市 */
    VALUE_320100("320100"),
    /** 南京玄武区 */
    VALUE_320102("320102"),
    /** 南京秦淮区 */
    VALUE_320104("320104"),
    /** 南京建邺区 */
    VALUE_320105("320105"),
    /** 南京鼓楼区 */
    VALUE_320106("320106"),
    /** 南京浦口区 */
    VALUE_320111("320111"),
    /** 南京栖霞区 */
    VALUE_320113("320113"),
    /** 南京雨花台区 */
    VALUE_320114("320114"),
    /** 南京江宁区 */
    VALUE_320115("320115"),
    /** 南京六合区 */
    VALUE_320116("320116"),
    /** 南京市溧水区 */
    VALUE_320117("320117"),
    /** 南京市高淳区 */
    VALUE_320118("320118"),
    /** 无锡市 */
    VALUE_320200("320200"),
    /** 无锡崇安区 */
    VALUE_320202("320202"),
    /** 无锡南长区 */
    VALUE_320203("320203"),
    /** 无锡北塘区 */
    VALUE_320204("320204"),
    /** 无锡锡山区 */
    VALUE_320205("320205"),
    /** 无锡惠山区 */
    VALUE_320206("320206"),
    /** 无锡滨湖区 */
    VALUE_320211("320211"),
    /** 无锡江阴市 */
    VALUE_320281("320281"),
    /** 无锡宜兴市 */
    VALUE_320282("320282"),
    /** 徐州市 */
    VALUE_320300("320300"),
    /** 徐州鼓楼区 */
    VALUE_320302("320302"),
    /** 徐州云龙区 */
    VALUE_320303("320303"),
    /** 徐州贾汪区 */
    VALUE_320305("320305"),
    /** 徐州泉山区 */
    VALUE_320311("320311"),
    /** 徐州铜山区 */
    VALUE_320312("320312"),
    /** 徐州丰县 */
    VALUE_320321("320321"),
    /** 徐州沛县 */
    VALUE_320322("320322"),
    /** 徐州睢宁县 */
    VALUE_320324("320324"),
    /** 徐州新沂市 */
    VALUE_320381("320381"),
    /** 徐州邳州市 */
    VALUE_320382("320382"),
    /** 常州市 */
    VALUE_320400("320400"),
    /** 常州天宁区 */
    VALUE_320402("320402"),
    /** 常州钟楼区 */
    VALUE_320404("320404"),
    /** 常州戚墅堰区 */
    VALUE_320405("320405"),
    /** 常州新北区 */
    VALUE_320411("320411"),
    /** 常州武进区 */
    VALUE_320412("320412"),
    /** 常州溧阳市 */
    VALUE_320481("320481"),
    /** 常州金坛市 */
    VALUE_320482("320482"),
    /** 苏州市 */
    VALUE_320500("320500"),
    /** 苏州虎丘区 */
    VALUE_320505("320505"),
    /** 苏州吴中区 */
    VALUE_320506("320506"),
    /** 苏州相城区 */
    VALUE_320507("320507"),
    /** 苏州市姑苏区 */
    VALUE_320508("320508"),
    /** 苏州市吴江区 */
    VALUE_320509("320509"),
    /** 苏州常熟市 */
    VALUE_320581("320581"),
    /** 苏州张家港市 */
    VALUE_320582("320582"),
    /** 苏州昆山市 */
    VALUE_320583("320583"),
    /** 苏州太仓市 */
    VALUE_320585("320585"),
    /** 南通市 */
    VALUE_320600("320600"),
    /** 南通崇川区 */
    VALUE_320602("320602"),
    /** 南通港闸区 */
    VALUE_320611("320611"),
    /** 南通市通州区 */
    VALUE_320612("320612"),
    /** 南通海安县 */
    VALUE_320621("320621"),
    /** 南通如东县 */
    VALUE_320623("320623"),
    /** 南通启东市 */
    VALUE_320681("320681"),
    /** 南通如皋市 */
    VALUE_320682("320682"),
    /** 南通海门市 */
    VALUE_320684("320684"),
    /** 连云港市 */
    VALUE_320700("320700"),
    /** 连云区 */
    VALUE_320703("320703"),
    /** 连云港海州区 */
    VALUE_320706("320706"),
    /** 连云港市赣榆区 */
    VALUE_320707("320707"),
    /** 连云港东海县 */
    VALUE_320722("320722"),
    /** 连云港灌云县 */
    VALUE_320723("320723"),
    /** 连云港灌南县 */
    VALUE_320724("320724"),
    /** 淮安市 */
    VALUE_320800("320800"),
    /** 淮安清河区 */
    VALUE_320802("320802"),
    /** 淮安淮安区 */
    VALUE_320803("320803"),
    /** 淮安淮阴区 */
    VALUE_320804("320804"),
    /** 淮安清浦区 */
    VALUE_320811("320811"),
    /** 淮安涟水县 */
    VALUE_320826("320826"),
    /** 淮安洪泽县 */
    VALUE_320829("320829"),
    /** 淮安盱眙县 */
    VALUE_320830("320830"),
    /** 淮安金湖县 */
    VALUE_320831("320831"),
    /** 盐城市 */
    VALUE_320900("320900"),
    /** 盐城亭湖区 */
    VALUE_320902("320902"),
    /** 盐城盐都区 */
    VALUE_320903("320903"),
    /** 盐城响水县 */
    VALUE_320921("320921"),
    /** 盐城滨海县 */
    VALUE_320922("320922"),
    /** 盐城阜宁县 */
    VALUE_320923("320923"),
    /** 盐城射阳县 */
    VALUE_320924("320924"),
    /** 盐城建湖县 */
    VALUE_320925("320925"),
    /** 盐城东台市 */
    VALUE_320981("320981"),
    /** 盐城大丰市 */
    VALUE_320982("320982"),
    /** 扬州市 */
    VALUE_321000("321000"),
    /** 扬州广陵区 */
    VALUE_321002("321002"),
    /** 扬州邗江区 */
    VALUE_321003("321003"),
    /** 扬州市江都区 */
    VALUE_321012("321012"),
    /** 扬州宝应县 */
    VALUE_321023("321023"),
    /** 扬州仪征市 */
    VALUE_321081("321081"),
    /** 扬州高邮市 */
    VALUE_321084("321084"),
    /** 镇江市 */
    VALUE_321100("321100"),
    /** 镇江京口区 */
    VALUE_321102("321102"),
    /** 镇江润州区 */
    VALUE_321111("321111"),
    /** 镇江丹徒区 */
    VALUE_321112("321112"),
    /** 镇江丹阳市 */
    VALUE_321181("321181"),
    /** 镇江扬中市 */
    VALUE_321182("321182"),
    /** 镇江句容市 */
    VALUE_321183("321183"),
    /** 泰州市 */
    VALUE_321200("321200"),
    /** 泰州海陵区 */
    VALUE_321202("321202"),
    /** 泰州高港区 */
    VALUE_321203("321203"),
    /** 泰州姜堰市 */
    VALUE_321204("321204"),
    /** 泰州兴化市 */
    VALUE_321281("321281"),
    /** 泰州靖江市 */
    VALUE_321282("321282"),
    /** 泰州泰兴市 */
    VALUE_321283("321283"),
    /** 宿迁市 */
    VALUE_321300("321300"),
    /** 宿迁宿城区 */
    VALUE_321302("321302"),
    /** 宿迁宿豫区 */
    VALUE_321311("321311"),
    /** 宿迁沭阳县 */
    VALUE_321322("321322"),
    /** 宿迁泗阳县 */
    VALUE_321323("321323"),
    /** 宿迁泗洪县 */
    VALUE_321324("321324"),
    /** 杭州市 */
    VALUE_330100("330100"),
    /** 杭州上城区 */
    VALUE_330102("330102"),
    /** 杭州下城区 */
    VALUE_330103("330103"),
    /** 杭州江干区 */
    VALUE_330104("330104"),
    /** 杭州拱墅区 */
    VALUE_330105("330105"),
    /** 杭州西湖区 */
    VALUE_330106("330106"),
    /** 杭州滨江区 */
    VALUE_330108("330108"),
    /** 杭州萧山区 */
    VALUE_330109("330109"),
    /** 杭州余杭区 */
    VALUE_330110("330110"),
    /** 杭州桐庐县 */
    VALUE_330122("330122"),
    /** 杭州淳安县 */
    VALUE_330127("330127"),
    /** 杭州建德市 */
    VALUE_330182("330182"),
    /** 杭州富阳市 */
    VALUE_330183("330183"),
    /** 杭州临安市 */
    VALUE_330185("330185"),
    /** 宁波市 */
    VALUE_330200("330200"),
    /** 宁波海曙区 */
    VALUE_330203("330203"),
    /** 宁波江东区 */
    VALUE_330204("330204"),
    /** 宁波江北区 */
    VALUE_330205("330205"),
    /** 宁波北仑区 */
    VALUE_330206("330206"),
    /** 宁波镇海区 */
    VALUE_330211("330211"),
    /** 宁波鄞州区 */
    VALUE_330212("330212"),
    /** 宁波象山县 */
    VALUE_330225("330225"),
    /** 宁波宁海县 */
    VALUE_330226("330226"),
    /** 宁波余姚市 */
    VALUE_330281("330281"),
    /** 宁波慈溪市 */
    VALUE_330282("330282"),
    /** 宁波奉化市 */
    VALUE_330283("330283"),
    /** 温州市 */
    VALUE_330300("330300"),
    /** 温州鹿城区 */
    VALUE_330302("330302"),
    /** 温州龙湾区 */
    VALUE_330303("330303"),
    /** 温州瓯海区 */
    VALUE_330304("330304"),
    /** 温州洞头县 */
    VALUE_330322("330322"),
    /** 温州永嘉县 */
    VALUE_330324("330324"),
    /** 温州平阳县 */
    VALUE_330326("330326"),
    /** 温州苍南县 */
    VALUE_330327("330327"),
    /** 温州文成县 */
    VALUE_330328("330328"),
    /** 温州泰顺县 */
    VALUE_330329("330329"),
    /** 温州瑞安市 */
    VALUE_330381("330381"),
    /** 温州乐清市 */
    VALUE_330382("330382"),
    /** 嘉兴市 */
    VALUE_330400("330400"),
    /** 嘉兴南湖区 */
    VALUE_330402("330402"),
    /** 嘉兴秀洲区 */
    VALUE_330411("330411"),
    /** 嘉兴嘉善县 */
    VALUE_330421("330421"),
    /** 嘉兴海盐县 */
    VALUE_330424("330424"),
    /** 嘉兴海宁市 */
    VALUE_330481("330481"),
    /** 嘉兴平湖市 */
    VALUE_330482("330482"),
    /** 嘉兴桐乡市 */
    VALUE_330483("330483"),
    /** 湖州市 */
    VALUE_330500("330500"),
    /** 湖州吴兴区 */
    VALUE_330502("330502"),
    /** 湖州南浔区 */
    VALUE_330503("330503"),
    /** 湖州德清县 */
    VALUE_330521("330521"),
    /** 湖州长兴县 */
    VALUE_330522("330522"),
    /** 湖州安吉县 */
    VALUE_330523("330523"),
    /** 绍兴市 */
    VALUE_330600("330600"),
    /** 绍兴越城区 */
    VALUE_330602("330602"),
    /** 绍兴市柯桥区 */
    VALUE_330603("330603"),
    /** 绍兴市上虞区 */
    VALUE_330604("330604"),
    /** 绍兴新昌县 */
    VALUE_330624("330624"),
    /** 绍兴诸暨市 */
    VALUE_330681("330681"),
    /** 绍兴嵊州市 */
    VALUE_330683("330683"),
    /** 金华市 */
    VALUE_330700("330700"),
    /** 金华婺城区 */
    VALUE_330702("330702"),
    /** 金华金东区 */
    VALUE_330703("330703"),
    /** 金华武义县 */
    VALUE_330723("330723"),
    /** 金华浦江县 */
    VALUE_330726("330726"),
    /** 金华磐安县 */
    VALUE_330727("330727"),
    /** 金华兰溪市 */
    VALUE_330781("330781"),
    /** 金华义乌市 */
    VALUE_330782("330782"),
    /** 金华东阳市 */
    VALUE_330783("330783"),
    /** 金华永康市 */
    VALUE_330784("330784"),
    /** 衢州市 */
    VALUE_330800("330800"),
    /** 衢州市柯城区 */
    VALUE_330802("330802"),
    /** 衢州市衢江区 */
    VALUE_330803("330803"),
    /** 衢州市常山县 */
    VALUE_330822("330822"),
    /** 衢州市开化县 */
    VALUE_330824("330824"),
    /** 衢州市龙游县 */
    VALUE_330825("330825"),
    /** 衢州市江山市 */
    VALUE_330881("330881"),
    /** 舟山市 */
    VALUE_330900("330900"),
    /** 舟山市定海区 */
    VALUE_330902("330902"),
    /** 舟山市普陀区 */
    VALUE_330903("330903"),
    /** 舟山市岱山县 */
    VALUE_330921("330921"),
    /** 舟山市嵊泗县 */
    VALUE_330922("330922"),
    /** 台州市 */
    VALUE_331000("331000"),
    /** 台州市椒江区 */
    VALUE_331002("331002"),
    /** 台州市黄岩区 */
    VALUE_331003("331003"),
    /** 台州市路桥区 */
    VALUE_331004("331004"),
    /** 台州市玉环县 */
    VALUE_331021("331021"),
    /** 台州市三门县 */
    VALUE_331022("331022"),
    /** 台州市天台县 */
    VALUE_331023("331023"),
    /** 台州市仙居县 */
    VALUE_331024("331024"),
    /** 台州市温岭市 */
    VALUE_331081("331081"),
    /** 台州市临海市 */
    VALUE_331082("331082"),
    /** 丽水市 */
    VALUE_331100("331100"),
    /** 丽水市莲都区 */
    VALUE_331102("331102"),
    /** 丽水市青田县 */
    VALUE_331121("331121"),
    /** 丽水市缙云县 */
    VALUE_331122("331122"),
    /** 丽水市遂昌县 */
    VALUE_331123("331123"),
    /** 丽水市松阳县 */
    VALUE_331124("331124"),
    /** 丽水市云和县 */
    VALUE_331125("331125"),
    /** 丽水市庆元县 */
    VALUE_331126("331126"),
    /** 丽水市景宁畲族自治县 */
    VALUE_331127("331127"),
    /** 丽水市龙泉市 */
    VALUE_331181("331181"),
    /** 合肥市 */
    VALUE_340100("340100"),
    /** 合肥市瑶海区 */
    VALUE_340102("340102"),
    /** 合肥市庐阳区 */
    VALUE_340103("340103"),
    /** 合肥市蜀山区 */
    VALUE_340104("340104"),
    /** 合肥市包河区 */
    VALUE_340111("340111"),
    /** 合肥市长丰县 */
    VALUE_340121("340121"),
    /** 合肥市肥东县 */
    VALUE_340122("340122"),
    /** 合肥市肥西县 */
    VALUE_340123("340123"),
    /** 合肥市庐江县 */
    VALUE_340124("340124"),
    /** 合肥市巢湖市 */
    VALUE_340181("340181"),
    /** 芜湖市 */
    VALUE_340200("340200"),
    /** 芜湖市镜湖区 */
    VALUE_340202("340202"),
    /** 芜湖市弋江区 */
    VALUE_340203("340203"),
    /** 芜湖市鸠江区 */
    VALUE_340207("340207"),
    /** 芜湖市三山区 */
    VALUE_340208("340208"),
    /** 芜湖市芜湖县 */
    VALUE_340221("340221"),
    /** 芜湖市繁昌县 */
    VALUE_340222("340222"),
    /** 芜湖市南陵县 */
    VALUE_340223("340223"),
    /** 芜湖无为市 */
    VALUE_340225("340225"),
    /** 蚌埠市 */
    VALUE_340300("340300"),
    /** 蚌埠市龙子湖区 */
    VALUE_340302("340302"),
    /** 蚌埠市蚌山区 */
    VALUE_340303("340303"),
    /** 蚌埠市禹会区 */
    VALUE_340304("340304"),
    /** 蚌埠市淮上区 */
    VALUE_340311("340311"),
    /** 蚌埠市怀远县 */
    VALUE_340321("340321"),
    /** 蚌埠市五河县 */
    VALUE_340322("340322"),
    /** 蚌埠市固镇县 */
    VALUE_340323("340323"),
    /** 淮南市 */
    VALUE_340400("340400"),
    /** 淮南市大通区 */
    VALUE_340402("340402"),
    /** 淮南市田家庵区 */
    VALUE_340403("340403"),
    /** 淮南市谢家集区 */
    VALUE_340404("340404"),
    /** 淮南市八公山区 */
    VALUE_340405("340405"),
    /** 淮南市潘集区 */
    VALUE_340406("340406"),
    /** 淮南市凤台县 */
    VALUE_340421("340421"),
    /** 马鞍山市 */
    VALUE_340500("340500"),
    /** 马鞍山市花山区 */
    VALUE_340503("340503"),
    /** 马鞍山市雨山区 */
    VALUE_340504("340504"),
    /** 马鞍山市博望区 */
    VALUE_340506("340506"),
    /** 马鞍山市当涂县 */
    VALUE_340521("340521"),
    /** 马鞍山市含山县 */
    VALUE_340522("340522"),
    /** 马鞍山市和县 */
    VALUE_340523("340523"),
    /** 淮北市 */
    VALUE_340600("340600"),
    /** 淮北杜集区 */
    VALUE_340602("340602"),
    /** 淮北相山区 */
    VALUE_340603("340603"),
    /** 淮北烈山区 */
    VALUE_340604("340604"),
    /** 淮北濉溪县 */
    VALUE_340621("340621"),
    /** 铜陵市 */
    VALUE_340700("340700"),
    /** 铜陵铜官山区 */
    VALUE_340702("340702"),
    /** 铜陵狮子山区 */
    VALUE_340703("340703"),
    /** 铜陵郊区 */
    VALUE_340711("340711"),
    /** 铜陵县 */
    VALUE_340721("340721"),
    /** 安庆市 */
    VALUE_340800("340800"),
    /** 安庆迎江区 */
    VALUE_340802("340802"),
    /** 安庆大观区 */
    VALUE_340803("340803"),
    /** 安庆宜秀区 */
    VALUE_340811("340811"),
    /** 安庆怀宁县 */
    VALUE_340822("340822"),
    /** 安庆枞阳县 */
    VALUE_340823("340823"),
    /** 安庆潜山县 */
    VALUE_340824("340824"),
    /** 安庆太湖县 */
    VALUE_340825("340825"),
    /** 安庆宿松县 */
    VALUE_340826("340826"),
    /** 安庆望江县 */
    VALUE_340827("340827"),
    /** 安庆岳西县 */
    VALUE_340828("340828"),
    /** 安庆桐城市 */
    VALUE_340881("340881"),
    /** 黄山市 */
    VALUE_341000("341000"),
    /** 黄山屯溪区 */
    VALUE_341002("341002"),
    /** 黄山区 */
    VALUE_341003("341003"),
    /** 黄山徽州区 */
    VALUE_341004("341004"),
    /** 黄山歙县 */
    VALUE_341021("341021"),
    /** 黄山休宁县 */
    VALUE_341022("341022"),
    /** 黄山黟县 */
    VALUE_341023("341023"),
    /** 黄山祁门县 */
    VALUE_341024("341024"),
    /** 滁州市 */
    VALUE_341100("341100"),
    /** 滁州琅琊区 */
    VALUE_341102("341102"),
    /** 滁州南谯区 */
    VALUE_341103("341103"),
    /** 滁州来安县 */
    VALUE_341122("341122"),
    /** 滁州全椒县 */
    VALUE_341124("341124"),
    /** 滁州定远县 */
    VALUE_341125("341125"),
    /** 滁州凤阳县 */
    VALUE_341126("341126"),
    /** 滁州天长市 */
    VALUE_341181("341181"),
    /** 滁州明光市 */
    VALUE_341182("341182"),
    /** 阜阳市 */
    VALUE_341200("341200"),
    /** 阜阳颍州区 */
    VALUE_341202("341202"),
    /** 阜阳颍东区 */
    VALUE_341203("341203"),
    /** 阜阳颍泉区 */
    VALUE_341204("341204"),
    /** 阜阳临泉县 */
    VALUE_341221("341221"),
    /** 阜阳太和县 */
    VALUE_341222("341222"),
    /** 阜阳阜南县 */
    VALUE_341225("341225"),
    /** 阜阳颍上县 */
    VALUE_341226("341226"),
    /** 阜阳界首市 */
    VALUE_341282("341282"),
    /** 宿州市 */
    VALUE_341300("341300"),
    /** 宿州墉桥区 */
    VALUE_341302("341302"),
    /** 宿州砀山县 */
    VALUE_341321("341321"),
    /** 宿州萧县 */
    VALUE_341322("341322"),
    /** 宿州灵璧县 */
    VALUE_341323("341323"),
    /** 宿州泗县 */
    VALUE_341324("341324"),
    /** 六安市 */
    VALUE_341500("341500"),
    /** 六安金安区 */
    VALUE_341502("341502"),
    /** 六安裕安区 */
    VALUE_341503("341503"),
    /** 六安寿县 */
    VALUE_341521("341521"),
    /** 六安霍邱县 */
    VALUE_341522("341522"),
    /** 六安舒城县 */
    VALUE_341523("341523"),
    /** 六安金寨县 */
    VALUE_341524("341524"),
    /** 六安霍山县 */
    VALUE_341525("341525"),
    /** 亳州市 */
    VALUE_341600("341600"),
    /** 亳州谯城区 */
    VALUE_341602("341602"),
    /** 亳州涡阳县 */
    VALUE_341621("341621"),
    /** 亳州蒙城县 */
    VALUE_341622("341622"),
    /** 亳州利辛县 */
    VALUE_341623("341623"),
    /** 池州市 */
    VALUE_341700("341700"),
    /** 池州贵池区 */
    VALUE_341702("341702"),
    /** 池州东至县 */
    VALUE_341721("341721"),
    /** 池州石台县 */
    VALUE_341722("341722"),
    /** 池州青阳县 */
    VALUE_341723("341723"),
    /** 宣城市 */
    VALUE_341800("341800"),
    /** 宣城宣州区 */
    VALUE_341802("341802"),
    /** 宣城郎溪县 */
    VALUE_341821("341821"),
    /** 宣城广德县 */
    VALUE_341822("341822"),
    /** 宣城泾县 */
    VALUE_341823("341823"),
    /** 宣城绩溪县 */
    VALUE_341824("341824"),
    /** 宣城旌德县 */
    VALUE_341825("341825"),
    /** 宣城宁国市 */
    VALUE_341881("341881"),
    /** 福州市 */
    VALUE_350100("350100"),
    /** 福州鼓楼区 */
    VALUE_350102("350102"),
    /** 福州台江区 */
    VALUE_350103("350103"),
    /** 福州仓山区 */
    VALUE_350104("350104"),
    /** 福州马尾区 */
    VALUE_350105("350105"),
    /** 福州晋安区 */
    VALUE_350111("350111"),
    /** 福州闽侯县 */
    VALUE_350121("350121"),
    /** 福州连江县 */
    VALUE_350122("350122"),
    /** 福州罗源县 */
    VALUE_350123("350123"),
    /** 福州闽清县 */
    VALUE_350124("350124"),
    /** 福州永泰县 */
    VALUE_350125("350125"),
    /** 福州平潭县 */
    VALUE_350128("350128"),
    /** 福州福清市 */
    VALUE_350181("350181"),
    /** 福州长乐市 */
    VALUE_350182("350182"),
    /** 厦门市 */
    VALUE_350200("350200"),
    /** 厦门思明区 */
    VALUE_350203("350203"),
    /** 厦门海沧区 */
    VALUE_350205("350205"),
    /** 厦门湖里区 */
    VALUE_350206("350206"),
    /** 厦门集美区 */
    VALUE_350211("350211"),
    /** 厦门同安区 */
    VALUE_350212("350212"),
    /** 厦门翔安区 */
    VALUE_350213("350213"),
    /** 莆田市 */
    VALUE_350300("350300"),
    /** 莆田城厢区 */
    VALUE_350302("350302"),
    /** 莆田涵江区 */
    VALUE_350303("350303"),
    /** 莆田荔城区 */
    VALUE_350304("350304"),
    /** 莆田秀屿区 */
    VALUE_350305("350305"),
    /** 莆田仙游县 */
    VALUE_350322("350322"),
    /** 三明市 */
    VALUE_350400("350400"),
    /** 三明梅列区 */
    VALUE_350402("350402"),
    /** 三明三元区 */
    VALUE_350403("350403"),
    /** 三明明溪县 */
    VALUE_350421("350421"),
    /** 三明清流县 */
    VALUE_350423("350423"),
    /** 三明宁化县 */
    VALUE_350424("350424"),
    /** 三明大田县 */
    VALUE_350425("350425"),
    /** 三明尤溪县 */
    VALUE_350426("350426"),
    /** 三明沙县 */
    VALUE_350427("350427"),
    /** 三明将乐县 */
    VALUE_350428("350428"),
    /** 三明泰宁县 */
    VALUE_350429("350429"),
    /** 三明建宁县 */
    VALUE_350430("350430"),
    /** 三明永安市 */
    VALUE_350481("350481"),
    /** 泉州市 */
    VALUE_350500("350500"),
    /** 泉州鲤城区 */
    VALUE_350502("350502"),
    /** 泉州丰泽区 */
    VALUE_350503("350503"),
    /** 泉州洛江区 */
    VALUE_350504("350504"),
    /** 泉州泉港区 */
    VALUE_350505("350505"),
    /** 泉州惠安县 */
    VALUE_350521("350521"),
    /** 泉州安溪县 */
    VALUE_350524("350524"),
    /** 泉州永春县 */
    VALUE_350525("350525"),
    /** 泉州德化县 */
    VALUE_350526("350526"),
    /** 泉州金门县 */
    VALUE_350527("350527"),
    /** 泉州石狮市 */
    VALUE_350581("350581"),
    /** 泉州晋江市 */
    VALUE_350582("350582"),
    /** 泉州南安市 */
    VALUE_350583("350583"),
    /** 漳州市 */
    VALUE_350600("350600"),
    /** 漳州芗城区 */
    VALUE_350602("350602"),
    /** 漳州龙文区 */
    VALUE_350603("350603"),
    /** 漳州云霄县 */
    VALUE_350622("350622"),
    /** 漳州漳浦县 */
    VALUE_350623("350623"),
    /** 漳州诏安县 */
    VALUE_350624("350624"),
    /** 漳州长泰县 */
    VALUE_350625("350625"),
    /** 漳州东山县 */
    VALUE_350626("350626"),
    /** 漳州南靖县 */
    VALUE_350627("350627"),
    /** 漳州平和县 */
    VALUE_350628("350628"),
    /** 漳州华安县 */
    VALUE_350629("350629"),
    /** 漳州龙海市 */
    VALUE_350681("350681"),
    /** 南平市 */
    VALUE_350700("350700"),
    /** 南平延平区 */
    VALUE_350702("350702"),
    /** 南平顺昌县 */
    VALUE_350721("350721"),
    /** 南平浦城县 */
    VALUE_350722("350722"),
    /** 南平光泽县 */
    VALUE_350723("350723"),
    /** 南平松溪县 */
    VALUE_350724("350724"),
    /** 南平政和县 */
    VALUE_350725("350725"),
    /** 南平邵武市 */
    VALUE_350781("350781"),
    /** 南平武夷山市 */
    VALUE_350782("350782"),
    /** 南平建瓯市 */
    VALUE_350783("350783"),
    /** 南平建阳市 */
    VALUE_350784("350784"),
    /** 龙岩市 */
    VALUE_350800("350800"),
    /** 龙岩新罗区 */
    VALUE_350802("350802"),
    /** 龙岩长汀县 */
    VALUE_350821("350821"),
    /** 龙岩永定县 */
    VALUE_350822("350822"),
    /** 龙岩上杭县 */
    VALUE_350823("350823"),
    /** 龙岩武平县 */
    VALUE_350824("350824"),
    /** 龙岩连城县 */
    VALUE_350825("350825"),
    /** 龙岩漳平市 */
    VALUE_350881("350881"),
    /** 宁德市 */
    VALUE_350900("350900"),
    /** 宁德蕉城区 */
    VALUE_350902("350902"),
    /** 宁德霞浦县 */
    VALUE_350921("350921"),
    /** 宁德古田县 */
    VALUE_350922("350922"),
    /** 宁德屏南县 */
    VALUE_350923("350923"),
    /** 宁德寿宁县 */
    VALUE_350924("350924"),
    /** 宁德周宁县 */
    VALUE_350925("350925"),
    /** 宁德柘荣县 */
    VALUE_350926("350926"),
    /** 宁德福安市 */
    VALUE_350981("350981"),
    /** 宁德福鼎市 */
    VALUE_350982("350982"),
    /** 南昌市 */
    VALUE_360100("360100"),
    /** 南昌东湖区 */
    VALUE_360102("360102"),
    /** 南昌西湖区 */
    VALUE_360103("360103"),
    /** 南昌青云谱区 */
    VALUE_360104("360104"),
    /** 南昌湾里区 */
    VALUE_360105("360105"),
    /** 南昌青山湖区 */
    VALUE_360111("360111"),
    /** 南昌县 */
    VALUE_360121("360121"),
    /** 南昌新建县 */
    VALUE_360122("360122"),
    /** 南昌安义县 */
    VALUE_360123("360123"),
    /** 南昌进贤县 */
    VALUE_360124("360124"),
    /** 景德镇市 */
    VALUE_360200("360200"),
    /** 景德镇昌江区 */
    VALUE_360202("360202"),
    /** 景德镇珠山区 */
    VALUE_360203("360203"),
    /** 景德镇浮梁县 */
    VALUE_360222("360222"),
    /** 景德镇乐平市 */
    VALUE_360281("360281"),
    /** 萍乡市 */
    VALUE_360300("360300"),
    /** 萍乡安源区 */
    VALUE_360302("360302"),
    /** 萍乡湘东区 */
    VALUE_360313("360313"),
    /** 萍乡莲花县 */
    VALUE_360321("360321"),
    /** 萍乡上栗县 */
    VALUE_360322("360322"),
    /** 萍乡芦溪县 */
    VALUE_360323("360323"),
    /** 九江市 */
    VALUE_360400("360400"),
    /** 九江庐山区 */
    VALUE_360402("360402"),
    /** 九江浔阳区 */
    VALUE_360403("360403"),
    /** 九江县 */
    VALUE_360421("360421"),
    /** 九江武宁县 */
    VALUE_360423("360423"),
    /** 九江修水县 */
    VALUE_360424("360424"),
    /** 九江永修县 */
    VALUE_360425("360425"),
    /** 九江德安县 */
    VALUE_360426("360426"),
    /** 九江星子县 */
    VALUE_360427("360427"),
    /** 九江都昌县 */
    VALUE_360428("360428"),
    /** 九江湖口县 */
    VALUE_360429("360429"),
    /** 九江彭泽县 */
    VALUE_360430("360430"),
    /** 九江瑞昌市 */
    VALUE_360481("360481"),
    /** 江西省共青城市 */
    VALUE_360482("360482"),
    /** 新余市 */
    VALUE_360500("360500"),
    /** 新余渝水区 */
    VALUE_360502("360502"),
    /** 新余分宜县 */
    VALUE_360521("360521"),
    /** 鹰潭市 */
    VALUE_360600("360600"),
    /** 鹰潭月湖区 */
    VALUE_360602("360602"),
    /** 鹰潭余江县 */
    VALUE_360622("360622"),
    /** 鹰潭贵溪市 */
    VALUE_360681("360681"),
    /** 赣州市 */
    VALUE_360700("360700"),
    /** 赣州章贡区 */
    VALUE_360702("360702"),
    /** 赣州市南康区 */
    VALUE_360703("360703"),
    /** 赣州赣县 */
    VALUE_360721("360721"),
    /** 赣州信丰县 */
    VALUE_360722("360722"),
    /** 赣州大余县 */
    VALUE_360723("360723"),
    /** 赣州上犹县 */
    VALUE_360724("360724"),
    /** 赣州崇义县 */
    VALUE_360725("360725"),
    /** 赣州安远县 */
    VALUE_360726("360726"),
    /** 赣州龙南县 */
    VALUE_360727("360727"),
    /** 赣州定南县 */
    VALUE_360728("360728"),
    /** 赣州全南县 */
    VALUE_360729("360729"),
    /** 赣州宁都县 */
    VALUE_360730("360730"),
    /** 赣州于都县 */
    VALUE_360731("360731"),
    /** 赣州兴国县 */
    VALUE_360732("360732"),
    /** 赣州会昌县 */
    VALUE_360733("360733"),
    /** 赣州寻乌县 */
    VALUE_360734("360734"),
    /** 赣州石城县 */
    VALUE_360735("360735"),
    /** 赣州瑞金市 */
    VALUE_360781("360781"),
    /** 吉安市 */
    VALUE_360800("360800"),
    /** 吉安吉州区 */
    VALUE_360802("360802"),
    /** 吉安青原区 */
    VALUE_360803("360803"),
    /** 吉安县 */
    VALUE_360821("360821"),
    /** 吉安吉水县 */
    VALUE_360822("360822"),
    /** 吉安峡江县 */
    VALUE_360823("360823"),
    /** 吉安新干县 */
    VALUE_360824("360824"),
    /** 吉安永丰县 */
    VALUE_360825("360825"),
    /** 吉安泰和县 */
    VALUE_360826("360826"),
    /** 吉安遂川县 */
    VALUE_360827("360827"),
    /** 吉安万安县 */
    VALUE_360828("360828"),
    /** 吉安安福县 */
    VALUE_360829("360829"),
    /** 吉安永新县 */
    VALUE_360830("360830"),
    /** 吉安井冈山市 */
    VALUE_360881("360881"),
    /** 宜春市 */
    VALUE_360900("360900"),
    /** 宜春袁州区 */
    VALUE_360902("360902"),
    /** 宜春奉新县 */
    VALUE_360921("360921"),
    /** 宜春万载县 */
    VALUE_360922("360922"),
    /** 宜春上高县 */
    VALUE_360923("360923"),
    /** 宜春宜丰县 */
    VALUE_360924("360924"),
    /** 宜春靖安县 */
    VALUE_360925("360925"),
    /** 宜春铜鼓县 */
    VALUE_360926("360926"),
    /** 宜春丰城市 */
    VALUE_360981("360981"),
    /** 宜春樟树市 */
    VALUE_360982("360982"),
    /** 宜春高安市 */
    VALUE_360983("360983"),
    /** 抚州市 */
    VALUE_361000("361000"),
    /** 抚州临川区 */
    VALUE_361002("361002"),
    /** 抚州南城县 */
    VALUE_361021("361021"),
    /** 抚州黎川县 */
    VALUE_361022("361022"),
    /** 抚州南丰县 */
    VALUE_361023("361023"),
    /** 抚州崇仁县 */
    VALUE_361024("361024"),
    /** 抚州乐安县 */
    VALUE_361025("361025"),
    /** 抚州宜黄县 */
    VALUE_361026("361026"),
    /** 抚州金溪县 */
    VALUE_361027("361027"),
    /** 抚州资溪县 */
    VALUE_361028("361028"),
    /** 抚州东乡县 */
    VALUE_361029("361029"),
    /** 抚州广昌县 */
    VALUE_361030("361030"),
    /** 上饶市 */
    VALUE_361100("361100"),
    /** 上饶信州区 */
    VALUE_361102("361102"),
    /** 上饶县 */
    VALUE_361121("361121"),
    /** 上饶广丰县 */
    VALUE_361122("361122"),
    /** 上饶玉山县 */
    VALUE_361123("361123"),
    /** 上饶铅山县 */
    VALUE_361124("361124"),
    /** 上饶横峰县 */
    VALUE_361125("361125"),
    /** 上饶弋阳县 */
    VALUE_361126("361126"),
    /** 上饶余干县 */
    VALUE_361127("361127"),
    /** 上饶鄱阳县 */
    VALUE_361128("361128"),
    /** 上饶万年县 */
    VALUE_361129("361129"),
    /** 上饶婺源县 */
    VALUE_361130("361130"),
    /** 上饶德兴市 */
    VALUE_361181("361181"),
    /** 济南市 */
    VALUE_370100("370100"),
    /** 济南历下区 */
    VALUE_370102("370102"),
    /** 济南市中区 */
    VALUE_370103("370103"),
    /** 济南槐荫区 */
    VALUE_370104("370104"),
    /** 济南天桥区 */
    VALUE_370105("370105"),
    /** 济南历城区 */
    VALUE_370112("370112"),
    /** 济南长清区 */
    VALUE_370113("370113"),
    /** 济南平阴县 */
    VALUE_370124("370124"),
    /** 济南济阳县 */
    VALUE_370125("370125"),
    /** 济南商河县 */
    VALUE_370126("370126"),
    /** 济南章丘市 */
    VALUE_370181("370181"),
    /** 青岛市 */
    VALUE_370200("370200"),
    /** 青岛市南区 */
    VALUE_370202("370202"),
    /** 青岛市北区 */
    VALUE_370203("370203"),
    /** 青岛黄岛区 */
    VALUE_370211("370211"),
    /** 青岛崂山区 */
    VALUE_370212("370212"),
    /** 青岛李沧区 */
    VALUE_370213("370213"),
    /** 青岛城阳区 */
    VALUE_370214("370214"),
    /** 青岛胶州市 */
    VALUE_370281("370281"),
    /** 青岛即墨市 */
    VALUE_370282("370282"),
    /** 青岛平度市 */
    VALUE_370283("370283"),
    /** 青岛莱西市 */
    VALUE_370285("370285"),
    /** 淄博市 */
    VALUE_370300("370300"),
    /** 淄博淄川区 */
    VALUE_370302("370302"),
    /** 淄博张店区 */
    VALUE_370303("370303"),
    /** 淄博博山区 */
    VALUE_370304("370304"),
    /** 淄博临淄区 */
    VALUE_370305("370305"),
    /** 淄博周村区 */
    VALUE_370306("370306"),
    /** 淄博桓台县 */
    VALUE_370321("370321"),
    /** 淄博高青县 */
    VALUE_370322("370322"),
    /** 淄博沂源县 */
    VALUE_370323("370323"),
    /** 枣庄市 */
    VALUE_370400("370400"),
    /** 枣庄市中区 */
    VALUE_370402("370402"),
    /** 枣庄薛城区 */
    VALUE_370403("370403"),
    /** 枣庄峄城区 */
    VALUE_370404("370404"),
    /** 枣庄台儿庄区 */
    VALUE_370405("370405"),
    /** 枣庄山亭区 */
    VALUE_370406("370406"),
    /** 枣庄滕州市 */
    VALUE_370481("370481"),
    /** 东营市 */
    VALUE_370500("370500"),
    /** 东营区 */
    VALUE_370502("370502"),
    /** 东营河口区 */
    VALUE_370503("370503"),
    /** 东营垦利县 */
    VALUE_370521("370521"),
    /** 东营利津县 */
    VALUE_370522("370522"),
    /** 东营广饶县 */
    VALUE_370523("370523"),
    /** 烟台市 */
    VALUE_370600("370600"),
    /** 烟台芝罘区 */
    VALUE_370602("370602"),
    /** 烟台福山区 */
    VALUE_370611("370611"),
    /** 烟台牟平区 */
    VALUE_370612("370612"),
    /** 烟台莱山区 */
    VALUE_370613("370613"),
    /** 烟台长岛县 */
    VALUE_370634("370634"),
    /** 烟台龙口市 */
    VALUE_370681("370681"),
    /** 烟台莱阳市 */
    VALUE_370682("370682"),
    /** 烟台莱州市 */
    VALUE_370683("370683"),
    /** 烟台蓬莱市 */
    VALUE_370684("370684"),
    /** 烟台招远市 */
    VALUE_370685("370685"),
    /** 烟台栖霞市 */
    VALUE_370686("370686"),
    /** 烟台海阳市 */
    VALUE_370687("370687"),
    /** 潍坊市 */
    VALUE_370700("370700"),
    /** 潍坊潍城区 */
    VALUE_370702("370702"),
    /** 潍坊寒亭区 */
    VALUE_370703("370703"),
    /** 潍坊坊子区 */
    VALUE_370704("370704"),
    /** 潍坊奎文区 */
    VALUE_370705("370705"),
    /** 潍坊临朐县 */
    VALUE_370724("370724"),
    /** 潍坊昌乐县 */
    VALUE_370725("370725"),
    /** 潍坊青州市 */
    VALUE_370781("370781"),
    /** 潍坊诸城市 */
    VALUE_370782("370782"),
    /** 潍坊寿光市 */
    VALUE_370783("370783"),
    /** 潍坊安丘市 */
    VALUE_370784("370784"),
    /** 潍坊高密市 */
    VALUE_370785("370785"),
    /** 潍坊昌邑市 */
    VALUE_370786("370786"),
    /** 济宁市 */
    VALUE_370800("370800"),
    /** 济宁任城区 */
    VALUE_370811("370811"),
    /** 济宁市兖州区 */
    VALUE_370812("370812"),
    /** 济宁微山县 */
    VALUE_370826("370826"),
    /** 济宁鱼台县 */
    VALUE_370827("370827"),
    /** 济宁金乡县 */
    VALUE_370828("370828"),
    /** 济宁嘉祥县 */
    VALUE_370829("370829"),
    /** 济宁汶上县 */
    VALUE_370830("370830"),
    /** 济宁泗水县 */
    VALUE_370831("370831"),
    /** 济宁梁山县 */
    VALUE_370832("370832"),
    /** 济宁曲阜市 */
    VALUE_370881("370881"),
    /** 济宁邹城市 */
    VALUE_370883("370883"),
    /** 泰安市 */
    VALUE_370900("370900"),
    /** 泰安泰山区 */
    VALUE_370902("370902"),
    /** 泰安市岱岳区 */
    VALUE_370911("370911"),
    /** 泰安宁阳县 */
    VALUE_370921("370921"),
    /** 泰安东平县 */
    VALUE_370923("370923"),
    /** 泰安新泰市 */
    VALUE_370982("370982"),
    /** 泰安肥城市 */
    VALUE_370983("370983"),
    /** 威海市 */
    VALUE_371000("371000"),
    /** 威海环翠区 */
    VALUE_371002("371002"),
    /** 威海市文登区 */
    VALUE_371003("371003"),
    /** 威海荣成市 */
    VALUE_371082("371082"),
    /** 威海乳山市 */
    VALUE_371083("371083"),
    /** 日照市 */
    VALUE_371100("371100"),
    /** 日照东港区 */
    VALUE_371102("371102"),
    /** 日照岚山区 */
    VALUE_371103("371103"),
    /** 日照五莲县 */
    VALUE_371121("371121"),
    /** 日照莒县 */
    VALUE_371122("371122"),
    /** 莱芜市 */
    VALUE_371200("371200"),
    /** 莱芜莱城区 */
    VALUE_371202("371202"),
    /** 莱芜钢城区 */
    VALUE_371203("371203"),
    /** 临沂市 */
    VALUE_371300("371300"),
    /** 临沂兰山区 */
    VALUE_371302("371302"),
    /** 临沂罗庄区 */
    VALUE_371311("371311"),
    /** 临沂河东区 */
    VALUE_371312("371312"),
    /** 临沂沂南县 */
    VALUE_371321("371321"),
    /** 临沂郯城县 */
    VALUE_371322("371322"),
    /** 临沂沂水县 */
    VALUE_371323("371323"),
    /** 临沂苍山县 */
    VALUE_371324("371324"),
    /** 临沂费县 */
    VALUE_371325("371325"),
    /** 临沂平邑县 */
    VALUE_371326("371326"),
    /** 临沂莒南县 */
    VALUE_371327("371327"),
    /** 临沂蒙阴县 */
    VALUE_371328("371328"),
    /** 临沂临沭县 */
    VALUE_371329("371329"),
    /** 德州市 */
    VALUE_371400("371400"),
    /** 德州德城区 */
    VALUE_371402("371402"),
    /** 德州市陵城区 */
    VALUE_371403("371403"),
    /** 德州宁津县 */
    VALUE_371422("371422"),
    /** 德州庆云县 */
    VALUE_371423("371423"),
    /** 德州临邑县 */
    VALUE_371424("371424"),
    /** 德州齐河县 */
    VALUE_371425("371425"),
    /** 德州平原县 */
    VALUE_371426("371426"),
    /** 德州夏津县 */
    VALUE_371427("371427"),
    /** 德州武城县 */
    VALUE_371428("371428"),
    /** 德州乐陵市 */
    VALUE_371481("371481"),
    /** 德州禹城市 */
    VALUE_371482("371482"),
    /** 聊城市 */
    VALUE_371500("371500"),
    /** 聊城东昌府区 */
    VALUE_371502("371502"),
    /** 聊城阳谷县 */
    VALUE_371521("371521"),
    /** 聊城莘县 */
    VALUE_371522("371522"),
    /** 聊城茌平县 */
    VALUE_371523("371523"),
    /** 聊城东阿县 */
    VALUE_371524("371524"),
    /** 聊城冠县 */
    VALUE_371525("371525"),
    /** 聊城高唐县 */
    VALUE_371526("371526"),
    /** 聊城临清市 */
    VALUE_371581("371581"),
    /** 滨州市 */
    VALUE_371600("371600"),
    /** 滨州滨城区 */
    VALUE_371602("371602"),
    /** 滨州市沾化区 */
    VALUE_371603("371603"),
    /** 滨州惠民县 */
    VALUE_371621("371621"),
    /** 滨州阳信县 */
    VALUE_371622("371622"),
    /** 滨州无棣县 */
    VALUE_371623("371623"),
    /** 滨州博兴县 */
    VALUE_371625("371625"),
    /** 滨州邹平县 */
    VALUE_371626("371626"),
    /** 荷泽市 */
    VALUE_371700("371700"),
    /** 荷泽牡丹区 */
    VALUE_371702("371702"),
    /** 荷泽曹县 */
    VALUE_371721("371721"),
    /** 荷泽单县 */
    VALUE_371722("371722"),
    /** 荷泽成武县 */
    VALUE_371723("371723"),
    /** 荷泽巨野县 */
    VALUE_371724("371724"),
    /** 荷泽郓城县 */
    VALUE_371725("371725"),
    /** 荷泽鄄城县 */
    VALUE_371726("371726"),
    /** 荷泽定陶县 */
    VALUE_371727("371727"),
    /** 荷泽东明县 */
    VALUE_371728("371728"),
    /** 郑州市 */
    VALUE_410100("410100"),
    /** 郑州中原区 */
    VALUE_410102("410102"),
    /** 郑州二七区 */
    VALUE_410103("410103"),
    /** 郑州管城回族区 */
    VALUE_410104("410104"),
    /** 郑州金水区 */
    VALUE_410105("410105"),
    /** 郑州上街区 */
    VALUE_410106("410106"),
    /** 郑州惠济区 */
    VALUE_410108("410108"),
    /** 郑州中牟县 */
    VALUE_410122("410122"),
    /** 郑州巩义市 */
    VALUE_410181("410181"),
    /** 郑州荥阳市 */
    VALUE_410182("410182"),
    /** 郑州新密市 */
    VALUE_410183("410183"),
    /** 郑州新郑市 */
    VALUE_410184("410184"),
    /** 郑州登封市 */
    VALUE_410185("410185"),
    /** 开封市 */
    VALUE_410200("410200"),
    /** 开封龙亭区 */
    VALUE_410202("410202"),
    /** 开封顺河回族区 */
    VALUE_410203("410203"),
    /** 开封鼓楼区 */
    VALUE_410204("410204"),
    /** 开封禹王台区 */
    VALUE_410205("410205"),
    /** 开封金明区 */
    VALUE_410211("410211"),
    /** 开封杞县 */
    VALUE_410221("410221"),
    /** 开封通许县 */
    VALUE_410222("410222"),
    /** 开封尉氏县 */
    VALUE_410223("410223"),
    /** 开封县 */
    VALUE_410224("410224"),
    /** 开封兰考县 */
    VALUE_410225("410225"),
    /** 洛阳市 */
    VALUE_410300("410300"),
    /** 洛阳老城区 */
    VALUE_410302("410302"),
    /** 洛阳西工区 */
    VALUE_410303("410303"),
    /** 洛阳廛河回族区 */
    VALUE_410304("410304"),
    /** 洛阳涧西区 */
    VALUE_410305("410305"),
    /** 洛阳吉利区 */
    VALUE_410306("410306"),
    /** 洛阳市洛龙区 */
    VALUE_410311("410311"),
    /** 洛阳孟津县 */
    VALUE_410322("410322"),
    /** 洛阳新安县 */
    VALUE_410323("410323"),
    /** 洛阳栾川县 */
    VALUE_410324("410324"),
    /** 洛阳嵩县 */
    VALUE_410325("410325"),
    /** 洛阳汝阳县 */
    VALUE_410326("410326"),
    /** 洛阳宜阳县 */
    VALUE_410327("410327"),
    /** 洛阳洛宁县 */
    VALUE_410328("410328"),
    /** 洛阳伊川县 */
    VALUE_410329("410329"),
    /** 洛阳偃师市 */
    VALUE_410381("410381"),
    /** 平顶山市 */
    VALUE_410400("410400"),
    /** 平顶山新华区 */
    VALUE_410402("410402"),
    /** 平顶山卫东区 */
    VALUE_410403("410403"),
    /** 平顶山石龙区 */
    VALUE_410404("410404"),
    /** 平顶山湛河区 */
    VALUE_410411("410411"),
    /** 平顶山宝丰县 */
    VALUE_410421("410421"),
    /** 平顶山叶县 */
    VALUE_410422("410422"),
    /** 平顶山鲁山县 */
    VALUE_410423("410423"),
    /** 平顶山郏县 */
    VALUE_410425("410425"),
    /** 平顶山舞钢市 */
    VALUE_410481("410481"),
    /** 平顶山汝州市 */
    VALUE_410482("410482"),
    /** 安阳市 */
    VALUE_410500("410500"),
    /** 安阳文峰区 */
    VALUE_410502("410502"),
    /** 安阳北关区 */
    VALUE_410503("410503"),
    /** 安阳殷都区 */
    VALUE_410505("410505"),
    /** 安阳龙安区 */
    VALUE_410506("410506"),
    /** 安阳县 */
    VALUE_410522("410522"),
    /** 安阳汤阴县 */
    VALUE_410523("410523"),
    /** 安阳滑县 */
    VALUE_410526("410526"),
    /** 安阳内黄县 */
    VALUE_410527("410527"),
    /** 安阳林州市 */
    VALUE_410581("410581"),
    /** 鹤壁市 */
    VALUE_410600("410600"),
    /** 鹤壁鹤山区 */
    VALUE_410602("410602"),
    /** 鹤壁山城区 */
    VALUE_410603("410603"),
    /** 鹤壁淇滨区 */
    VALUE_410611("410611"),
    /** 鹤壁浚县 */
    VALUE_410621("410621"),
    /** 鹤壁淇县 */
    VALUE_410622("410622"),
    /** 新乡市 */
    VALUE_410700("410700"),
    /** 新乡红旗区 */
    VALUE_410702("410702"),
    /** 新乡卫滨区 */
    VALUE_410703("410703"),
    /** 新乡凤泉区 */
    VALUE_410704("410704"),
    /** 新乡牧野区 */
    VALUE_410711("410711"),
    /** 新乡县 */
    VALUE_410721("410721"),
    /** 新乡获嘉县 */
    VALUE_410724("410724"),
    /** 新乡原阳县 */
    VALUE_410725("410725"),
    /** 新乡延津县 */
    VALUE_410726("410726"),
    /** 新乡封丘县 */
    VALUE_410727("410727"),
    /** 新乡长垣县 */
    VALUE_410728("410728"),
    /** 新乡卫辉市 */
    VALUE_410781("410781"),
    /** 新乡辉县市 */
    VALUE_410782("410782"),
    /** 焦作市 */
    VALUE_410800("410800"),
    /** 焦作解放区 */
    VALUE_410802("410802"),
    /** 焦作中站区 */
    VALUE_410803("410803"),
    /** 焦作马村区 */
    VALUE_410804("410804"),
    /** 焦作山阳区 */
    VALUE_410811("410811"),
    /** 焦作修武县 */
    VALUE_410821("410821"),
    /** 焦作博爱县 */
    VALUE_410822("410822"),
    /** 焦作武陟县 */
    VALUE_410823("410823"),
    /** 焦作温县 */
    VALUE_410825("410825"),
    /** 焦作沁阳市 */
    VALUE_410882("410882"),
    /** 焦作孟州市 */
    VALUE_410883("410883"),
    /** 濮阳市 */
    VALUE_410900("410900"),
    /** 濮阳华龙区 */
    VALUE_410902("410902"),
    /** 濮阳清丰县 */
    VALUE_410922("410922"),
    /** 濮阳南乐县 */
    VALUE_410923("410923"),
    /** 濮阳范县 */
    VALUE_410926("410926"),
    /** 濮阳台前县 */
    VALUE_410927("410927"),
    /** 濮阳县 */
    VALUE_410928("410928"),
    /** 许昌市 */
    VALUE_411000("411000"),
    /** 许昌魏都区 */
    VALUE_411002("411002"),
    /** 许昌县 */
    VALUE_411023("411023"),
    /** 许昌鄢陵县 */
    VALUE_411024("411024"),
    /** 许昌襄城县 */
    VALUE_411025("411025"),
    /** 许昌禹州市 */
    VALUE_411081("411081"),
    /** 许昌长葛市 */
    VALUE_411082("411082"),
    /** 漯河市 */
    VALUE_411100("411100"),
    /** 漯河源汇区 */
    VALUE_411102("411102"),
    /** 漯河郾城区 */
    VALUE_411103("411103"),
    /** 漯河召陵区 */
    VALUE_411104("411104"),
    /** 漯河舞阳县 */
    VALUE_411121("411121"),
    /** 漯河临颍县 */
    VALUE_411122("411122"),
    /** 三门峡市 */
    VALUE_411200("411200"),
    /** 三门峡湖滨区 */
    VALUE_411202("411202"),
    /** 三门峡渑池县 */
    VALUE_411221("411221"),
    /** 许昌县 */
    VALUE_411222("411222"),
    /** 三门峡卢氏县 */
    VALUE_411224("411224"),
    /** 三门峡义马市 */
    VALUE_411281("411281"),
    /** 三门峡灵宝市 */
    VALUE_411282("411282"),
    /** 南阳市 */
    VALUE_411300("411300"),
    /** 南阳宛城区 */
    VALUE_411302("411302"),
    /** 南阳卧龙区 */
    VALUE_411303("411303"),
    /** 南阳南召县 */
    VALUE_411321("411321"),
    /** 南阳方城县 */
    VALUE_411322("411322"),
    /** 南阳西峡县 */
    VALUE_411323("411323"),
    /** 南阳镇平县 */
    VALUE_411324("411324"),
    /** 南阳内乡县 */
    VALUE_411325("411325"),
    /** 南阳淅川县 */
    VALUE_411326("411326"),
    /** 南阳社旗县 */
    VALUE_411327("411327"),
    /** 南阳唐河县 */
    VALUE_411328("411328"),
    /** 南阳新野县 */
    VALUE_411329("411329"),
    /** 南阳桐柏县 */
    VALUE_411330("411330"),
    /** 南阳邓州市 */
    VALUE_411381("411381"),
    /** 商丘市 */
    VALUE_411400("411400"),
    /** 商丘梁园区 */
    VALUE_411402("411402"),
    /** 商丘睢阳区 */
    VALUE_411403("411403"),
    /** 商丘民权县 */
    VALUE_411421("411421"),
    /** 商丘睢县 */
    VALUE_411422("411422"),
    /** 商丘宁陵县 */
    VALUE_411423("411423"),
    /** 商丘柘城县 */
    VALUE_411424("411424"),
    /** 商丘虞城县 */
    VALUE_411425("411425"),
    /** 商丘夏邑县 */
    VALUE_411426("411426"),
    /** 商丘永城市 */
    VALUE_411481("411481"),
    /** 信阳市 */
    VALUE_411500("411500"),
    /** 信阳?河区 */
    VALUE_411502("411502"),
    /** 信阳平桥区 */
    VALUE_411503("411503"),
    /** 信阳罗山县 */
    VALUE_411521("411521"),
    /** 信阳光山县 */
    VALUE_411522("411522"),
    /** 信阳新县 */
    VALUE_411523("411523"),
    /** 信阳商城县 */
    VALUE_411524("411524"),
    /** 信阳固始县 */
    VALUE_411525("411525"),
    /** 信阳潢川县 */
    VALUE_411526("411526"),
    /** 信阳淮滨县 */
    VALUE_411527("411527"),
    /** 信阳息县 */
    VALUE_411528("411528"),
    /** 周口市 */
    VALUE_411600("411600"),
    /** 周口川汇区 */
    VALUE_411602("411602"),
    /** 周口扶沟县 */
    VALUE_411621("411621"),
    /** 周口西华县 */
    VALUE_411622("411622"),
    /** 周口商水县 */
    VALUE_411623("411623"),
    /** 周口沈丘县 */
    VALUE_411624("411624"),
    /** 周口郸城县 */
    VALUE_411625("411625"),
    /** 周口淮阳县 */
    VALUE_411626("411626"),
    /** 周口太康县 */
    VALUE_411627("411627"),
    /** 周口鹿邑县 */
    VALUE_411628("411628"),
    /** 周口项城市 */
    VALUE_411681("411681"),
    /** 驻马店市 */
    VALUE_411700("411700"),
    /** 驻马店驿城区 */
    VALUE_411702("411702"),
    /** 驻马店西平县 */
    VALUE_411721("411721"),
    /** 驻马店上蔡县 */
    VALUE_411722("411722"),
    /** 驻马店平舆县 */
    VALUE_411723("411723"),
    /** 驻马店正阳县 */
    VALUE_411724("411724"),
    /** 驻马店确山县 */
    VALUE_411725("411725"),
    /** 驻马店泌阳县 */
    VALUE_411726("411726"),
    /** 驻马店汝南县 */
    VALUE_411727("411727"),
    /** 驻马店遂平县 */
    VALUE_411728("411728"),
    /** 驻马店新蔡县 */
    VALUE_411729("411729"),
    /** 河南省济源市 */
    VALUE_419001("419001"),
    /** 武汉市 */
    VALUE_420100("420100"),
    /** 武汉江岸区 */
    VALUE_420102("420102"),
    /** 武汉江汉区 */
    VALUE_420103("420103"),
    /** 武汉乔口区 */
    VALUE_420104("420104"),
    /** 武汉汉阳区 */
    VALUE_420105("420105"),
    /** 武汉武昌区 */
    VALUE_420106("420106"),
    /** 武汉青山区 */
    VALUE_420107("420107"),
    /** 武汉洪山区 */
    VALUE_420111("420111"),
    /** 武汉东西湖区 */
    VALUE_420112("420112"),
    /** 武汉汉南区 */
    VALUE_420113("420113"),
    /** 武汉蔡甸区 */
    VALUE_420114("420114"),
    /** 武汉江夏区 */
    VALUE_420115("420115"),
    /** 武汉黄陂区 */
    VALUE_420116("420116"),
    /** 武汉新洲区 */
    VALUE_420117("420117"),
    /** 黄石市 */
    VALUE_420200("420200"),
    /** 黄石港区 */
    VALUE_420202("420202"),
    /** 黄石西塞山区 */
    VALUE_420203("420203"),
    /** 黄石下陆区 */
    VALUE_420204("420204"),
    /** 黄石铁山区 */
    VALUE_420205("420205"),
    /** 黄石阳新县 */
    VALUE_420222("420222"),
    /** 黄石大冶市 */
    VALUE_420281("420281"),
    /** 十堰市 */
    VALUE_420300("420300"),
    /** 十堰茅箭区 */
    VALUE_420302("420302"),
    /** 十堰张湾区 */
    VALUE_420303("420303"),
    /** 十堰市郧阳区 */
    VALUE_420304("420304"),
    /** 十堰郧西县 */
    VALUE_420322("420322"),
    /** 十堰竹山县 */
    VALUE_420323("420323"),
    /** 十堰竹溪县 */
    VALUE_420324("420324"),
    /** 十堰房县 */
    VALUE_420325("420325"),
    /** 十堰丹江口市 */
    VALUE_420381("420381"),
    /** 宜昌市 */
    VALUE_420500("420500"),
    /** 宜昌西陵区 */
    VALUE_420502("420502"),
    /** 宜昌伍家岗区 */
    VALUE_420503("420503"),
    /** 宜昌点军区 */
    VALUE_420504("420504"),
    /** 宜昌虎亭区 */
    VALUE_420505("420505"),
    /** 宜昌夷陵区 */
    VALUE_420506("420506"),
    /** 宜昌远安县 */
    VALUE_420525("420525"),
    /** 宜昌兴山县 */
    VALUE_420526("420526"),
    /** 宜昌秭归县 */
    VALUE_420527("420527"),
    /** 宜昌长阳土家族自治县 */
    VALUE_420528("420528"),
    /** 宜昌五峰土家族自治县 */
    VALUE_420529("420529"),
    /** 宜昌宜都市 */
    VALUE_420581("420581"),
    /** 宜昌当阳市 */
    VALUE_420582("420582"),
    /** 宜昌枝江市 */
    VALUE_420583("420583"),
    /** 襄阳市 */
    VALUE_420600("420600"),
    /** 襄阳襄城区 */
    VALUE_420602("420602"),
    /** 襄阳樊城区 */
    VALUE_420606("420606"),
    /** 襄阳襄阳区 */
    VALUE_420607("420607"),
    /** 襄阳南漳县 */
    VALUE_420624("420624"),
    /** 襄阳谷城县 */
    VALUE_420625("420625"),
    /** 襄阳保康县 */
    VALUE_420626("420626"),
    /** 襄阳老河口市 */
    VALUE_420682("420682"),
    /** 襄阳枣阳市 */
    VALUE_420683("420683"),
    /** 襄阳宜城市 */
    VALUE_420684("420684"),
    /** 鄂州市 */
    VALUE_420700("420700"),
    /** 鄂州梁子湖区 */
    VALUE_420702("420702"),
    /** 鄂州华容区 */
    VALUE_420703("420703"),
    /** 鄂州鄂城区 */
    VALUE_420704("420704"),
    /** 荆门市 */
    VALUE_420800("420800"),
    /** 荆门东宝区 */
    VALUE_420802("420802"),
    /** 荆门掇刀区 */
    VALUE_420804("420804"),
    /** 荆门京山县 */
    VALUE_420821("420821"),
    /** 荆门沙洋县 */
    VALUE_420822("420822"),
    /** 荆门钟祥市 */
    VALUE_420881("420881"),
    /** 孝感市 */
    VALUE_420900("420900"),
    /** 孝感孝南区 */
    VALUE_420902("420902"),
    /** 孝感孝昌县 */
    VALUE_420921("420921"),
    /** 孝感大悟县 */
    VALUE_420922("420922"),
    /** 孝感云梦县 */
    VALUE_420923("420923"),
    /** 孝感应城市 */
    VALUE_420981("420981"),
    /** 孝感安陆市 */
    VALUE_420982("420982"),
    /** 孝感汉川市 */
    VALUE_420984("420984"),
    /** 荆州市 */
    VALUE_421000("421000"),
    /** 荆州沙市区 */
    VALUE_421002("421002"),
    /** 荆州荆州区 */
    VALUE_421003("421003"),
    /** 荆州公安县 */
    VALUE_421022("421022"),
    /** 荆州监利县 */
    VALUE_421023("421023"),
    /** 荆州江陵县 */
    VALUE_421024("421024"),
    /** 荆州石首市 */
    VALUE_421081("421081"),
    /** 荆州洪湖市 */
    VALUE_421083("421083"),
    /** 荆州松滋市 */
    VALUE_421087("421087"),
    /** 黄冈市 */
    VALUE_421100("421100"),
    /** 黄冈黄州区 */
    VALUE_421102("421102"),
    /** 黄冈团风县 */
    VALUE_421121("421121"),
    /** 黄冈红安县 */
    VALUE_421122("421122"),
    /** 黄冈罗田县 */
    VALUE_421123("421123"),
    /** 黄冈英山县 */
    VALUE_421124("421124"),
    /** 黄冈浠水县 */
    VALUE_421125("421125"),
    /** 黄冈蕲春县 */
    VALUE_421126("421126"),
    /** 黄冈黄梅县 */
    VALUE_421127("421127"),
    /** 黄冈麻城市 */
    VALUE_421181("421181"),
    /** 黄冈武穴市 */
    VALUE_421182("421182"),
    /** 咸宁市 */
    VALUE_421200("421200"),
    /** 咸宁咸安区 */
    VALUE_421202("421202"),
    /** 咸宁嘉鱼县 */
    VALUE_421221("421221"),
    /** 咸宁通城县 */
    VALUE_421222("421222"),
    /** 咸宁崇阳县 */
    VALUE_421223("421223"),
    /** 咸宁通山县 */
    VALUE_421224("421224"),
    /** 咸宁赤壁市 */
    VALUE_421281("421281"),
    /** 随州市 */
    VALUE_421300("421300"),
    /** 随州市曾都区 */
    VALUE_421303("421303"),
    /** 随州市随县 */
    VALUE_421321("421321"),
    /** 随州广水市 */
    VALUE_421381("421381"),
    /** 恩施土家族苗族自治州 */
    VALUE_422800("422800"),
    /** 恩施市 */
    VALUE_422801("422801"),
    /** 恩施利川市 */
    VALUE_422802("422802"),
    /** 恩施建始县 */
    VALUE_422822("422822"),
    /** 恩施巴东县 */
    VALUE_422823("422823"),
    /** 恩施宣恩县 */
    VALUE_422825("422825"),
    /** 恩施咸丰县 */
    VALUE_422826("422826"),
    /** 恩施来凤县 */
    VALUE_422827("422827"),
    /** 恩施鹤峰县 */
    VALUE_422828("422828"),
    /** 省直辖行政单位仙桃市 */
    VALUE_429004("429004"),
    /** 省直辖行政单位潜江市 */
    VALUE_429005("429005"),
    /** 省直辖行政单位天门市 */
    VALUE_429006("429006"),
    /** 省直辖行政单位神农架林区 */
    VALUE_429021("429021"),
    /** 长沙市 */
    VALUE_430100("430100"),
    /** 长沙芙蓉区 */
    VALUE_430102("430102"),
    /** 长沙天心区 */
    VALUE_430103("430103"),
    /** 长沙岳麓区 */
    VALUE_430104("430104"),
    /** 长沙开福区 */
    VALUE_430105("430105"),
    /** 长沙雨花区 */
    VALUE_430111("430111"),
    /** 长沙市望城区 */
    VALUE_430112("430112"),
    /** 长沙县 */
    VALUE_430121("430121"),
    /** 长沙宁乡县 */
    VALUE_430124("430124"),
    /** 长沙浏阳市 */
    VALUE_430181("430181"),
    /** 株洲市 */
    VALUE_430200("430200"),
    /** 株洲荷塘区 */
    VALUE_430202("430202"),
    /** 株洲芦淞区 */
    VALUE_430203("430203"),
    /** 株洲石峰区 */
    VALUE_430204("430204"),
    /** 株洲天元区 */
    VALUE_430211("430211"),
    /** 株洲县 */
    VALUE_430221("430221"),
    /** 株洲攸县 */
    VALUE_430223("430223"),
    /** 株洲茶陵县 */
    VALUE_430224("430224"),
    /** 株洲炎陵县 */
    VALUE_430225("430225"),
    /** 株洲醴陵市 */
    VALUE_430281("430281"),
    /** 湘潭市 */
    VALUE_430300("430300"),
    /** 湘潭雨湖区 */
    VALUE_430302("430302"),
    /** 湘潭岳塘区 */
    VALUE_430304("430304"),
    /** 湘潭县 */
    VALUE_430321("430321"),
    /** 湘潭湘乡市 */
    VALUE_430381("430381"),
    /** 湘潭韶山市 */
    VALUE_430382("430382"),
    /** 衡阳市 */
    VALUE_430400("430400"),
    /** 衡阳珠晖区 */
    VALUE_430405("430405"),
    /** 衡阳雁峰区 */
    VALUE_430406("430406"),
    /** 衡阳石鼓区 */
    VALUE_430407("430407"),
    /** 衡阳蒸湘区 */
    VALUE_430408("430408"),
    /** 衡阳南岳区 */
    VALUE_430412("430412"),
    /** 衡阳县 */
    VALUE_430421("430421"),
    /** 衡阳衡南县 */
    VALUE_430422("430422"),
    /** 衡阳衡山县 */
    VALUE_430423("430423"),
    /** 衡阳衡东县 */
    VALUE_430424("430424"),
    /** 衡阳祁东县 */
    VALUE_430426("430426"),
    /** 衡阳耒阳市 */
    VALUE_430481("430481"),
    /** 衡阳常宁市 */
    VALUE_430482("430482"),
    /** 邵阳市 */
    VALUE_430500("430500"),
    /** 邵阳双清区 */
    VALUE_430502("430502"),
    /** 邵阳大祥区 */
    VALUE_430503("430503"),
    /** 邵阳北塔区 */
    VALUE_430511("430511"),
    /** 邵阳邵东县 */
    VALUE_430521("430521"),
    /** 邵阳新邵县 */
    VALUE_430522("430522"),
    /** 邵阳县 */
    VALUE_430523("430523"),
    /** 邵阳隆回县 */
    VALUE_430524("430524"),
    /** 邵阳洞口县 */
    VALUE_430525("430525"),
    /** 邵阳绥宁县 */
    VALUE_430527("430527"),
    /** 邵阳新宁县 */
    VALUE_430528("430528"),
    /** 邵阳城步苗族自治县 */
    VALUE_430529("430529"),
    /** 邵阳武冈市 */
    VALUE_430581("430581"),
    /** 岳阳市 */
    VALUE_430600("430600"),
    /** 岳阳楼区 */
    VALUE_430602("430602"),
    /** 岳阳云溪区 */
    VALUE_430603("430603"),
    /** 岳阳君山区 */
    VALUE_430611("430611"),
    /** 岳阳县 */
    VALUE_430621("430621"),
    /** 岳阳华容县 */
    VALUE_430623("430623"),
    /** 岳阳湘阴县 */
    VALUE_430624("430624"),
    /** 岳阳平江县 */
    VALUE_430626("430626"),
    /** 岳阳汨罗市 */
    VALUE_430681("430681"),
    /** 岳阳临湘市 */
    VALUE_430682("430682"),
    /** 常德市 */
    VALUE_430700("430700"),
    /** 常德武陵区 */
    VALUE_430702("430702"),
    /** 常德鼎城区 */
    VALUE_430703("430703"),
    /** 常德安乡县 */
    VALUE_430721("430721"),
    /** 常德汉寿县 */
    VALUE_430722("430722"),
    /** 常德澧县 */
    VALUE_430723("430723"),
    /** 常德临澧县 */
    VALUE_430724("430724"),
    /** 常德桃源县 */
    VALUE_430725("430725"),
    /** 常德石门县 */
    VALUE_430726("430726"),
    /** 常德津市市 */
    VALUE_430781("430781"),
    /** 张家界市 */
    VALUE_430800("430800"),
    /** 张家界永定区 */
    VALUE_430802("430802"),
    /** 张家界武陵源区 */
    VALUE_430811("430811"),
    /** 张家界慈利县 */
    VALUE_430821("430821"),
    /** 张家界桑植县 */
    VALUE_430822("430822"),
    /** 益阳市 */
    VALUE_430900("430900"),
    /** 益阳资阳区 */
    VALUE_430902("430902"),
    /** 益阳赫山区 */
    VALUE_430903("430903"),
    /** 益阳南县 */
    VALUE_430921("430921"),
    /** 益阳桃江县 */
    VALUE_430922("430922"),
    /** 益阳安化县 */
    VALUE_430923("430923"),
    /** 益阳沅江市 */
    VALUE_430981("430981"),
    /** 郴州市 */
    VALUE_431000("431000"),
    /** 郴州北湖区 */
    VALUE_431002("431002"),
    /** 郴州苏仙区 */
    VALUE_431003("431003"),
    /** 郴州桂阳县 */
    VALUE_431021("431021"),
    /** 郴州宜章县 */
    VALUE_431022("431022"),
    /** 郴州永兴县 */
    VALUE_431023("431023"),
    /** 郴州嘉禾县 */
    VALUE_431024("431024"),
    /** 郴州临武县 */
    VALUE_431025("431025"),
    /** 郴州汝城县 */
    VALUE_431026("431026"),
    /** 郴州桂东县 */
    VALUE_431027("431027"),
    /** 郴州安仁县 */
    VALUE_431028("431028"),
    /** 郴州资兴市 */
    VALUE_431081("431081"),
    /** 永州市 */
    VALUE_431100("431100"),
    /** 永州零陵区 */
    VALUE_431102("431102"),
    /** 永州冷水滩区 */
    VALUE_431103("431103"),
    /** 永州祁阳县 */
    VALUE_431121("431121"),
    /** 永州东安县 */
    VALUE_431122("431122"),
    /** 永州双牌县 */
    VALUE_431123("431123"),
    /** 永州道县 */
    VALUE_431124("431124"),
    /** 永州江永县 */
    VALUE_431125("431125"),
    /** 永州宁远县 */
    VALUE_431126("431126"),
    /** 永州蓝山县 */
    VALUE_431127("431127"),
    /** 永州新田县 */
    VALUE_431128("431128"),
    /** 永州江华瑶族自治县 */
    VALUE_431129("431129"),
    /** 怀化市 */
    VALUE_431200("431200"),
    /** 怀化鹤城区 */
    VALUE_431202("431202"),
    /** 怀化中方县 */
    VALUE_431221("431221"),
    /** 怀化沅陵县 */
    VALUE_431222("431222"),
    /** 怀化辰溪县 */
    VALUE_431223("431223"),
    /** 怀化溆浦县 */
    VALUE_431224("431224"),
    /** 怀化会同县 */
    VALUE_431225("431225"),
    /** 怀化麻阳苗族自治县 */
    VALUE_431226("431226"),
    /** 怀化新晃侗族自治县 */
    VALUE_431227("431227"),
    /** 怀化芷江侗族自治县 */
    VALUE_431228("431228"),
    /** 怀化靖州苗族侗族自治县 */
    VALUE_431229("431229"),
    /** 怀化通道侗族自治县 */
    VALUE_431230("431230"),
    /** 怀化洪江市 */
    VALUE_431281("431281"),
    /** 娄底市 */
    VALUE_431300("431300"),
    /** 娄底娄星区 */
    VALUE_431302("431302"),
    /** 娄底双峰县 */
    VALUE_431321("431321"),
    /** 娄底新化县 */
    VALUE_431322("431322"),
    /** 娄底冷水江市 */
    VALUE_431381("431381"),
    /** 娄底涟源市 */
    VALUE_431382("431382"),
    /** 湘西土家族苗族自治州 */
    VALUE_433100("433100"),
    /** 湘西土家族苗族自治州吉首市 */
    VALUE_433101("433101"),
    /** 湘西土家族苗族自治州泸溪县 */
    VALUE_433122("433122"),
    /** 湘西土家族苗族自治州凤凰县 */
    VALUE_433123("433123"),
    /** 湘西土家族苗族自治州花垣县 */
    VALUE_433124("433124"),
    /** 湘西土家族苗族自治州保靖县 */
    VALUE_433125("433125"),
    /** 湘西土家族苗族自治州古丈县 */
    VALUE_433126("433126"),
    /** 湘西土家族苗族自治州永顺县 */
    VALUE_433127("433127"),
    /** 湘西土家族苗族自治州龙山县 */
    VALUE_433130("433130"),
    /** 广州市 */
    VALUE_440100("440100"),
    /** 广州荔湾区 */
    VALUE_440103("440103"),
    /** 广州越秀区 */
    VALUE_440104("440104"),
    /** 广州海珠区 */
    VALUE_440105("440105"),
    /** 广州天河区 */
    VALUE_440106("440106"),
    /** 广州白云区 */
    VALUE_440111("440111"),
    /** 广州黄埔区 */
    VALUE_440112("440112"),
    /** 广州番禺区 */
    VALUE_440113("440113"),
    /** 广州花都区 */
    VALUE_440114("440114"),
    /** 广州市南沙区 */
    VALUE_440115("440115"),
    /** 广州市从化区 */
    VALUE_440117("440117"),
    /** 广州市增城区 */
    VALUE_440118("440118"),
    /** 韶关市 */
    VALUE_440200("440200"),
    /** 韶关武江区 */
    VALUE_440203("440203"),
    /** 韶关浈江区 */
    VALUE_440204("440204"),
    /** 韶关曲江区 */
    VALUE_440205("440205"),
    /** 韶关始兴县 */
    VALUE_440222("440222"),
    /** 韶关仁化县 */
    VALUE_440224("440224"),
    /** 韶关翁源县 */
    VALUE_440229("440229"),
    /** 韶关乳源瑶族自治县 */
    VALUE_440232("440232"),
    /** 韶关新丰县 */
    VALUE_440233("440233"),
    /** 韶关乐昌市 */
    VALUE_440281("440281"),
    /** 韶关南雄市 */
    VALUE_440282("440282"),
    /** 深圳市 */
    VALUE_440300("440300"),
    /** 深圳罗湖区 */
    VALUE_440303("440303"),
    /** 深圳福田区 */
    VALUE_440304("440304"),
    /** 深圳南山区 */
    VALUE_440305("440305"),
    /** 深圳宝安区 */
    VALUE_440306("440306"),
    /** 深圳龙岗区 */
    VALUE_440307("440307"),
    /** 深圳盐田区 */
    VALUE_440308("440308"),
    /** 珠海市 */
    VALUE_440400("440400"),
    /** 珠海香洲区 */
    VALUE_440402("440402"),
    /** 珠海斗门区 */
    VALUE_440403("440403"),
    /** 珠海金湾区 */
    VALUE_440404("440404"),
    /** 汕头市 */
    VALUE_440500("440500"),
    /** 汕头龙湖区 */
    VALUE_440507("440507"),
    /** 汕头金平区 */
    VALUE_440511("440511"),
    /** 汕头濠江区 */
    VALUE_440512("440512"),
    /** 汕头潮阳区 */
    VALUE_440513("440513"),
    /** 汕头潮南区 */
    VALUE_440514("440514"),
    /** 汕头澄海区 */
    VALUE_440515("440515"),
    /** 汕头南澳县 */
    VALUE_440523("440523"),
    /** 佛山市 */
    VALUE_440600("440600"),
    /** 汕头禅城区 */
    VALUE_440604("440604"),
    /** 佛山南海区 */
    VALUE_440605("440605"),
    /** 佛山顺德区 */
    VALUE_440606("440606"),
    /** 佛山三水区 */
    VALUE_440607("440607"),
    /** 佛山高明区 */
    VALUE_440608("440608"),
    /** 江门市 */
    VALUE_440700("440700"),
    /** 江门蓬江区 */
    VALUE_440703("440703"),
    /** 江门江海区 */
    VALUE_440704("440704"),
    /** 江门新会区 */
    VALUE_440705("440705"),
    /** 江门台山市 */
    VALUE_440781("440781"),
    /** 江门开平市 */
    VALUE_440783("440783"),
    /** 江门鹤山市 */
    VALUE_440784("440784"),
    /** 江门恩平市 */
    VALUE_440785("440785"),
    /** 湛江市 */
    VALUE_440800("440800"),
    /** 湛江赤坎区 */
    VALUE_440802("440802"),
    /** 湛江霞山区 */
    VALUE_440803("440803"),
    /** 湛江坡头区 */
    VALUE_440804("440804"),
    /** 湛江麻章区 */
    VALUE_440811("440811"),
    /** 湛江遂溪县 */
    VALUE_440823("440823"),
    /** 湛江徐闻县 */
    VALUE_440825("440825"),
    /** 湛江廉江市 */
    VALUE_440881("440881"),
    /** 湛江雷州市 */
    VALUE_440882("440882"),
    /** 湛江吴川市 */
    VALUE_440883("440883"),
    /** 茂名市 */
    VALUE_440900("440900"),
    /** 茂名茂南区 */
    VALUE_440902("440902"),
    /** 茂名市电白区 */
    VALUE_440904("440904"),
    /** 茂名高州市 */
    VALUE_440981("440981"),
    /** 茂名化州市 */
    VALUE_440982("440982"),
    /** 茂名信宜市 */
    VALUE_440983("440983"),
    /** 肇庆市 */
    VALUE_441200("441200"),
    /** 肇庆端州区 */
    VALUE_441202("441202"),
    /** 肇庆鼎湖区 */
    VALUE_441203("441203"),
    /** 肇庆广宁县 */
    VALUE_441223("441223"),
    /** 肇庆怀集县 */
    VALUE_441224("441224");

    private String value;

    private City(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static City byValue(String value) {
        for (City item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}