package com.dcits.blacklist.enums;

/** 凭证类型 */
public enum DocType {
    /** 三省一市汇票 */
    VALUE_778("778"),
    /** 银行本票 */
    VALUE_779("779"),
    /** 单位存款证明 */
    VALUE_724("724"),
    /** 联名卡普卡 */
    VALUE_745("745"),
    /** 芯片卡 */
    VALUE_746("746"),
    /** 联名卡金卡 */
    VALUE_747("747"),
    /** 单芯片卡 */
    VALUE_749("749"),
    /** 个人存款证明 */
    VALUE_721("721"),
    /** 资信证明书-购买基金产品 */
    VALUE_722("722"),
    /** 资信证明书-购买理财产品 */
    VALUE_723("723"),
    /** 华兴二类户卡 */
    VALUE_742("742"),
    /** 网协联名卡二类普卡 */
    VALUE_743("743"),
    /** 网协联名卡二类金卡 */
    VALUE_744("744"),
    /** 中意人寿保单凭证 */
    VALUE_702("702"),
    /** 电子旅行支票 */
    VALUE_703("703"),
    /** 外币携带证 */
    VALUE_704("704"),
    /** 安邦财险保单凭证 */
    VALUE_709("709"),
    /** 和谐健康保单凭证 */
    VALUE_710("710"),
    /** 阳光人寿保险保单凭证 */
    VALUE_711("711"),
    /** 横琴人寿保险保单凭证 */
    VALUE_712("712"),
    /** 中美大都会保单凭证 */
    VALUE_713("713"),
    /** 中国人保寿险保单凭证 */
    VALUE_714("714"),
    /** 普通存折 */
    VALUE_731("731"),
    /** 定期一本通 */
    VALUE_735("735"),
    /** 定期储蓄存款单 */
    VALUE_737("737"),
    /** 磁条卡 */
    VALUE_741("741"),
    /** 单位结算卡 */
    VALUE_748("748"),
    /** 他行其他重空凭证 */
    VALUE_750("750"),
    /** 单位定期存单 */
    VALUE_771("771"),
    /** 单位定期存款开户证实书 */
    VALUE_772("772"),
    /** 银行汇票 */
    VALUE_773("773"),
    /** 银行承兑汇票 */
    VALUE_776("776"),
    /** 商业承兑汇票 */
    VALUE_777("777"),
    /** 普通支票 */
    VALUE_780("780"),
    /** 现金支票 */
    VALUE_781("781"),
    /** 转账支票 */
    VALUE_782("782"),
    /** 他行现金支票 */
    VALUE_783("783"),
    /** 他行转账支票 */
    VALUE_784("784"),
    /** 他行普通支票 */
    VALUE_785("785"),
    /** 结算业务委托书 */
    VALUE_786("786"),
    /** 他行结算业务委托书 */
    VALUE_787("787"),
    /** 非税收入电子票据 */
    VALUE_790("790"),
    /** 广东非税收入票据 */
    VALUE_791("791"),
    /** 社保卡凭证 */
    VALUE_792("792"),
    /** 电子银行USBKEY(FT) */
    VALUE_801("801"),
    /** 空白印鉴卡 */
    VALUE_810("810");

    private String value;

    private DocType(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static DocType byValue(String value) {
        for (DocType item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}