package com.dcits.blacklist.enums;

/** 国标行业类型 */
public enum Industry {
    /** 农、林、牧、渔业 */
    A("A"),
    /** 农业 */
    A0100("A0100"),
    /** 谷物种植 */
    A0110("A0110"),
    /** 稻谷种植 */
    A0111("A0111"),
    /** 小麦种植 */
    A0112("A0112"),
    /** 玉米种植 */
    A0113("A0113"),
    /** 其他谷物种植 */
    A0119("A0119"),
    /** 豆类、油料和薯类种植 */
    A0120("A0120"),
    /** 豆类种植 */
    A0121("A0121"),
    /** 油料种植 */
    A0122("A0122"),
    /** 薯类种植 */
    A0123("A0123"),
    /** 棉、麻、糖、烟草种植 */
    A0130("A0130"),
    /** 棉花种植 */
    A0131("A0131"),
    /** 麻类种植 */
    A0132("A0132"),
    /** 糖料种植 */
    A0133("A0133"),
    /** 烟草种植 */
    A0134("A0134"),
    /** 蔬菜、食用菌及园艺作物种植 */
    A0140("A0140"),
    /** 蔬菜种植 */
    A0141("A0141"),
    /** 食用菌种植 */
    A0142("A0142"),
    /** 花卉种植 */
    A0143("A0143"),
    /** 其他园艺作物种植 */
    A0149("A0149"),
    /** 水果种植 */
    A0150("A0150"),
    /** 仁果类和核果类水果种植 */
    A0151("A0151"),
    /** 葡萄种植 */
    A0152("A0152"),
    /** 柑橘类种植 */
    A0153("A0153"),
    /** 香蕉等亚热带水果种植 */
    A0154("A0154"),
    /** 其他水果种植 */
    A0159("A0159"),
    /** 坚果、含油果、香料和饮料作物种植 */
    A0160("A0160"),
    /** 坚果种植 */
    A0161("A0161"),
    /** 含油果种植 */
    A0162("A0162"),
    /** 香料作物种植 */
    A0163("A0163"),
    /** 茶叶种植 */
    A0164("A0164"),
    /** 其他饮料作物种植 */
    A0169("A0169"),
    /** 中药材种植 */
    A0170("A0170"),
    /** 中草药种植 */
    A0171("A0171"),
    /** 其他中药材种植 */
    A0179("A0179"),
    /** 草种植及割草 */
    A0180("A0180"),
    /** 草种植 */
    A0181("A0181"),
    /** 天然草原割草 */
    A0182("A0182"),
    /** 其他农业 */
    A0190("A0190"),
    /** 其他农业 */
    A0191("A0191"),
    /** 林业 */
    A0200("A0200"),
    /** 林木育种和育苗 */
    A0210("A0210"),
    /** 林木育种 */
    A0211("A0211"),
    /** 林木育苗 */
    A0212("A0212"),
    /** 造林和更新 */
    A0220("A0220"),
    /** 造林和更新 */
    A0221("A0221"),
    /** 森林经营、管护和改培 */
    A0230("A0230"),
    /** 森林经营和管护 */
    A0231("A0231"),
    /** 森林改培 */
    A0232("A0232"),
    /** 木材和竹材采运 */
    A0240("A0240"),
    /** 木材采运 */
    A0241("A0241"),
    /** 竹材采运 */
    A0242("A0242"),
    /** 林产品采集 */
    A0250("A0250"),
    /** 木竹材林产品采集 */
    A0251("A0251"),
    /** 非木竹材林产品采集 */
    A0252("A0252"),
    /** 畜牧业 */
    A0300("A0300"),
    /** 牲畜饲养 */
    A0310("A0310"),
    /** 牛的饲养 */
    A0311("A0311"),
    /** 马的饲养 */
    A0312("A0312"),
    /** 猪的饲养 */
    A0313("A0313"),
    /** 羊的饲养 */
    A0314("A0314"),
    /** 骆驼饲养 */
    A0315("A0315"),
    /** 其他牲畜饲养 */
    A0319("A0319"),
    /** 家禽饲养 */
    A0320("A0320"),
    /** 鸡的饲养 */
    A0321("A0321"),
    /** 鸭的饲养 */
    A0322("A0322"),
    /** 鹅的饲养 */
    A0323("A0323"),
    /** 其他家禽饲养 */
    A0329("A0329"),
    /** 狩猎和捕捉动物 */
    A0330("A0330"),
    /** 狩猎和捕捉动物 */
    A0331("A0331"),
    /** 其他畜牧业 */
    A0390("A0390"),
    /** 兔的饲养 */
    A0391("A0391"),
    /** 蜜蜂饲养 */
    A0392("A0392"),
    /** 其他未列明畜牧业 */
    A0399("A0399"),
    /** 渔业 */
    A0400("A0400"),
    /** 水产养殖 */
    A0410("A0410"),
    /** 海水养殖 */
    A0411("A0411"),
    /** 内陆养殖 */
    A0412("A0412"),
    /** 水产捕捞 */
    A0420("A0420"),
    /** 海水捕捞 */
    A0421("A0421"),
    /** 内陆捕捞 */
    A0422("A0422"),
    /** 农、林、牧、渔专业及辅助性活动 */
    A0500("A0500"),
    /** 农业专业及辅助性活动 */
    A0510("A0510"),
    /** 种子种苗培育活动 */
    A0511("A0511"),
    /** 农业机械活动 */
    A0512("A0512"),
    /** 灌溉活动 */
    A0513("A0513"),
    /** 农产品初加工活动 */
    A0514("A0514"),
    /** 农作物病虫害防治活动 */
    A0515("A0515"),
    /** 其他农业专业及辅助性活动 */
    A0519("A0519"),
    /** 林业专业及辅助性活动 */
    A0520("A0520"),
    /** 林业有害生物防治活动 */
    A0521("A0521"),
    /** 森林防火活动 */
    A0522("A0522"),
    /** 林产品初级加工活动 */
    A0523("A0523"),
    /** 其他林业专业及辅助性活动 */
    A0529("A0529"),
    /** 畜牧专业及辅助性活动 */
    A0530("A0530"),
    /** 畜牧良种繁殖活动 */
    A0531("A0531"),
    /** 畜禽粪污处理活动 */
    A0532("A0532"),
    /** 其他畜牧专业及辅助性活动 */
    A0539("A0539"),
    /** 渔业专业及辅助性活动 */
    A0540("A0540"),
    /** 鱼苗及鱼种场活动 */
    A0541("A0541"),
    /** 其他渔业专业及辅助性活动 */
    A0549("A0549"),
    /** 采矿业 */
    B("B"),
    /** 煤炭开采和洗选业 */
    B0600("B0600"),
    /** 烟煤和无烟煤开采洗选 */
    B0610("B0610"),
    /** 烟煤和无烟煤开采洗选 */
    B0611("B0611"),
    /** 褐煤开采洗选 */
    B0620("B0620"),
    /** 褐煤开采洗选 */
    B0621("B0621"),
    /** 其他煤炭采选 */
    B0690("B0690"),
    /** 其他煤炭采选 */
    B0691("B0691"),
    /** 石油和天然气开采业 */
    B0700("B0700"),
    /** 石油开采 */
    B0710("B0710"),
    /** 陆地石油开采 */
    B0711("B0711"),
    /** 海洋石油开采 */
    B0712("B0712"),
    /** 天然气开采 */
    B0720("B0720"),
    /** 陆地天然气开采 */
    B0721("B0721"),
    /** 海洋天然气及可燃冰开采 */
    B0722("B0722"),
    /** 黑色金属矿采选业 */
    B0800("B0800"),
    /** 铁矿采选 */
    B0810("B0810"),
    /** 铁矿采选 */
    B0811("B0811"),
    /** 锰矿、铬矿采选 */
    B0820("B0820"),
    /** 锰矿、铬矿采选 */
    B0821("B0821"),
    /** 其他黑色金属矿采选 */
    B0890("B0890"),
    /** 其他黑色金属矿采选 */
    B0891("B0891"),
    /** 有色金属矿采选业 */
    B0900("B0900"),
    /** 常用有色金属矿采选 */
    B0910("B0910"),
    /** 铜矿采选 */
    B0911("B0911"),
    /** 铅锌矿采选 */
    B0912("B0912"),
    /** 镍钴矿采选 */
    B0913("B0913"),
    /** 锡矿采选 */
    B0914("B0914"),
    /** 锑矿采选 */
    B0915("B0915"),
    /** 铝矿采选 */
    B0916("B0916"),
    /** 镁矿采选 */
    B0917("B0917"),
    /** 其他常用有色金属矿采选 */
    B0919("B0919"),
    /** 贵金属矿采选 */
    B0920("B0920"),
    /** 金矿采选 */
    B0921("B0921"),
    /** 银矿采选 */
    B0922("B0922"),
    /** 其他贵金属矿采选 */
    B0929("B0929"),
    /** 稀有稀土金属矿采选 */
    B0930("B0930"),
    /** 钨钼矿采选 */
    B0931("B0931"),
    /** 稀土金属矿采选 */
    B0932("B0932"),
    /** 放射性金属矿采选 */
    B0933("B0933"),
    /** 其他稀有金属矿采选 */
    B0939("B0939"),
    /** 非金属矿采选业 */
    B1000("B1000"),
    /** 土砂石开采 */
    B1010("B1010"),
    /** 石灰石、石膏开采 */
    B1011("B1011"),
    /** 建筑装饰用石开采 */
    B1012("B1012"),
    /** 耐火土石开采 */
    B1013("B1013"),
    /** 粘土及其他土砂石开采 */
    B1019("B1019"),
    /** 化学矿开采 */
    B1020("B1020"),
    /** 化学矿开采 */
    B1021("B1021"),
    /** 采盐 */
    B1030("B1030"),
    /** 采盐 */
    B1031("B1031"),
    /** 石棉及其他非金属矿采选 */
    B1090("B1090"),
    /** 石棉、云母矿采选 */
    B1091("B1091"),
    /** 石墨、滑石采选 */
    B1092("B1092"),
    /** 宝石、玉石采选 */
    B1093("B1093"),
    /** 其他未列明非金属矿采选 */
    B1099("B1099"),
    /** 开采专业及辅助性活动 */
    B1100("B1100"),
    /** 煤炭开采和洗选专业及辅助性活动 */
    B1110("B1110"),
    /** 煤炭开采和洗选专业及辅助性活动 */
    B1111("B1111"),
    /** 石油和天然气开采专业及辅助性活动 */
    B1120("B1120"),
    /** 石油和天然气开采专业及辅助性活动 */
    B1121("B1121"),
    /** 其他开采专业及辅助性活动 */
    B1190("B1190"),
    /** 其他开采专业及辅助性活动 */
    B1191("B1191"),
    /** 其他采矿业 */
    B1200("B1200"),
    /** 其他采矿业 */
    B1201("B1201"),
    /** 其他采矿业 */
    B1210("B1210"),
    /** 制造业 */
    C("C"),
    /** 农副食品加工业 */
    C1300("C1300"),
    /** 谷物磨制 */
    C1310("C1310"),
    /** 稻谷加工 */
    C1311("C1311"),
    /** 小麦加工 */
    C1312("C1312"),
    /** 玉米加工 */
    C1313("C1313"),
    /** 杂粮加工 */
    C1314("C1314"),
    /** 其他谷物磨制 */
    C1319("C1319"),
    /** 饲料加工 */
    C1320("C1320"),
    /** 宠物饲料加工 */
    C1321("C1321"),
    /** 其他饲料加工 */
    C1329("C1329"),
    /** 植物油加工 */
    C1330("C1330"),
    /** 食用植物油加工 */
    C1331("C1331"),
    /** 非食用植物油加工 */
    C1332("C1332"),
    /** 制糖业 */
    C1340("C1340"),
    /** 制糖业 */
    C1341("C1341"),
    /** 屠宰及肉类加工 */
    C1350("C1350"),
    /** 牲畜屠宰 */
    C1351("C1351"),
    /** 禽类屠宰 */
    C1352("C1352"),
    /** 肉制品及副产品加工 */
    C1353("C1353"),
    /** 水产品加工 */
    C1360("C1360"),
    /** 水产品冷冻加工 */
    C1361("C1361"),
    /** 鱼糜制品及水产品干腌制加工 */
    C1362("C1362"),
    /** 鱼油提取及制品制造 */
    C1363("C1363"),
    /** 其他水产品加工 */
    C1369("C1369"),
    /** 蔬菜、菌类、水果和坚果加工 */
    C1370("C1370"),
    /** 蔬菜加工 */
    C1371("C1371"),
    /** 食用菌加工 */
    C1372("C1372"),
    /** 水果和坚果加工 */
    C1373("C1373"),
    /** 其他农副食品加工 */
    C1390("C1390"),
    /** 淀粉及淀粉制品制造 */
    C1391("C1391"),
    /** 豆制品制造 */
    C1392("C1392"),
    /** 蛋品加工 */
    C1393("C1393"),
    /** 其他未列明农副食品加工 */
    C1399("C1399"),
    /** 食品制造业 */
    C1400("C1400"),
    /** 焙烤食品制造 */
    C1410("C1410"),
    /** 糕点、面包制造 */
    C1411("C1411"),
    /** 饼干及其他焙烤食品制造 */
    C1419("C1419"),
    /** 糖果、巧克力及蜜饯制造 */
    C1420("C1420"),
    /** 糖果、巧克力制造 */
    C1421("C1421"),
    /** 蜜饯制作 */
    C1422("C1422"),
    /** 方便食品制造 */
    C1430("C1430"),
    /** 米、面制品制造 */
    C1431("C1431"),
    /** 速冻食品制造 */
    C1432("C1432"),
    /** 方便面制造 */
    C1433("C1433"),
    /** 其他方便食品制造 */
    C1439("C1439"),
    /** 乳制品制造 */
    C1440("C1440"),
    /** 液体乳制造 */
    C1441("C1441"),
    /** 乳粉制造 */
    C1442("C1442"),
    /** 其他乳制品制造 */
    C1449("C1449"),
    /** 罐头食品制造 */
    C1450("C1450"),
    /** 肉、禽类罐头制造 */
    C1451("C1451"),
    /** 水产品罐头制造 */
    C1452("C1452"),
    /** 蔬菜、水果罐头制造 */
    C1453("C1453"),
    /** 其他罐头食品制造 */
    C1459("C1459"),
    /** 调味品、发酵制品制造 */
    C1460("C1460"),
    /** 味精制造 */
    C1461("C1461"),
    /** 酱油、食醋及类似制品制造 */
    C1462("C1462"),
    /** 其他调味品、发酵制品制造 */
    C1469("C1469"),
    /** 其他食品制造 */
    C1490("C1490"),
    /** 营养食品制造 */
    C1491("C1491"),
    /** 保健食品制造 */
    C1492("C1492"),
    /** 冷冻饮品及食用冰制造 */
    C1493("C1493"),
    /** 盐加工 */
    C1494("C1494"),
    /** 食品及饲料添加剂制造 */
    C1495("C1495"),
    /** 其他未列明食品制造 */
    C1499("C1499"),
    /** 酒、饮料和精制茶制造业 */
    C1500("C1500"),
    /** 酒的制造 */
    C1510("C1510"),
    /** 酒精制造 */
    C1511("C1511"),
    /** 白酒制造 */
    C1512("C1512"),
    /** 啤酒制造 */
    C1513("C1513"),
    /** 黄酒制造 */
    C1514("C1514"),
    /** 葡萄酒制造 */
    C1515("C1515"),
    /** 其他酒制造 */
    C1519("C1519"),
    /** 饮料制造 */
    C1520("C1520"),
    /** 碳酸饮料制造 */
    C1521("C1521"),
    /** 瓶（罐）装饮用水制造 */
    C1522("C1522"),
    /** 果菜汁及果菜汁饮料制造 */
    C1523("C1523"),
    /** 含乳饮料和植物蛋白饮料制造 */
    C1524("C1524"),
    /** 固体饮料制造 */
    C1525("C1525"),
    /** 茶饮料及其他饮料制造 */
    C1529("C1529"),
    /** 精制茶加工 */
    C1530("C1530"),
    /** 精制茶加工 */
    C1531("C1531"),
    /** 烟草制品业 */
    C1600("C1600"),
    /** 烟叶复烤 */
    C1610("C1610"),
    /** 烟叶复烤 */
    C1611("C1611"),
    /** 卷烟制造 */
    C1620("C1620"),
    /** 卷烟制造 */
    C1621("C1621"),
    /** 其他烟草制品制造 */
    C1690("C1690"),
    /** 其他烟草制品制造 */
    C1691("C1691"),
    /** 纺织业 */
    C1700("C1700"),
    /** 棉纺织及印染精加工 */
    C1710("C1710"),
    /** 棉纺纱加工 */
    C1711("C1711"),
    /** 棉织造加工 */
    C1712("C1712"),
    /** 棉印染精加工 */
    C1713("C1713"),
    /** 毛纺织及染整精加工 */
    C1720("C1720"),
    /** 毛条和毛纱线加工 */
    C1721("C1721"),
    /** 毛织造加工 */
    C1722("C1722"),
    /** 毛染整精加工 */
    C1723("C1723"),
    /** 麻纺织及染整精加工 */
    C1730("C1730"),
    /** 麻纤维纺前加工和纺纱 */
    C1731("C1731"),
    /** 麻织造加工 */
    C1732("C1732"),
    /** 麻染整精加工 */
    C1733("C1733"),
    /** 丝绢纺织及印染精加工 */
    C1740("C1740"),
    /** 缫丝加工 */
    C1741("C1741"),
    /** 绢纺和丝织加工 */
    C1742("C1742"),
    /** 丝印染精加工 */
    C1743("C1743"),
    /** 化纤织造及印染精加工 */
    C1750("C1750"),
    /** 化纤织造加工 */
    C1751("C1751"),
    /** 化纤织物染整精加工 */
    C1752("C1752"),
    /** 针织或钩针编织物及其制品制造 */
    C1760("C1760"),
    /** 针织或钩针编织物织造 */
    C1761("C1761"),
    /** 针织或钩针编织物印染精加工 */
    C1762("C1762"),
    /** 针织或钩针编织品制造 */
    C1763("C1763"),
    /** 家用纺织制成品制造 */
    C1770("C1770"),
    /** 床上用品制造 */
    C1771("C1771"),
    /** 毛巾类制品制造 */
    C1772("C1772"),
    /** 窗帘、布艺类产品制造 */
    C1773("C1773"),
    /** 其他家用纺织制成品制造 */
    C1779("C1779"),
    /** 产业用纺织制成品制造 */
    C1780("C1780"),
    /** 非织造布制造 */
    C1781("C1781"),
    /** 绳、索、缆制造 */
    C1782("C1782"),
    /** 纺织带和帘子布制造 */
    C1783("C1783"),
    /** 篷、帆布制造 */
    C1784("C1784"),
    /** 其他产业用纺织制成品制造 */
    C1789("C1789"),
    /** 纺织服装、服饰业 */
    C1800("C1800"),
    /** 机织服装制造 */
    C1810("C1810"),
    /** 运动机织服装制造 */
    C1811("C1811"),
    /** 其他机织服装制造 */
    C1819("C1819"),
    /** 针织或钩针编织服装制造 */
    C1820("C1820"),
    /** 运动休闲针织服装制造 */
    C1821("C1821"),
    /** 其他针织或钩针编织服装制造 */
    C1829("C1829"),
    /** 服饰制造 */
    C1830("C1830"),
    /** 服饰制造 */
    C1831("C1831"),
    /** 皮革、毛皮、羽毛及其制品和制鞋业 */
    C1900("C1900"),
    /** 皮革鞣制加工 */
    C1910("C1910"),
    /** 皮革鞣制加工 */
    C1911("C1911"),
    /** 皮革制品制造 */
    C1920("C1920"),
    /** 皮革服装制造 */
    C1921("C1921"),
    /** 皮箱、包（袋）制造 */
    C1922("C1922"),
    /** 皮手套及皮装饰制品制造 */
    C1923("C1923"),
    /** 其他皮革制品制造 */
    C1929("C1929"),
    /** 毛皮鞣制及制品加工 */
    C1930("C1930"),
    /** 毛皮鞣制加工 */
    C1931("C1931"),
    /** 毛皮服装加工 */
    C1932("C1932"),
    /** 其他毛皮制品加工 */
    C1939("C1939"),
    /** 羽毛(绒)加工及制品制造 */
    C1940("C1940"),
    /** 羽毛（绒）加工 */
    C1941("C1941"),
    /** 羽毛（绒）制品加工 */
    C1942("C1942"),
    /** 制鞋业 */
    C1950("C1950"),
    /** 纺织面料鞋制造 */
    C1951("C1951"),
    /** 皮鞋制造 */
    C1952("C1952"),
    /** 塑料鞋制造 */
    C1953("C1953"),
    /** 橡胶鞋制造 */
    C1954("C1954"),
    /** 其他制鞋业 */
    C1959("C1959"),
    /** 木材加工和木、竹、藤、棕、草制品业 */
    C2000("C2000"),
    /** 木材加工 */
    C2010("C2010"),
    /** 锯材加工 */
    C2011("C2011"),
    /** 木片加工 */
    C2012("C2012"),
    /** 单板加工 */
    C2013("C2013"),
    /** 其他木材加工 */
    C2019("C2019"),
    /** 人造板制造 */
    C2020("C2020"),
    /** 胶合板制造 */
    C2021("C2021"),
    /** 纤维板制造 */
    C2022("C2022"),
    /** 刨花板制造 */
    C2023("C2023"),
    /** 其他人造板制造 */
    C2029("C2029"),
    /** 木质制品制造 */
    C2030("C2030"),
    /** 建筑用木料及木材组件加工 */
    C2031("C2031"),
    /** 木门窗制造 */
    C2032("C2032"),
    /** 木楼梯制造 */
    C2033("C2033"),
    /** 木地板制造 */
    C2034("C2034"),
    /** 木制容器制造 */
    C2035("C2035"),
    /** 软木制品及其他木制品制造 */
    C2039("C2039"),
    /** 竹、藤、棕、草等制品制造 */
    C2040("C2040"),
    /** 竹制品制造 */
    C2041("C2041"),
    /** 藤制品制造 */
    C2042("C2042"),
    /** 棕制品制造 */
    C2043("C2043"),
    /** 草及其他制品制造 */
    C2049("C2049"),
    /** 家具制造业 */
    C2100("C2100"),
    /** 木质家具制造 */
    C2110("C2110"),
    /** 木质家具制造 */
    C2111("C2111"),
    /** 竹、藤家具制造 */
    C2120("C2120"),
    /** 竹、藤家具制造 */
    C2121("C2121"),
    /** 金属家具制造 */
    C2130("C2130"),
    /** 金属家具制造 */
    C2131("C2131"),
    /** 塑料家具制造 */
    C2140("C2140"),
    /** 塑料家具制造 */
    C2141("C2141"),
    /** 其他家具制造 */
    C2190("C2190"),
    /** 其他家具制造 */
    C2191("C2191"),
    /** 造纸和纸制品业 */
    C2200("C2200"),
    /** 纸浆制造 */
    C2210("C2210"),
    /** 木竹浆制造 */
    C2211("C2211"),
    /** 非木竹浆制造 */
    C2212("C2212"),
    /** 造纸 */
    C2220("C2220"),
    /** 机制纸及纸板制造 */
    C2221("C2221"),
    /** 手工纸制造 */
    C2222("C2222"),
    /** 加工纸制造 */
    C2223("C2223"),
    /** 纸制品制造 */
    C2230("C2230"),
    /** 纸和纸板容器制造 */
    C2231("C2231"),
    /** 其他纸制品制造 */
    C2239("C2239"),
    /** 印刷和记录媒介复制业 */
    C2300("C2300"),
    /** 印刷 */
    C2310("C2310"),
    /** 书、报刊印刷 */
    C2311("C2311"),
    /** 本册印制 */
    C2312("C2312"),
    /** 包装装潢及其他印刷 */
    C2319("C2319"),
    /** 装订及印刷相关服务 */
    C2320("C2320"),
    /** 装订及印刷相关服务 */
    C2321("C2321"),
    /** 记录媒介复制 */
    C2330("C2330"),
    /** 记录媒介复制 */
    C2331("C2331"),
    /** 文教、工美、体育和娱乐用品制造业 */
    C2400("C2400"),
    /** 文教办公用品制造 */
    C2410("C2410"),
    /** 文具制造 */
    C2411("C2411"),
    /** 笔的制造 */
    C2412("C2412"),
    /** 教学用模型及教具制造 */
    C2413("C2413"),
    /** 墨水、墨汁制造 */
    C2414("C2414"),
    /** 其他文教办公用品制造 */
    C2419("C2419"),
    /** 乐器制造 */
    C2420("C2420"),
    /** 中乐器制造 */
    C2421("C2421"),
    /** 西乐器制造 */
    C2422("C2422"),
    /** 电子乐器制造 */
    C2423("C2423"),
    /** 其他乐器及零件制造 */
    C2429("C2429"),
    /** 工艺美术及礼仪用品制造 */
    C2430("C2430"),
    /** 雕塑工艺品制造 */
    C2431("C2431"),
    /** 金属工艺品制造 */
    C2432("C2432"),
    /** 漆器工艺品制造 */
    C2433("C2433"),
    /** 花画工艺品制造 */
    C2434("C2434"),
    /** 天然植物纤维编织工艺品制造 */
    C2435("C2435"),
    /** 抽纱刺绣工艺品制造 */
    C2436("C2436"),
    /** 地毯、挂毯制造 */
    C2437("C2437"),
    /** 珠宝首饰及有关物品制造 */
    C2438("C2438"),
    /** 其他工艺美术及礼仪用品制造 */
    C2439("C2439"),
    /** 体育用品制造 */
    C2440("C2440"),
    /** 球类制造 */
    C2441("C2441"),
    /** 专项运动器材及配件制造 */
    C2442("C2442"),
    /** 健身器材制造 */
    C2443("C2443"),
    /** 运动防护用具制造 */
    C2444("C2444"),
    /** 其他体育用品制造 */
    C2449("C2449"),
    /** 玩具制造 */
    C2450("C2450"),
    /** 电玩具制造 */
    C2451("C2451"),
    /** 塑胶玩具制造 */
    C2452("C2452"),
    /** 金属玩具制造 */
    C2453("C2453"),
    /** 弹射玩具制造 */
    C2454("C2454"),
    /** 娃娃玩具制造 */
    C2455("C2455"),
    /** 儿童乘骑玩耍的童车类产品制造 */
    C2456("C2456"),
    /** 其他玩具制造 */
    C2459("C2459"),
    /** 游艺器材及娱乐用品制造 */
    C2460("C2460"),
    /** 露天游乐场所游乐设备制造 */
    C2461("C2461"),
    /** 游艺用品及室内游艺器材制造 */
    C2462("C2462"),
    /** 其他娱乐用品制造 */
    C2469("C2469"),
    /** 石油、煤炭及其他燃料加工业 */
    C2500("C2500"),
    /** 精炼石油产品制造 */
    C2510("C2510"),
    /** 原油加工及石油制品制造 */
    C2511("C2511"),
    /** 其他原油制造 */
    C2519("C2519"),
    /** 煤炭加工 */
    C2520("C2520"),
    /** 炼焦 */
    C2521("C2521"),
    /** 煤制合成气生产 */
    C2522("C2522"),
    /** 煤制液体燃料生产 */
    C2523("C2523"),
    /** 煤制品制造 */
    C2524("C2524"),
    /** 其他煤炭加工 */
    C2529("C2529"),
    /** 核燃料加工 */
    C2530("C2530"),
    /** 核燃料加工 */
    C2531("C2531"),
    /** 生物质燃料加工 */
    C2540("C2540"),
    /** 生物质液体燃料生产 */
    C2541("C2541"),
    /** 生物质致密成型燃料加工 */
    C2542("C2542"),
    /** 化学原料和化学制品制造业 */
    C2600("C2600"),
    /** 基础化学原料制造 */
    C2610("C2610"),
    /** 无机酸制造 */
    C2611("C2611"),
    /** 无机碱制造 */
    C2612("C2612"),
    /** 无机盐制造 */
    C2613("C2613"),
    /** 有机化学原料制造 */
    C2614("C2614"),
    /** 其他基础化学原料制造 */
    C2619("C2619"),
    /** 肥料制造 */
    C2620("C2620"),
    /** 氮肥制造 */
    C2621("C2621"),
    /** 磷肥制造 */
    C2622("C2622"),
    /** 钾肥制造 */
    C2623("C2623"),
    /** 复混肥料制造 */
    C2624("C2624"),
    /** 有机肥料及微生物肥料制造 */
    C2625("C2625"),
    /** 其他肥料制造 */
    C2629("C2629"),
    /** 农药制造 */
    C2630("C2630"),
    /** 化学农药制造 */
    C2631("C2631"),
    /** 生物化学农药及微生物农药制造 */
    C2632("C2632"),
    /** 涂料、油墨、颜料及类似产品制造 */
    C2640("C2640"),
    /** 涂料制造 */
    C2641("C2641"),
    /** 油墨及类似产品制造 */
    C2642("C2642"),
    /** 工业颜料制造 */
    C2643("C2643"),
    /** 工艺美术颜料制造 */
    C2644("C2644"),
    /** 染料制造 */
    C2645("C2645"),
    /** 密封用填料及类似品制造 */
    C2646("C2646"),
    /** 合成材料制造 */
    C2650("C2650"),
    /** 初级形态塑料及合成树脂制造 */
    C2651("C2651"),
    /** 合成橡胶制造 */
    C2652("C2652"),
    /** 合成纤维单（聚合）体制造 */
    C2653("C2653"),
    /** 其他合成材料制造 */
    C2659("C2659"),
    /** 专用化学产品制造 */
    C2660("C2660"),
    /** 化学试剂和助剂制造 */
    C2661("C2661"),
    /** 专项化学用品制造 */
    C2662("C2662"),
    /** 林产化学产品制造 */
    C2663("C2663"),
    /** 文化用信息化学品制造 */
    C2664("C2664"),
    /** 医学生产用信息化学品制造 */
    C2665("C2665"),
    /** 环境污染处理专用药剂材料制造 */
    C2666("C2666"),
    /** 动物胶制造 */
    C2667("C2667"),
    /** 其他专用化学产品制造 */
    C2669("C2669"),
    /** 炸药、火工及焰火产品制造 */
    C2670("C2670"),
    /** 炸药及火工产品制造 */
    C2671("C2671"),
    /** 焰火、鞭炮产品制造 */
    C2672("C2672"),
    /** 日用化学产品制造 */
    C2680("C2680"),
    /** 肥皂及洗涤剂制造 */
    C2681("C2681"),
    /** 化妆品制造 */
    C2682("C2682"),
    /** 口腔清洁用品制造 */
    C2683("C2683"),
    /** 香料、香精制造 */
    C2684("C2684"),
    /** 其他日用化学产品制造 */
    C2689("C2689"),
    /** 医药制造业 */
    C2700("C2700"),
    /** 化学药品原料药制造 */
    C2710("C2710"),
    /** 化学药品原料药制造 */
    C2711("C2711"),
    /** 化学药品制剂制造 */
    C2720("C2720"),
    /** 化学药品制剂制造 */
    C2721("C2721"),
    /** 中药饮片加工 */
    C2730("C2730"),
    /** 中药饮片加工 */
    C2731("C2731"),
    /** 中成药生产 */
    C2740("C2740"),
    /** 中成药生产 */
    C2741("C2741"),
    /** 兽用药品制造 */
    C2750("C2750"),
    /** 兽用药品制造 */
    C2751("C2751"),
    /** 生物药品制品制造 */
    C2760("C2760"),
    /** 生物药品制造 */
    C2761("C2761"),
    /** 基因工程药物和疫苗制造 */
    C2762("C2762"),
    /** 卫生材料及医药用品制造 */
    C2770("C2770"),
    /** 卫生材料及医药用品制造 */
    C2771("C2771"),
    /** 药用辅料及包装材料 */
    C2780("C2780"),
    /** 药用辅料及包装材料 */
    C2781("C2781"),
    /** 化学纤维制造业 */
    C2800("C2800"),
    /** 纤维素纤维原料及纤维制造 */
    C2810("C2810"),
    /** 化纤浆粕制造 */
    C2811("C2811"),
    /** 人造纤维（纤维素纤维）制造 */
    C2812("C2812"),
    /** 合成纤维制造 */
    C2820("C2820"),
    /** 锦纶纤维制造 */
    C2821("C2821"),
    /** 涤纶纤维制造 */
    C2822("C2822"),
    /** 腈纶纤维制造 */
    C2823("C2823"),
    /** 维纶纤维制造 */
    C2824("C2824"),
    /** 丙纶纤维制造 */
    C2825("C2825"),
    /** 氨纶纤维制造 */
    C2826("C2826"),
    /** 其他合成纤维制造 */
    C2829("C2829"),
    /** 生物基材料制造 */
    C2830("C2830"),
    /** 生物基化学纤维制造 */
    C2831("C2831"),
    /** 生物基、淀粉基新材料制造 */
    C2832("C2832"),
    /** 橡胶和塑料制品业 */
    C2900("C2900"),
    /** 橡胶制品业 */
    C2910("C2910"),
    /** 轮胎制造 */
    C2911("C2911"),
    /** 橡胶板、管、带制造 */
    C2912("C2912"),
    /** 橡胶零件制造 */
    C2913("C2913"),
    /** 再生橡胶制造 */
    C2914("C2914"),
    /** 日用及医用橡胶制品制造 */
    C2915("C2915"),
    /** 运动场地用塑胶制造 */
    C2916("C2916"),
    /** 其他橡胶制品制造 */
    C2919("C2919"),
    /** 塑料制品业 */
    C2920("C2920"),
    /** 塑料薄膜制造 */
    C2921("C2921"),
    /** 塑料板、管、型材制造 */
    C2922("C2922"),
    /** 塑料丝、绳及编织品制造 */
    C2923("C2923"),
    /** 泡沫塑料制造 */
    C2924("C2924"),
    /** 塑料人造革、合成革制造 */
    C2925("C2925"),
    /** 塑料包装箱及容器制造 */
    C2926("C2926"),
    /** 日用塑料制品制造 */
    C2927("C2927"),
    /** 人造草坪制造 */
    C2928("C2928"),
    /** 塑料零件及其他塑料制品制造 */
    C2929("C2929"),
    /** 非金属矿物制品业 */
    C3000("C3000"),
    /** 水泥、石灰和石膏制造 */
    C3010("C3010"),
    /** 水泥制造 */
    C3011("C3011"),
    /** 石灰和石膏制造 */
    C3012("C3012"),
    /** 石膏、水泥制品及类似制品制造 */
    C3020("C3020"),
    /** 水泥制品制造 */
    C3021("C3021"),
    /** 砼结构构件制造 */
    C3022("C3022"),
    /** 石棉水泥制品制造 */
    C3023("C3023"),
    /** 轻质建筑材料制造 */
    C3024("C3024"),
    /** 其他水泥类似制品制造 */
    C3029("C3029"),
    /** 砖瓦、石材等建筑材料制造 */
    C3030("C3030"),
    /** 粘土砖瓦及建筑砌块制造 */
    C3031("C3031"),
    /** 建筑用石加工 */
    C3032("C3032"),
    /** 防水建筑材料制造 */
    C3033("C3033"),
    /** 隔热和隔音材料制造 */
    C3034("C3034"),
    /** 其他建筑材料制造 */
    C3039("C3039"),
    /** 玻璃制造 */
    C3040("C3040"),
    /** 平板玻璃制造 */
    C3041("C3041"),
    /** 特种玻璃制造 */
    C3042("C3042"),
    /** 其他玻璃制造 */
    C3049("C3049"),
    /** 玻璃制品制造 */
    C3050("C3050"),
    /** 技术玻璃制品制造 */
    C3051("C3051"),
    /** 光学玻璃制造 */
    C3052("C3052"),
    /** 玻璃仪器制造 */
    C3053("C3053"),
    /** 日用玻璃制品制造 */
    C3054("C3054"),
    /** 玻璃包装容器制造 */
    C3055("C3055"),
    /** 玻璃保温容器制造 */
    C3056("C3056"),
    /** 制镜及类似品加工 */
    C3057("C3057"),
    /** 其他玻璃制品制造 */
    C3059("C3059"),
    /** 玻璃纤维和玻璃纤维增强塑料制品制造 */
    C3060("C3060"),
    /** 玻璃纤维及制品制造 */
    C3061("C3061"),
    /** 玻璃纤维增强塑料制品制造 */
    C3062("C3062"),
    /** 陶瓷制品制造 */
    C3070("C3070"),
    /** 建筑陶瓷制品制造 */
    C3071("C3071"),
    /** 卫生陶瓷制品制造 */
    C3072("C3072"),
    /** 特种陶瓷制品制造 */
    C3073("C3073"),
    /** 日用陶瓷制品制造 */
    C3074("C3074"),
    /** 陈设艺术陶瓷制造 */
    C3075("C3075"),
    /** 园艺陶瓷制造 */
    C3076("C3076"),
    /** 其他陶瓷制品制造 */
    C3079("C3079"),
    /** 耐火材料制品制造 */
    C3080("C3080"),
    /** 石棉制品制造 */
    C3081("C3081"),
    /** 云母制品制造 */
    C3082("C3082"),
    /** 耐火陶瓷制品及其他耐火材料制造 */
    C3089("C3089"),
    /** 石墨及其他非金属矿物制品制造 */
    C3090("C3090"),
    /** 石墨及碳素制品制造 */
    C3091("C3091"),
    /** 其他非金属矿物制品制造 */
    C3099("C3099"),
    /** 黑色金属冶炼和压延加工业 */
    C3100("C3100"),
    /** 炼铁 */
    C3110("C3110"),
    /** 炼铁 */
    C3111("C3111"),
    /** 炼钢 */
    C3120("C3120"),
    /** 炼钢 */
    C3121("C3121"),
    /** 钢压延加工 */
    C3130("C3130"),
    /** 钢压延加工 */
    C3131("C3131"),
    /** 铁合金冶炼 */
    C3140("C3140"),
    /** 铁合金冶炼 */
    C3141("C3141"),
    /** 有色金属冶炼和压延加工业 */
    C3200("C3200"),
    /** 常用有色金属冶炼 */
    C3210("C3210"),
    /** 铜冶炼 */
    C3211("C3211"),
    /** 铅锌冶炼 */
    C3212("C3212"),
    /** 镍钴冶炼 */
    C3213("C3213"),
    /** 锡冶炼 */
    C3214("C3214"),
    /** 锑冶炼 */
    C3215("C3215"),
    /** 铝冶炼 */
    C3216("C3216"),
    /** 镁冶炼 */
    C3217("C3217"),
    /** 硅冶炼 */
    C3218("C3218"),
    /** 其他常用有色金属冶炼 */
    C3219("C3219"),
    /** 贵金属冶炼 */
    C3220("C3220"),
    /** 金冶炼 */
    C3221("C3221"),
    /** 银冶炼 */
    C3222("C3222"),
    /** 其他贵金属冶炼 */
    C3229("C3229"),
    /** 稀有稀土金属冶炼 */
    C3230("C3230"),
    /** 钨钼冶炼 */
    C3231("C3231"),
    /** 稀土金属冶炼 */
    C3232("C3232"),
    /** 其他稀有金属冶炼 */
    C3239("C3239"),
    /** 有色金属合金制造 */
    C3240("C3240"),
    /** 有色金属合金制造 */
    C3241("C3241"),
    /** 有色金属压延加工 */
    C3250("C3250"),
    /** 铜压延加工 */
    C3251("C3251"),
    /** 铝压延加工 */
    C3252("C3252"),
    /** 贵金属压延加工 */
    C3253("C3253"),
    /** 稀有稀土金属压延加工 */
    C3254("C3254"),
    /** 其他有色金属压延加工 */
    C3259("C3259"),
    /** 金属制品业 */
    C3300("C3300"),
    /** 结构性金属制品制造 */
    C3310("C3310"),
    /** 金属结构制造 */
    C3311("C3311"),
    /** 金属门窗制造 */
    C3312("C3312"),
    /** 金属工具制造 */
    C3320("C3320"),
    /** 切削工具制造 */
    C3321("C3321"),
    /** 手工具制造 */
    C3322("C3322"),
    /** 农用及园林用金属工具制造 */
    C3323("C3323"),
    /** 刀剪及类似日用金属工具制造 */
    C3324("C3324"),
    /** 其他金属工具制造 */
    C3329("C3329"),
    /** 集装箱及金属包装容器制造 */
    C3330("C3330"),
    /** 集装箱制造 */
    C3331("C3331"),
    /** 金属压力容器制造 */
    C3332("C3332"),
    /** 金属包装容器及材料制造 */
    C3333("C3333"),
    /** 金属丝绳及其制品制造 */
    C3340("C3340"),
    /** 金属丝绳及其制品制造 */
    C3341("C3341"),
    /** 建筑、安全用金属制品制造 */
    C3350("C3350"),
    /** 建筑、家具用金属配件制造 */
    C3351("C3351"),
    /** 建筑装饰及水暖管道零件制造 */
    C3352("C3352"),
    /** 安全、消防用金属制品制造 */
    C3353("C3353"),
    /** 其他建筑、安全用金属制品制造 */
    C3359("C3359"),
    /** 金属表面处理及热处理加工 */
    C3360("C3360"),
    /** 金属表面处理及热处理加工 */
    C3361("C3361"),
    /** 搪瓷制品制造 */
    C3370("C3370"),
    /** 生产专用搪瓷制品制造 */
    C3371("C3371"),
    /** 建筑装饰搪瓷制品制造 */
    C3372("C3372"),
    /** 搪瓷卫生洁具制造 */
    C3373("C3373"),
    /** 搪瓷日用品及其他搪瓷制品制造 */
    C3379("C3379"),
    /** 金属制日用品制造 */
    C3380("C3380"),
    /** 金属制厨房用器具制造 */
    C3381("C3381"),
    /** 金属制餐具和器皿制造 */
    C3382("C3382"),
    /** 金属制卫生器具制造 */
    C3383("C3383"),
    /** 其他金属制日用品制造 */
    C3389("C3389"),
    /** 铸造及其他金属制品制造 */
    C3390("C3390"),
    /** 黑色金属铸造 */
    C3391("C3391"),
    /** 有色金属铸造 */
    C3392("C3392"),
    /** 锻件及粉末冶金制品制造 */
    C3393("C3393"),
    /** 交通及公共管理用金属标牌制造 */
    C3394("C3394"),
    /** 其他未列明金属制品制造 */
    C3399("C3399"),
    /** 通用设备制造业 */
    C3400("C3400"),
    /** 锅炉及原动设备制造 */
    C3410("C3410"),
    /** 锅炉及辅助设备制造 */
    C3411("C3411"),
    /** 内燃机及配件制造 */
    C3412("C3412"),
    /** 汽轮机及辅机制造 */
    C3413("C3413"),
    /** 水轮机及辅机制造 */
    C3414("C3414"),
    /** 风能原动设备制造 */
    C3415("C3415"),
    /** 其他原动设备制造 */
    C3419("C3419"),
    /** 金属加工机械制造 */
    C3420("C3420"),
    /** 金属切削机床制造 */
    C3421("C3421"),
    /** 金属成形机床制造 */
    C3422("C3422"),
    /** 铸造机械制造 */
    C3423("C3423"),
    /** 金属切割及焊接设备制造 */
    C3424("C3424"),
    /** 机床功能部件及附件制造 */
    C3425("C3425"),
    /** 其他金属加工机械制造 */
    C3429("C3429"),
    /** 物料搬运设备制造 */
    C3430("C3430"),
    /** 轻小型起重设备制造 */
    C3431("C3431"),
    /** 生产专用起重机制造 */
    C3432("C3432"),
    /** 生产专用车辆制造 */
    C3433("C3433"),
    /** 连续搬运设备制造 */
    C3434("C3434"),
    /** 电梯、自动扶梯及升降机制造 */
    C3435("C3435"),
    /** 客运索道制造 */
    C3436("C3436"),
    /** 机械式停车设备制造 */
    C3437("C3437"),
    /** 其他物料搬运设备制造 */
    C3439("C3439"),
    /** 泵、阀门、压缩机及类似机械制造 */
    C3440("C3440"),
    /** 泵及真空设备制造 */
    C3441("C3441"),
    /** 气体压缩机械制造 */
    C3442("C3442"),
    /** 阀门和旋塞制造 */
    C3443("C3443"),
    /** 液压动力机械及元件制造 */
    C3444("C3444"),
    /** 液力动力机械元件制造 */
    C3445("C3445"),
    /** 气压动力机械及元件制造 */
    C3446("C3446"),
    /** 轴承、齿轮和传动部件制造 */
    C3450("C3450"),
    /** 滚动轴承制造 */
    C3451("C3451"),
    /** 滑动轴承制造 */
    C3452("C3452"),
    /** 齿轮及齿轮减、变速箱制造 */
    C3453("C3453"),
    /** 其他传动部件制造 */
    C3459("C3459"),
    /** 烘炉、风机、包装等设备制造 */
    C3460("C3460"),
    /** 烘炉、熔炉及电炉制造 */
    C3461("C3461"),
    /** 风机、风扇制造 */
    C3462("C3462"),
    /** 气体、液体分离及纯净设备制造 */
    C3463("C3463"),
    /** 制冷、空调设备制造 */
    C3464("C3464"),
    /** 风动和电动工具制造 */
    C3465("C3465"),
    /** 喷枪及类似器具制造 */
    C3466("C3466"),
    /** 包装专用设备制造 */
    C3467("C3467"),
    /** 文化、办公用机械制造 */
    C3470("C3470"),
    /** 电影机械制造 */
    C3471("C3471"),
    /** 幻灯及投影设备制造 */
    C3472("C3472"),
    /** 照相机及器材制造 */
    C3473("C3473"),
    /** 复印和胶印设备制造 */
    C3474("C3474"),
    /** 计算器及货币专用设备制造 */
    C3475("C3475"),
    /** 其他文化、办公用机械制造 */
    C3479("C3479"),
    /** 通用零部件制造 */
    C3480("C3480"),
    /** 金属密封件制造 */
    C3481("C3481"),
    /** 紧固件制造 */
    C3482("C3482"),
    /** 弹簧制造 */
    C3483("C3483"),
    /** 机械零部件加工 */
    C3484("C3484"),
    /** 其他通用零部件制造 */
    C3489("C3489"),
    /** 其他通用设备制造业 */
    C3490("C3490"),
    /** 工业机器人制造 */
    C3491("C3491"),
    /** 特殊作业机器人制造 */
    C3492("C3492"),
    /** 增材制造装备制造 */
    C3493("C3493"),
    /** 其他未列明通用设备制造业 */
    C3499("C3499"),
    /** 专用设备制造业 */
    C3500("C3500"),
    /** 采矿、冶金、建筑专用设备制造 */
    C3510("C3510"),
    /** 矿山机械制造 */
    C3511("C3511"),
    /** 石油钻采专用设备制造 */
    C3512("C3512"),
    /** 深海石油钻探设备制造 */
    C3513("C3513"),
    /** 建筑工程用机械制造 */
    C3514("C3514"),
    /** 建筑材料生产专用机械制造 */
    C3515("C3515"),
    /** 冶金专用设备制造 */
    C3516("C3516"),
    /** 隧道施工专用机械制造 */
    C3517("C3517"),
    /** 化工、木材、非金属加工专用设备制造 */
    C3520("C3520"),
    /** 炼油、化工生产专用设备制造 */
    C3521("C3521"),
    /** 橡胶加工专用设备制造 */
    C3522("C3522"),
    /** 塑料加工专用设备制造 */
    C3523("C3523"),
    /** 木竹材加工机械制造 */
    C3524("C3524"),
    /** 模具制造 */
    C3525("C3525"),
    /** 其他非金属加工专用设备制造 */
    C3529("C3529"),
    /** 食品、饮料、烟草及饲料生产专用设备制造 */
    C3530("C3530"),
    /** 食品、酒、饮料及茶生产专用设备制造 */
    C3531("C3531"),
    /** 农副食品加工专用设备制造 */
    C3532("C3532"),
    /** 烟草生产专用设备制造 */
    C3533("C3533"),
    /** 饲料生产专用设备制造 */
    C3534("C3534"),
    /** 印刷、制药、日化及日用品生产专用设备制造 */
    C3540("C3540"),
    /** 制浆和造纸专用设备制造 */
    C3541("C3541"),
    /** 印刷专用设备制造 */
    C3542("C3542"),
    /** 日用化工专用设备制造 */
    C3543("C3543"),
    /** 制药专用设备制造 */
    C3544("C3544"),
    /** 照明器具生产专用设备制造 */
    C3545("C3545"),
    /** 玻璃、陶瓷和搪瓷制品生产专用设备制造 */
    C3546("C3546"),
    /** 其他日用品生产专用设备制造 */
    C3549("C3549"),
    /** 纺织、服装和皮革加工专用设备制造 */
    C3550("C3550"),
    /** 纺织专用设备制造 */
    C3551("C3551"),
    /** 皮革、毛皮及其制品加工专用设备制造 */
    C3552("C3552"),
    /** 缝制机械制造 */
    C3553("C3553"),
    /** 洗涤机械制造 */
    C3554("C3554"),
    /** 电子和电工机械专用设备制造 */
    C3560("C3560"),
    /** 电工机械专用设备制造 */
    C3561("C3561"),
    /** 半导体器件专用设备制造 */
    C3562("C3562"),
    /** 电子元器件与机电组件设备制造 */
    C3563("C3563"),
    /** 其他电子专用设备制造 */
    C3569("C3569"),
    /** 农、林、牧、渔专用机械制造 */
    C3570("C3570"),
    /** 拖拉机制造 */
    C3571("C3571"),
    /** 机械化农业及园艺机具制造 */
    C3572("C3572"),
    /** 营林及木竹采伐机械制造 */
    C3573("C3573"),
    /** 畜牧机械制造 */
    C3574("C3574"),
    /** 渔业机械制造 */
    C3575("C3575"),
    /** 农林牧渔机械配件制造 */
    C3576("C3576"),
    /** 棉花加工机械制造 */
    C3577("C3577"),
    /** 其他农、林、牧、渔业机械制造 */
    C3579("C3579"),
    /** 医疗仪器设备及器械制造 */
    C3580("C3580"),
    /** 医疗诊断、监护及治疗设备制造 */
    C3581("C3581"),
    /** 口腔科用设备及器具制造 */
    C3582("C3582"),
    /** 医疗实验室及医用消毒设备和器具制造 */
    C3583("C3583"),
    /** 医疗、外科及兽医用器械制造 */
    C3584("C3584"),
    /** 机械治疗及病房护理设备制造 */
    C3585("C3585"),
    /** 康复辅具制造 */
    C3586("C3586"),
    /** 眼镜制造 */
    C3587("C3587"),
    /** 其他医疗设备及器械制造 */
    C3589("C3589"),
    /** 环保、邮政、社会公共服务及其他专用设备制造 */
    C3590("C3590"),
    /** 环境保护专用设备制造 */
    C3591("C3591"),
    /** 地质勘查专用设备制造 */
    C3592("C3592"),
    /** 邮政专用机械及器材制造 */
    C3593("C3593"),
    /** 商业、饮食、服务专用设备制造 */
    C3594("C3594"),
    /** 社会公共安全设备及器材制造 */
    C3595("C3595"),
    /** 交通安全、管制及类似专用设备制造 */
    C3596("C3596"),
    /** 水资源专用机械制造 */
    C3597("C3597"),
    /** 其他专用设备制造 */
    C3599("C3599"),
    /** 汽车制造业 */
    C3600("C3600"),
    /** 汽车整车制造 */
    C3610("C3610"),
    /** 汽柴油车整车制造 */
    C3611("C3611"),
    /** 新能源车整车制造 */
    C3612("C3612"),
    /** 汽车用发动机制造 */
    C3620("C3620"),
    /** 汽车用发动机制造 */
    C3621("C3621"),
    /** 改装汽车制造 */
    C3630("C3630"),
    /** 改装汽车制造 */
    C3631("C3631"),
    /** 低速汽车制造 */
    C3640("C3640"),
    /** 低速汽车制造 */
    C3641("C3641"),
    /** 电车制造 */
    C3650("C3650"),
    /** 电车制造 */
    C3651("C3651"),
    /** 汽车车身、挂车制造 */
    C3660("C3660"),
    /** 汽车车身、挂车制造 */
    C3661("C3661"),
    /** 汽车零部件及配件制造 */
    C3670("C3670"),
    /** 汽车零部件及配件制造 */
    C3671("C3671"),
    /** 铁路、船舶、航空航天和其他运输设备制造业? */
    C3700("C3700"),
    /** 铁路运输设备制造 */
    C3710("C3710"),
    /** 高铁车组制造 */
    C3711("C3711"),
    /** 铁路机车车辆制造 */
    C3712("C3712"),
    /** 窄轨机车车辆制造 */
    C3713("C3713"),
    /** 高铁设备、配件制造 */
    C3714("C3714"),
    /** 铁路机车车辆配件制造 */
    C3715("C3715"),
    /** 铁路专用设备及器材、配件制造 */
    C3716("C3716"),
    /** 其他铁路运输设备制造 */
    C3719("C3719"),
    /** 城市轨道交通设备制造 */
    C3720("C3720"),
    /** 城市轨道交通设备制造 */
    C3721("C3721"),
    /** 船舶及相关装置制造 */
    C3730("C3730"),
    /** 金属船舶制造 */
    C3731("C3731"),
    /** 非金属船舶制造 */
    C3732("C3732"),
    /** 娱乐船和运动船制造 */
    C3733("C3733"),
    /** 船用配套设备制造 */
    C3734("C3734"),
    /** 船舶改装 */
    C3735("C3735"),
    /** 船舶拆除 */
    C3736("C3736"),
    /** 海洋工程装备制造 */
    C3737("C3737"),
    /** 航标器材及其他相关装置制造 */
    C3739("C3739"),
    /** 航空、航天器及设备制造 */
    C3740("C3740"),
    /** 飞机制造 */
    C3741("C3741"),
    /** 航天器及运载火箭制造 */
    C3742("C3742"),
    /** 航天相关设备制造 */
    C3743("C3743"),
    /** 航空相关设备制造 */
    C3744("C3744"),
    /** 其他航空航天器制造 */
    C3749("C3749"),
    /** 摩托车制造 */
    C3750("C3750"),
    /** 摩托车整车制造 */
    C3751("C3751"),
    /** 摩托车零部件及配件制造 */
    C3752("C3752"),
    /** 自行车和残疾人座车制造 */
    C3760("C3760"),
    /** 自行车制造 */
    C3761("C3761"),
    /** 残疾人座车制造 */
    C3762("C3762"),
    /** 助动车制造 */
    C3770("C3770"),
    /** 助动车制造 */
    C3771("C3771"),
    /** 非公路休闲车及零配件制造 */
    C3780("C3780"),
    /** 非公路休闲车及零配件制造 */
    C3781("C3781"),
    /** 潜水救捞及其他未列明运输设备制造 */
    C3790("C3790"),
    /** 潜水装备制造 */
    C3791("C3791"),
    /** 水下救捞装备制造 */
    C3792("C3792"),
    /** 其他未列明运输设备制造 */
    C3799("C3799"),
    /** 电气机械和器材制造业 */
    C3800("C3800"),
    /** 电机制造 */
    C3810("C3810"),
    /** 发电机及发电机组制造 */
    C3811("C3811"),
    /** 电动机制造 */
    C3812("C3812"),
    /** 微特电机及组件制造 */
    C3813("C3813"),
    /** 其他电机制造 */
    C3819("C3819"),
    /** 输配电及控制设备制造 */
    C3820("C3820"),
    /** 变压器、整流器和电感器制造 */
    C3821("C3821"),
    /** 电容器及其配套设备制造 */
    C3822("C3822"),
    /** 配电开关控制设备制造 */
    C3823("C3823"),
    /** 电力电子元器件制造 */
    C3824("C3824"),
    /** 光伏设备及元器件制造 */
    C3825("C3825"),
    /** 其他输配电及控制设备制造 */
    C3829("C3829"),
    /** 电线、电缆、光缆及电工器材制造 */
    C3830("C3830"),
    /** 电线、电缆制造 */
    C3831("C3831"),
    /** 光纤制造 */
    C3832("C3832"),
    /** 光缆制造 */
    C3833("C3833"),
    /** 绝缘制品制造 */
    C3834("C3834"),
    /** 其他电工器材制造 */
    C3839("C3839"),
    /** 电池制造 */
    C3840("C3840"),
    /** 锂离子电池制造 */
    C3841("C3841"),
    /** 镍氢电池制造 */
    C3842("C3842"),
    /** 铅蓄电池制造 */
    C3843("C3843"),
    /** 锌锰电池制造 */
    C3844("C3844"),
    /** 其他电池制造 */
    C3849("C3849"),
    /** 家用电力器具制造 */
    C3850("C3850"),
    /** 家用制冷电器具制造 */
    C3851("C3851"),
    /** 家用空气调节器制造 */
    C3852("C3852"),
    /** 家用通风电器具制造 */
    C3853("C3853"),
    /** 家用厨房电器具制造 */
    C3854("C3854"),
    /** 家用清洁卫生电器具制造 */
    C3855("C3855"),
    /** 家用美容、保健护理电器具制造 */
    C3856("C3856"),
    /** 家用电力器具专用配件制造 */
    C3857("C3857"),
    /** 其他家用电力器具制造 */
    C3859("C3859"),
    /** 非电力家用器具制造 */
    C3860("C3860"),
    /** 燃气及类似能源家用器具制造 */
    C3861("C3861"),
    /** 太阳能器具制造 */
    C3862("C3862"),
    /** 其他非电力家用器具制造 */
    C3869("C3869"),
    /** 照明器具制造 */
    C3870("C3870"),
    /** 电光源制造 */
    C3871("C3871"),
    /** 照明灯具制造 */
    C3872("C3872"),
    /** 舞台及场地用灯制造 */
    C3873("C3873"),
    /** 智能照明器具制造 */
    C3874("C3874"),
    /** 灯用电器附件及其他照明器具制造 */
    C3879("C3879"),
    /** 其他电气机械及器材制造 */
    C3890("C3890"),
    /** 电气信号设备装置制造 */
    C3891("C3891"),
    /** 其他未列明电气机械及器材制造 */
    C3899("C3899"),
    /** 计算机、通信和其他电子设备制造业 */
    C3900("C3900"),
    /** 计算机制造 */
    C3910("C3910"),
    /** 计算机整机制造 */
    C3911("C3911"),
    /** 计算机零部件制造 */
    C3912("C3912"),
    /** 计算机外围设备制造 */
    C3913("C3913"),
    /** 工业控制计算机及系统制造 */
    C3914("C3914"),
    /** 信息安全设备制造 */
    C3915("C3915"),
    /** 其他计算机制造 */
    C3919("C3919"),
    /** 通信设备制造 */
    C3920("C3920"),
    /** 通信系统设备制造 */
    C3921("C3921"),
    /** 通信终端设备制造 */
    C3922("C3922"),
    /** 广播电视设备制造 */
    C3930("C3930"),
    /** 广播电视节目制作及发射设备制造 */
    C3931("C3931"),
    /** 广播电视接收设备制造 */
    C3932("C3932"),
    /** 广播电视专用配件制造 */
    C3933("C3933"),
    /** 专业音响设备制造 */
    C3934("C3934"),
    /** 应用电视设备及其他广播电视设备制造 */
    C3939("C3939"),
    /** 雷达及配套设备制造 */
    C3940("C3940"),
    /** 雷达及配套设备制造 */
    C3941("C3941"),
    /** 非专业视听设备制造 */
    C3950("C3950"),
    /** 电视机制造 */
    C3951("C3951"),
    /** 音响设备制造 */
    C3952("C3952"),
    /** 影视录放设备制造 */
    C3953("C3953"),
    /** 智能消费设备制造 */
    C3960("C3960"),
    /** 可穿戴智能设备制造 */
    C3961("C3961"),
    /** 智能车载设备制造 */
    C3962("C3962"),
    /** 智能无人飞行器制造 */
    C3963("C3963"),
    /** 服务消费机器人制造 */
    C3964("C3964"),
    /** 其他智能消费设备制造 */
    C3969("C3969"),
    /** 电子器件制造 */
    C3970("C3970"),
    /** 电子真空器件制造 */
    C3971("C3971"),
    /** 半导体分立器件制造 */
    C3972("C3972"),
    /** 集成电路制造 */
    C3973("C3973"),
    /** 显示器件制造 */
    C3974("C3974"),
    /** 半导体照明器件制造 */
    C3975("C3975"),
    /** 光电子器件制造 */
    C3976("C3976"),
    /** 其他电子器件制造 */
    C3979("C3979"),
    /** 电子元件及电子专用材料制造 */
    C3980("C3980"),
    /** 电阻电容电感元件制造 */
    C3981("C3981"),
    /** 电子电路制造 */
    C3982("C3982"),
    /** 敏感元件及传感器制造 */
    C3983("C3983"),
    /** 电声器件及零件制造 */
    C3984("C3984"),
    /** 电子专用材料制造 */
    C3985("C3985"),
    /** 其他电子元件制造 */
    C3989("C3989"),
    /** 其他电子设备制造 */
    C3990("C3990"),
    /** 其他电子设备制造 */
    C3991("C3991"),
    /** 仪器仪表制造业 */
    C4000("C4000"),
    /** 通用仪器仪表制造 */
    C4010("C4010"),
    /** 工业自动控制系统装置制造 */
    C4011("C4011"),
    /** 电工仪器仪表制造 */
    C4012("C4012"),
    /** 绘图、计算及测量仪器制造 */
    C4013("C4013"),
    /** 实验分析仪器制造 */
    C4014("C4014"),
    /** 试验机制造 */
    C4015("C4015"),
    /** 供应用仪器仪表制造 */
    C4016("C4016"),
    /** 其他通用仪器制造 */
    C4019("C4019"),
    /** 专用仪器仪表制造 */
    C4020("C4020"),
    /** 环境监测专用仪器仪表制造 */
    C4021("C4021"),
    /** 运输设备及生产用计数仪表制造 */
    C4022("C4022"),
    /** 导航、测绘、气象及海洋专用仪器制造 */
    C4023("C4023"),
    /** 农林牧渔专用仪器仪表制造 */
    C4024("C4024"),
    /** 地质勘探和地震专用仪器制造 */
    C4025("C4025"),
    /** 教学专用仪器制造 */
    C4026("C4026"),
    /** 核子及核辐射测量仪器制造 */
    C4027("C4027"),
    /** 电子测量仪器制造 */
    C4028("C4028"),
    /** 其他专用仪器制造 */
    C4029("C4029"),
    /** 钟表与计时仪器制造 */
    C4030("C4030"),
    /** 钟表与计时仪器制造 */
    C4031("C4031"),
    /** 光学仪器制造 */
    C4040("C4040"),
    /** 光学仪器制造 */
    C4041("C4041"),
    /** 衡器制造 */
    C4050("C4050"),
    /** 衡器制造 */
    C4051("C4051"),
    /** 其他仪器仪表制造业 */
    C4090("C4090"),
    /** 其他仪器仪表制造业 */
    C4091("C4091"),
    /** 其他制造业 */
    C4100("C4100"),
    /** 日用杂品制造 */
    C4110("C4110"),
    /** 鬃毛加工、制刷及清扫工具制造 */
    C4111("C4111"),
    /** 其他日用杂品制造 */
    C4119("C4119"),
    /** 核辐射加工 */
    C4120("C4120"),
    /** 核辐射加工 */
    C4121("C4121"),
    /** 其他未列明制造业 */
    C4190("C4190"),
    /** 其他未列明制造业 */
    C4191("C4191"),
    /** 废弃资源综合利用业 */
    C4200("C4200"),
    /** 金属废料和碎屑加工处理 */
    C4210("C4210"),
    /** 金属废料和碎屑加工处理 */
    C4211("C4211"),
    /** 非金属废料和碎屑加工处理 */
    C4220("C4220"),
    /** 非金属废料和碎屑加工处理 */
    C4221("C4221"),
    /** 金属制品、机械和设备修理业 */
    C4300("C4300"),
    /** 金属制品修理 */
    C4310("C4310"),
    /** 金属制品修理 */
    C4311("C4311"),
    /** 通用设备修理 */
    C4320("C4320"),
    /** 通用设备修理 */
    C4321("C4321"),
    /** 专用设备修理 */
    C4330("C4330"),
    /** 专用设备修理 */
    C4331("C4331"),
    /** 铁路、船舶、航空航天等运输设备修理 */
    C4340("C4340"),
    /** 铁路运输设备修理 */
    C4341("C4341"),
    /** 船舶修理 */
    C4342("C4342"),
    /** 航空航天器修理 */
    C4343("C4343"),
    /** 其他运输设备修理 */
    C4349("C4349"),
    /** 电气设备修理 */
    C4350("C4350"),
    /** 电气设备修理 */
    C4351("C4351"),
    /** 仪器仪表修理 */
    C4360("C4360"),
    /** 仪器仪表修理 */
    C4361("C4361"),
    /** 其他机械和设备修理业 */
    C4390("C4390"),
    /** 其他机械和设备修理业 */
    C4391("C4391"),
    /** 电力、热力、燃气及水生产和供应业 */
    D("D"),
    /** 电力、热力生产和供应业 */
    D4400("D4400"),
    /** 电力生产 */
    D4410("D4410"),
    /** 火力发电 */
    D4411("D4411"),
    /** 热电联产 */
    D4412("D4412"),
    /** 水力发电 */
    D4413("D4413"),
    /** 核力发电 */
    D4414("D4414"),
    /** 风力发电 */
    D4415("D4415"),
    /** 太阳能发电 */
    D4416("D4416"),
    /** 生物质能发电 */
    D4417("D4417"),
    /** 其他电力生产 */
    D4419("D4419"),
    /** 电力供应 */
    D4420("D4420"),
    /** 电力供应 */
    D4421("D4421"),
    /** 热力生产和供应 */
    D4430("D4430"),
    /** 热力生产和供应 */
    D4431("D4431"),
    /** 燃气生产和供应业 */
    D4500("D4500"),
    /** 燃气生产和供应业 */
    D4510("D4510"),
    /** 天然气生产和供应业 */
    D4511("D4511"),
    /** 液化石油气生产和供应业 */
    D4512("D4512"),
    /** 煤气生产和供应业 */
    D4513("D4513"),
    /** 生物质燃气生产和供应业 */
    D4520("D4520"),
    /** 生物质燃气生产和供应业 */
    D4521("D4521"),
    /** 水的生产和供应业 */
    D4600("D4600"),
    /** 自来水生产和供应 */
    D4610("D4610"),
    /** 自来水生产和供应 */
    D4611("D4611"),
    /** 污水处理及其再生利用 */
    D4620("D4620"),
    /** 污水处理及其再生利用 */
    D4621("D4621"),
    /** 海水淡化处理 */
    D4630("D4630"),
    /** 海水淡化处理 */
    D4631("D4631"),
    /** 其他水的处理、利用与分配 */
    D4690("D4690"),
    /** 其他水的处理、利用与分配 */
    D4691("D4691"),
    /** 建筑业 */
    E("E"),
    /** 房屋建筑业 */
    E4700("E4700"),
    /** 住宅房屋建筑 */
    E4710("E4710"),
    /** 住宅房屋建筑 */
    E4711("E4711"),
    /** 体育场馆建筑 */
    E4720("E4720"),
    /** 体育场馆建筑 */
    E4721("E4721"),
    /** 其他房屋建筑业 */
    E4790("E4790"),
    /** 其他房屋建筑业 */
    E4791("E4791"),
    /** 土木工程建筑业 */
    E4800("E4800"),
    /** 铁路、道路、隧道和桥梁工程建筑 */
    E4810("E4810"),
    /** 铁路工程建筑 */
    E4811("E4811"),
    /** 公路工程建筑 */
    E4812("E4812"),
    /** 市政道路工程建筑 */
    E4813("E4813"),
    /** 城市轨道交通工程建筑 */
    E4814("E4814"),
    /** 其他道路、隧道和桥梁工程建筑 */
    E4819("E4819"),
    /** 水利和水运工程建筑 */
    E4820("E4820"),
    /** 水源及供水设施工程建筑 */
    E4821("E4821"),
    /** 河湖治理及防洪设施工程建筑 */
    E4822("E4822"),
    /** 港口及航运设施工程建筑 */
    E4823("E4823"),
    /** 海洋工程建筑 */
    E4830("E4830"),
    /** 海洋油气资源开发利用工程建筑 */
    E4831("E4831"),
    /** 海洋能源开发利用工程建筑 */
    E4832("E4832"),
    /** 海底隧道工程建筑 */
    E4833("E4833"),
    /** 海底设施铺设工程建筑 */
    E4834("E4834"),
    /** 其他海洋工程建筑 */
    E4839("E4839"),
    /** 工矿工程建筑 */
    E4840("E4840"),
    /** 工矿工程建筑 */
    E4841("E4841"),
    /** 架线和管道工程建筑 */
    E4850("E4850"),
    /** 架线及设备工程建筑 */
    E4851("E4851"),
    /** 管道工程建筑 */
    E4852("E4852"),
    /** 地下综合管廊工程建筑 */
    E4853("E4853"),
    /** 节能环保工程施工 */
    E4860("E4860"),
    /** 节能工程施工 */
    E4861("E4861"),
    /** 环保工程施工 */
    E4862("E4862"),
    /** 生态保护工程施工 */
    E4863("E4863"),
    /** 电力工程施工 */
    E4870("E4870"),
    /** 火力发电工程施工 */
    E4871("E4871"),
    /** 水力发电工程施工 */
    E4872("E4872"),
    /** 核电工程施工 */
    E4873("E4873"),
    /** 风能发电工程施工 */
    E4874("E4874"),
    /** 太阳能发电工程施工 */
    E4875("E4875"),
    /** 其他电力工程施工 */
    E4879("E4879"),
    /** 其他土木工程建筑 */
    E4890("E4890"),
    /** 园林绿化工程施工 */
    E4891("E4891"),
    /** 体育场地设施工程施工 */
    E4892("E4892"),
    /** 游乐设施工程施工 */
    E4893("E4893"),
    /** 其他土木工程建筑施工 */
    E4899("E4899"),
    /** 建筑安装业 */
    E4900("E4900"),
    /** 电气安装 */
    E4910("E4910"),
    /** 电气安装 */
    E4911("E4911"),
    /** 管道和设备安装 */
    E4920("E4920"),
    /** 管道和设备安装 */
    E4921("E4921"),
    /** 其他建筑安装业 */
    E4990("E4990"),
    /** 体育场地设施安装 */
    E4991("E4991"),
    /** 其他建筑安装 */
    E4999("E4999"),
    /** 建筑装饰、装修和其他建筑业 */
    E5000("E5000"),
    /** 建筑装饰和装修业 */
    E5010("E5010"),
    /** 公共建筑装饰和装修 */
    E5011("E5011"),
    /** 住宅装饰和装修 */
    E5012("E5012"),
    /** 建筑幕墙装饰和装修 */
    E5013("E5013"),
    /** 建筑物拆除和场地准备活动 */
    E5020("E5020"),
    /** 建筑物拆除活动 */
    E5021("E5021"),
    /** 场地准备活动 */
    E5022("E5022"),
    /** 提供施工设备服务 */
    E5030("E5030"),
    /** 提供施工设备服务 */
    E5031("E5031"),
    /** 其他未列明建筑业 */
    E5090("E5090"),
    /** 其他未列明建筑业 */
    E5091("E5091"),
    /** 批发和零售业 */
    F("F"),
    /** 批发业 */
    F5100("F5100"),
    /** 农、林、牧、渔产品批发 */
    F5110("F5110"),
    /** 谷物、豆及薯类批发 */
    F5111("F5111"),
    /** 种子批发 */
    F5112("F5112"),
    /** 畜牧渔业饲料批发 */
    F5113("F5113"),
    /** 棉、麻批发 */
    F5114("F5114"),
    /** 林业产品批发 */
    F5115("F5115"),
    /** 牲畜批发 */
    F5116("F5116"),
    /** 渔业产品批发 */
    F5117("F5117"),
    /** 其他农牧产品批发 */
    F5119("F5119"),
    /** 食品、饮料及烟草制品批发 */
    F5120("F5120"),
    /** 米、面制品及食用油批发 */
    F5121("F5121"),
    /** 糕点、糖果及糖批发 */
    F5122("F5122"),
    /** 果品、蔬菜批发 */
    F5123("F5123"),
    /** 肉、禽、蛋、奶及水产品批发 */
    F5124("F5124"),
    /** 盐及调味品批发 */
    F5125("F5125"),
    /** 营养和保健品批发 */
    F5126("F5126"),
    /** 酒、饮料及茶叶批发 */
    F5127("F5127"),
    /** 烟草制品批发 */
    F5128("F5128"),
    /** 其他食品批发 */
    F5129("F5129"),
    /** 纺织、服装及家庭用品批发 */
    F5130("F5130"),
    /** 纺织品、针织品及原料批发 */
    F5131("F5131"),
    /** 服装批发 */
    F5132("F5132"),
    /** 鞋帽批发 */
    F5133("F5133"),
    /** 化妆品及卫生用品批发 */
    F5134("F5134"),
    /** 厨具卫具及日用杂品批发 */
    F5135("F5135"),
    /** 灯具、装饰物品批发 */
    F5136("F5136"),
    /** 家用视听设备批发 */
    F5137("F5137"),
    /** 日用家电批发 */
    F5138("F5138"),
    /** 其他家庭用品批发 */
    F5139("F5139"),
    /** 文化、体育用品及器材批发 */
    F5140("F5140"),
    /** 文具用品批发 */
    F5141("F5141"),
    /** 体育用品及器材批发 */
    F5142("F5142"),
    /** 图书批发 */
    F5143("F5143"),
    /** 报刊批发 */
    F5144("F5144"),
    /** 音像制品、电子和数字出版物批发 */
    F5145("F5145"),
    /** 首饰、工艺品及收藏品批发 */
    F5146("F5146"),
    /** 乐器批发 */
    F5147("F5147"),
    /** 其他文化用品批发 */
    F5149("F5149"),
    /** 医药及医疗器材批发 */
    F5150("F5150"),
    /** 西药批发 */
    F5151("F5151"),
    /** 中药批发 */
    F5152("F5152"),
    /** 动物用药品批发 */
    F5153("F5153"),
    /** 医疗用品及器材批发 */
    F5154("F5154"),
    /** 矿产品、建材及化工产品批发 */
    F5160("F5160"),
    /** 煤炭及制品批发 */
    F5161("F5161"),
    /** 石油及制品批发 */
    F5162("F5162"),
    /** 非金属矿及制品批发 */
    F5163("F5163"),
    /** 金属及金属矿批发 */
    F5164("F5164"),
    /** 建材批发 */
    F5165("F5165"),
    /** 化肥批发 */
    F5166("F5166"),
    /** 农药批发 */
    F5167("F5167"),
    /** 农用薄膜批发 */
    F5168("F5168"),
    /** 其他化工产品批发 */
    F5169("F5169"),
    /** 机械设备、五金产品及电子产品批发 */
    F5170("F5170"),
    /** 农业机械批发 */
    F5171("F5171"),
    /** 汽车及零配件批发 */
    F5172("F5172"),
    /** 摩托车及零配件批发 */
    F5173("F5173"),
    /** 五金产品批发 */
    F5174("F5174"),
    /** 电气设备批发 */
    F5175("F5175"),
    /** 计算机、软件及辅助设备批发 */
    F5176("F5176"),
    /** 通讯设备批发 */
    F5177("F5177"),
    /** 广播影视设备批发 */
    F5178("F5178"),
    /** 其他机械设备及电子产品批发 */
    F5179("F5179"),
    /** 贸易经纪与代理 */
    F5180("F5180"),
    /** 贸易代理 */
    F5181("F5181"),
    /** 一般物品拍卖 */
    F5182("F5182"),
    /** 艺术品、收藏品拍卖 */
    F5183("F5183"),
    /** 艺术品代理 */
    F5184("F5184"),
    /** 其他贸易经纪与代理 */
    F5189("F5189"),
    /** 其他批发业 */
    F5190("F5190"),
    /** 再生物资回收与批发 */
    F5191("F5191"),
    /** 宠物食品用品批发 */
    F5192("F5192"),
    /** 互联网批发 */
    F5193("F5193"),
    /** 其他未列明批发业 */
    F5199("F5199"),
    /** 零售业 */
    F5200("F5200"),
    /** 综合零售 */
    F5210("F5210"),
    /** 百货零售 */
    F5211("F5211"),
    /** 超级市场零售 */
    F5212("F5212"),
    /** 便利店零售 */
    F5213("F5213"),
    /** 其他综合零售 */
    F5219("F5219"),
    /** 食品、饮料及烟草制品专门零售 */
    F5220("F5220"),
    /** 粮油零售 */
    F5221("F5221"),
    /** 糕点、面包零售 */
    F5222("F5222"),
    /** 果品、蔬菜零售 */
    F5223("F5223"),
    /** 肉、禽、蛋、奶及水产品零售 */
    F5224("F5224"),
    /** 营养和保健品零售 */
    F5225("F5225"),
    /** 酒、饮料及茶叶零售 */
    F5226("F5226"),
    /** 烟草制品零售 */
    F5227("F5227"),
    /** 其他食品零售 */
    F5229("F5229"),
    /** 纺织、服装及日用品专门零售 */
    F5230("F5230"),
    /** 纺织品及针织品零售 */
    F5231("F5231"),
    /** 服装零售 */
    F5232("F5232"),
    /** 鞋帽零售 */
    F5233("F5233"),
    /** 化妆品及卫生用品零售 */
    F5234("F5234"),
    /** 厨具卫具及日用杂品零售 */
    F5235("F5235"),
    /** 钟表、眼镜零售 */
    F5236("F5236"),
    /** 箱包零售 */
    F5237("F5237"),
    /** 自行车等代步设备零售 */
    F5238("F5238"),
    /** 其他日用品零售 */
    F5239("F5239"),
    /** 文化、体育用品及器材专门零售 */
    F5240("F5240"),
    /** 文具用品零售 */
    F5241("F5241"),
    /** 体育用品及器材零售 */
    F5242("F5242"),
    /** 图书、报刊零售 */
    F5243("F5243"),
    /** 音像制品、电子和数字出版物零售 */
    F5244("F5244"),
    /** 珠宝首饰零售 */
    F5245("F5245"),
    /** 工艺美术品及收藏品零售 */
    F5246("F5246"),
    /** 乐器零售 */
    F5247("F5247"),
    /** 照相器材零售 */
    F5248("F5248"),
    /** 其他文化用品零售 */
    F5249("F5249"),
    /** 医药及医疗器材专门零售 */
    F5250("F5250"),
    /** 西药零售 */
    F5251("F5251"),
    /** 中药零售 */
    F5252("F5252"),
    /** 动物用药品零售 */
    F5253("F5253"),
    /** 医疗用品及器材零售 */
    F5254("F5254"),
    /** 保健辅助治疗器材零售 */
    F5255("F5255"),
    /** 汽车、摩托车、零配件和燃料及其他动力销售 */
    F5260("F5260"),
    /** 汽车新车零售 */
    F5261("F5261"),
    /** 汽车旧车零售 */
    F5262("F5262"),
    /** 汽车零配件零售 */
    F5263("F5263"),
    /** 摩托车及零配件零售 */
    F5264("F5264"),
    /** 机动车燃油零售 */
    F5265("F5265"),
    /** 机动车燃气零售 */
    F5266("F5266"),
    /** 机动车充电销售 */
    F5267("F5267"),
    /** 家用电器及电子产品专门零售 */
    F5270("F5270"),
    /** 家用视听设备零售 */
    F5271("F5271"),
    /** 日用家电零售 */
    F5272("F5272"),
    /** 计算机、软件及辅助设备零售 */
    F5273("F5273"),
    /** 通信设备零售 */
    F5274("F5274"),
    /** 其他电子产品零售 */
    F5279("F5279"),
    /** 五金、家具及室内装饰材料专门零售 */
    F5280("F5280"),
    /** 五金零售 */
    F5281("F5281"),
    /** 灯具零售 */
    F5282("F5282"),
    /** 家具零售 */
    F5283("F5283"),
    /** 涂料零售 */
    F5284("F5284"),
    /** 卫生洁具零售 */
    F5285("F5285"),
    /** 木质装饰材料零售 */
    F5286("F5286"),
    /** 陶瓷、石材装饰材料零售 */
    F5287("F5287"),
    /** 其他室内装饰材料零售 */
    F5289("F5289"),
    /** 货摊、无店铺及其他零售业 */
    F5290("F5290"),
    /** 流动货摊零售 */
    F5291("F5291"),
    /** 互联网零售 */
    F5292("F5292"),
    /** 邮购及电视、电话零售 */
    F5293("F5293"),
    /** 自动售货机零售 */
    F5294("F5294"),
    /** 旧货零售 */
    F5295("F5295"),
    /** 生活用燃料零售 */
    F5296("F5296"),
    /** 宠物食品用品零售 */
    F5297("F5297"),
    /** 其他未列明零售业 */
    F5299("F5299"),
    /** 交通运输、仓储和邮政业 */
    G("G"),
    /** 铁路运输业 */
    G5300("G5300"),
    /** 铁路旅客运输 */
    G5310("G5310"),
    /** 高速铁路旅客运输 */
    G5311("G5311"),
    /** 城际铁路旅客运输 */
    G5312("G5312"),
    /** 普通铁路旅客运输 */
    G5313("G5313"),
    /** 铁路货物运输 */
    G5320("G5320"),
    /** 铁路货物运输 */
    G5321("G5321"),
    /** 铁路运输辅助活动 */
    G5330("G5330"),
    /** 客运火车站 */
    G5331("G5331"),
    /** 货运火车站（场） */
    G5332("G5332"),
    /** 铁路运输维护活动 */
    G5333("G5333"),
    /** 其他铁路运输辅助活动 */
    G5339("G5339"),
    /** 道路运输业 */
    G5400("G5400"),
    /** 城市公共交通运输 */
    G5410("G5410"),
    /** 公共电汽车客运 */
    G5411("G5411"),
    /** 城市轨道交通 */
    G5412("G5412"),
    /** 出租车客运 */
    G5413("G5413"),
    /** 公共自行车服务 */
    G5414("G5414"),
    /** 其他城市公共交通运输 */
    G5419("G5419"),
    /** 公路旅客运输 */
    G5420("G5420"),
    /** 长途客运 */
    G5421("G5421"),
    /** 旅游客运 */
    G5422("G5422"),
    /** 其他公路客运 */
    G5429("G5429"),
    /** 道路货物运输 */
    G5430("G5430"),
    /** 普通货物道路运输 */
    G5431("G5431"),
    /** 冷藏车道路运输 */
    G5432("G5432"),
    /** 集装箱道路运输 */
    G5433("G5433"),
    /** 大型货物道路运输 */
    G5434("G5434"),
    /** 危险货物道路运输 */
    G5435("G5435"),
    /** 邮件包裹道路运输 */
    G5436("G5436"),
    /** 城市配送 */
    G5437("G5437"),
    /** 搬家运输 */
    G5438("G5438"),
    /** 其他道路货物运输 */
    G5439("G5439"),
    /** 道路运输辅助活动 */
    G5440("G5440"),
    /** 客运汽车站 */
    G5441("G5441"),
    /** 货运枢纽（站） */
    G5442("G5442"),
    /** 公路管理与养护 */
    G5443("G5443"),
    /** 其他道路运输辅助活动 */
    G5449("G5449"),
    /** 水上运输业 */
    G5500("G5500"),
    /** 水上旅客运输 */
    G5510("G5510"),
    /** 海上旅客运输 */
    G5511("G5511"),
    /** 内河旅客运输 */
    G5512("G5512"),
    /** 客运轮渡运输 */
    G5513("G5513"),
    /** 水上货物运输 */
    G5520("G5520"),
    /** 远洋货物运输 */
    G5521("G5521"),
    /** 沿海货物运输 */
    G5522("G5522"),
    /** 内河货物运输 */
    G5523("G5523"),
    /** 水上运输辅助活动 */
    G5530("G5530"),
    /** 客运港口 */
    G5531("G5531"),
    /** 货运港口 */
    G5532("G5532"),
    /** 其他水上运输辅助活动 */
    G5539("G5539"),
    /** 航空运输业 */
    G5600("G5600"),
    /** 航空客货运输 */
    G5610("G5610"),
    /** 航空旅客运输 */
    G5611("G5611"),
    /** 航空货物运输 */
    G5612("G5612"),
    /** 通用航空服务 */
    G5620("G5620"),
    /** 通用航空生产服务 */
    G5621("G5621"),
    /** 观光游览航空服务 */
    G5622("G5622"),
    /** 体育航空运动服务 */
    G5623("G5623"),
    /** 其他通用航空服务 */
    G5629("G5629"),
    /** 航空运输辅助活动 */
    G5630("G5630"),
    /** 机场 */
    G5631("G5631"),
    /** 空中交通管理 */
    G5632("G5632"),
    /** 其他航空运输辅助活动 */
    G5639("G5639"),
    /** 管道运输业 */
    G5700("G5700"),
    /** 海底管道运输 */
    G5710("G5710"),
    /** 海底管道运输 */
    G5711("G5711"),
    /** 陆地管道运输 */
    G5720("G5720"),
    /** 陆地管道运输 */
    G5721("G5721"),
    /** 多式联运和运输代理业 */
    G5800("G5800"),
    /** 多式联运 */
    G5810("G5810"),
    /** 多式联运 */
    G5811("G5811"),
    /** 运输代理业 */
    G5820("G5820"),
    /** 货物运输代理 */
    G5821("G5821"),
    /** 旅客票务代理 */
    G5822("G5822"),
    /** 其他运输代理业 */
    G5829("G5829"),
    /** 装卸搬运和仓储业 */
    G5900("G5900"),
    /** 装卸搬运 */
    G5910("G5910"),
    /** 装卸搬运 */
    G5911("G5911"),
    /** 通用仓储 */
    G5920("G5920"),
    /** 通用仓储 */
    G5921("G5921"),
    /** 低温仓储 */
    G5930("G5930"),
    /** 低温仓储 */
    G5931("G5931"),
    /** 危险品仓储 */
    G5940("G5940"),
    /** 油气仓储 */
    G5941("G5941"),
    /** 危险化学品仓储 */
    G5942("G5942"),
    /** 其他危险品仓储 */
    G5949("G5949"),
    /** 谷物、棉花等农产品仓储 */
    G5950("G5950"),
    /** 谷物仓储 */
    G5951("G5951"),
    /** 棉花仓储 */
    G5952("G5952"),
    /** 其他农产品仓储 */
    G5959("G5959"),
    /** 中药材仓储 */
    G5960("G5960"),
    /** 中药材仓储 */
    G5961("G5961"),
    /** 其他仓储业 */
    G5990("G5990"),
    /** 其他仓储业 */
    G5991("G5991"),
    /** 邮政业 */
    G6000("G6000"),
    /** 邮政基本服务 */
    G6010("G6010"),
    /** 邮政基本服务 */
    G6011("G6011"),
    /** 快递服务 */
    G6020("G6020"),
    /** 快递服务 */
    G6021("G6021"),
    /** 其他寄递服务 */
    G6090("G6090"),
    /** 其他寄递服务 */
    G6091("G6091"),
    /** 住宿和餐饮业 */
    H("H"),
    /** 住宿业 */
    H6100("H6100"),
    /** 旅游饭店 */
    H6110("H6110"),
    /** 旅游饭店 */
    H6111("H6111"),
    /** 一般旅馆 */
    H6120("H6120"),
    /** 经济型连锁酒店 */
    H6121("H6121"),
    /** 其他一般旅馆 */
    H6129("H6129"),
    /** 民宿服务 */
    H6130("H6130"),
    /** 民宿服务 */
    H6131("H6131"),
    /** 露营地服务 */
    H6140("H6140"),
    /** 露营地服务 */
    H6141("H6141"),
    /** 其他住宿业 */
    H6190("H6190"),
    /** 其他住宿业 */
    H6191("H6191"),
    /** 餐饮业 */
    H6200("H6200"),
    /** 正餐服务 */
    H6210("H6210"),
    /** 正餐服务 */
    H6211("H6211"),
    /** 快餐服务 */
    H6220("H6220"),
    /** 快餐服务 */
    H6221("H6221"),
    /** 饮料及冷饮服务 */
    H6230("H6230"),
    /** 茶馆服务 */
    H6231("H6231"),
    /** 咖啡馆服务 */
    H6232("H6232"),
    /** 酒吧服务 */
    H6233("H6233"),
    /** 其他饮料及冷饮服务 */
    H6239("H6239"),
    /** 餐饮配送及外卖送餐服务 */
    H6240("H6240"),
    /** 餐饮配送服务 */
    H6241("H6241"),
    /** 外卖送餐服务 */
    H6242("H6242"),
    /** 其他餐饮业 */
    H6290("H6290"),
    /** 小吃服务 */
    H6291("H6291"),
    /** 其他未列明餐饮业 */
    H6299("H6299"),
    /** 信息传输、软件和信息技术服务业 */
    I("I"),
    /** 电信、广播电视和卫星传输服务 */
    I6300("I6300"),
    /** 电信 */
    I6310("I6310"),
    /** 固定电信服务 */
    I6311("I6311"),
    /** 移动电信服务 */
    I6312("I6312"),
    /** 其他电信服务 */
    I6319("I6319"),
    /** 广播电视传输服务 */
    I6320("I6320"),
    /** 有线广播电视传输服务 */
    I6321("I6321"),
    /** 无线广播电视传输服务 */
    I6322("I6322"),
    /** 卫星传输服务 */
    I6330("I6330"),
    /** 广播电视卫星传输服务 */
    I6331("I6331"),
    /** 其他卫星传输服务 */
    I6339("I6339"),
    /** 互联网和相关服务 */
    I6400("I6400"),
    /** 互联网接入及相关服务 */
    I6410("I6410"),
    /** 互联网接入及相关服务 */
    I6411("I6411"),
    /** 互联网信息服务 */
    I6420("I6420"),
    /** 互联网搜索服务 */
    I6421("I6421"),
    /** 互联网游戏服务 */
    I6422("I6422"),
    /** 互联网其他信息服务 */
    I6429("I6429"),
    /** 互联网平台 */
    I6430("I6430"),
    /** 互联网生产服务平台 */
    I6431("I6431"),
    /** 互联网生活服务平台 */
    I6432("I6432"),
    /** 互联网科技创新平台 */
    I6433("I6433"),
    /** 互联网公共服务平台 */
    I6434("I6434"),
    /** 其他互联网平台 */
    I6439("I6439"),
    /** 互联网安全服务 */
    I6440("I6440"),
    /** 互联网安全服务 */
    I6441("I6441"),
    /** 互联网数据服务 */
    I6450("I6450"),
    /** 互联网数据服务 */
    I6451("I6451"),
    /** 其他互联网服务 */
    I6490("I6490"),
    /** 其他互联网服务 */
    I6491("I6491"),
    /** 软件和信息技术服务业 */
    I6500("I6500"),
    /** 软件开发 */
    I6510("I6510"),
    /** 基础软件开发 */
    I6511("I6511"),
    /** 支撑软件开发 */
    I6512("I6512"),
    /** 应用软件开发 */
    I6513("I6513"),
    /** 其他软件开发 */
    I6519("I6519"),
    /** 集成电路设计 */
    I6520("I6520"),
    /** 集成电路设计 */
    I6521("I6521"),
    /** 信息系统集成和物联网技术服务 */
    I6530("I6530"),
    /** 信息系统集成服务 */
    I6531("I6531"),
    /** 物联网技术服务 */
    I6532("I6532"),
    /** 运行维护服务 */
    I6540("I6540"),
    /** 运行维护服务 */
    I6541("I6541"),
    /** 信息处理和存储支持服务 */
    I6550("I6550"),
    /** 信息处理和存储支持服务 */
    I6551("I6551"),
    /** 信息技术咨询服务 */
    I6560("I6560"),
    /** 信息技术咨询服务 */
    I6561("I6561"),
    /** 数字内容服务 */
    I6570("I6570"),
    /** 地理遥感信息服务 */
    I6571("I6571"),
    /** 动漫、游戏数字内容服务 */
    I6572("I6572"),
    /** 其他数字内容服务 */
    I6579("I6579"),
    /** 其他信息技术服务业 */
    I6590("I6590"),
    /** 呼叫中心 */
    I6591("I6591"),
    /** 其他未列明信息技术服务业 */
    I6599("I6599"),
    /** 金融业 */
    J("J"),
    /** 货币金融服务 */
    J6600("J6600"),
    /** 中央银行服务 */
    J6610("J6610"),
    /** 中央银行服务 */
    J6611("J6611"),
    /** 货币银行服务 */
    J6620("J6620"),
    /** 商业银行服务 */
    J6621("J6621"),
    /** 政策性银行服务 */
    J6622("J6622"),
    /** 信用合作社服务 */
    J6623("J6623"),
    /** 农村资金互助社服务 */
    J6624("J6624"),
    /** 其他货币银行服务 */
    J6629("J6629"),
    /** 非货币银行服务 */
    J6630("J6630"),
    /** 融资租赁服务 */
    J6631("J6631"),
    /** 财务公司服务 */
    J6632("J6632"),
    /** 典当 */
    J6633("J6633"),
    /** 汽车金融公司服务 */
    J6634("J6634"),
    /** 小额贷款公司服务 */
    J6635("J6635"),
    /** 消费金融公司服务 */
    J6636("J6636"),
    /** 网络借贷服务 */
    J6637("J6637"),
    /** 其他非货币银行服务 */
    J6639("J6639"),
    /** 银行理财服务 */
    J6640("J6640"),
    /** 银行理财服务 */
    J6641("J6641"),
    /** 银行监管服务 */
    J6650("J6650"),
    /** 银行监管服务 */
    J6651("J6651"),
    /** 资本市场服务 */
    J6700("J6700"),
    /** 证券市场服务 */
    J6710("J6710"),
    /** 证券市场管理服务 */
    J6711("J6711"),
    /** 证券经纪交易服务 */
    J6712("J6712"),
    /** 公开募集证券投资基金 */
    J6720("J6720"),
    /** 公开募集证券投资基金 */
    J6721("J6721"),
    /** 非公开募集证券投资基金 */
    J6730("J6730"),
    /** 创业投资基金 */
    J6731("J6731"),
    /** 天使投资 */
    J6732("J6732"),
    /** 其他非公开募集证券投资基金 */
    J6739("J6739"),
    /** 期货市场服务 */
    J6740("J6740"),
    /** 期货市场管理服务 */
    J6741("J6741"),
    /** 其他期货市场服务 */
    J6749("J6749"),
    /** 证券期货监管服务 */
    J6750("J6750"),
    /** 证券期货监管服务 */
    J6751("J6751"),
    /** 资本投资服务 */
    J6760("J6760"),
    /** 资本投资服务 */
    J6761("J6761"),
    /** 其他资本市场服务 */
    J6790("J6790"),
    /** 其他资本市场服务 */
    J6791("J6791"),
    /** 保险业 */
    J6800("J6800"),
    /** 人身保险 */
    J6810("J6810"),
    /** 人寿保险 */
    J6811("J6811"),
    /** 年金保险 */
    J6812("J6812"),
    /** 健康保险 */
    J6813("J6813"),
    /** 意外伤害保险 */
    J6814("J6814"),
    /** 财产保险 */
    J6820("J6820"),
    /** 财产保险 */
    J6821("J6821"),
    /** 再保险 */
    J6830("J6830"),
    /** 再保险 */
    J6831("J6831"),
    /** 商业养老金 */
    J6840("J6840"),
    /** 商业养老金 */
    J6841("J6841"),
    /** 保险中介服务 */
    J6850("J6850"),
    /** 保险经纪服务 */
    J6851("J6851"),
    /** 保险代理服务 */
    J6852("J6852"),
    /** 保险公估服务 */
    J6853("J6853"),
    /** 保险资产管理 */
    J6860("J6860"),
    /** 保险资产管理 */
    J6861("J6861"),
    /** 保险监管服务 */
    J6870("J6870"),
    /** 保险监管服务 */
    J6871("J6871"),
    /** 其他保险活动 */
    J6890("J6890"),
    /** 其他保险活动 */
    J6891("J6891"),
    /** 其他金融业 */
    J6900("J6900"),
    /** 金融信托与管理服务 */
    J6910("J6910"),
    /** 信托公司 */
    J6911("J6911"),
    /** 其他金融信托与管理服务 */
    J6919("J6919"),
    /** 控股公司服务 */
    J6920("J6920"),
    /** 控股公司服务 */
    J6921("J6921"),
    /** 非金融机构支付服务 */
    J6930("J6930"),
    /** 非金融机构支付服务 */
    J6931("J6931"),
    /** 金融信息服务 */
    J6940("J6940"),
    /** 金融信息服务 */
    J6941("J6941"),
    /** 金融资产管理公司 */
    J6950("J6950"),
    /** 金融资产管理公司 */
    J6951("J6951"),
    /** 其他未列明金融业 */
    J6990("J6990"),
    /** 货币经纪公司服务 */
    J6991("J6991"),
    /** 其他未包括金融业 */
    J6999("J6999"),
    /** 房地产业 */
    K("K"),
    /** 房地产业 */
    K7000("K7000"),
    /** 房地产开发经营 */
    K7010("K7010"),
    /** 房地产开发经营 */
    K7011("K7011"),
    /** 物业管理 */
    K7020("K7020"),
    /** 物业管理 */
    K7021("K7021"),
    /** 房地产中介服务 */
    K7030("K7030"),
    /** 房地产中介服务 */
    K7031("K7031"),
    /** 房地产租赁经营 */
    K7040("K7040"),
    /** 房地产租赁经营 */
    K7041("K7041"),
    /** 其他房地产业 */
    K7090("K7090"),
    /** 其他房地产业 */
    K7091("K7091"),
    /** 租赁和商务服务业 */
    L("L"),
    /** 租赁业 */
    L7100("L7100"),
    /** 机械设备经营租赁 */
    L7110("L7110"),
    /** 汽车租赁 */
    L7111("L7111"),
    /** 农业机械经营租赁 */
    L7112("L7112"),
    /** 建筑工程机械与设备经营租赁 */
    L7113("L7113"),
    /** 计算机及通讯设备经营租赁 */
    L7114("L7114"),
    /** 医疗设备经营租赁 */
    L7115("L7115"),
    /** 其他机械与设备经营租赁 */
    L7119("L7119"),
    /** 文体设备和用品出租 */
    L7120("L7120"),
    /** 休闲娱乐用品设备出租 */
    L7121("L7121"),
    /** 体育用品设备出租 */
    L7122("L7122"),
    /** 文化用品设备出租 */
    L7123("L7123"),
    /** 图书出租 */
    L7124("L7124"),
    /** 音像制品出租 */
    L7125("L7125"),
    /** 其他文体设备和用品出租 */
    L7129("L7129"),
    /** 日用品出租 */
    L7130("L7130"),
    /** 日用品出租 */
    L7131("L7131"),
    /** 商务服务业 */
    L7200("L7200"),
    /** 组织管理服务 */
    L7210("L7210"),
    /** 企业总部管理 */
    L7211("L7211"),
    /** 投资与资产管理 */
    L7212("L7212"),
    /** 资源与产权交易服务 */
    L7213("L7213"),
    /** 单位后勤管理服务 */
    L7214("L7214"),
    /** 农村集体经济组织管理 */
    L7215("L7215"),
    /** 其他组织管理服务 */
    L7219("L7219"),
    /** 综合管理服务 */
    L7220("L7220"),
    /** 园区管理服务 */
    L7221("L7221"),
    /** 商业综合体管理服务 */
    L7222("L7222"),
    /** 市场管理服务 */
    L7223("L7223"),
    /** 供应链管理服务 */
    L7224("L7224"),
    /** 其他综合管理服务 */
    L7229("L7229"),
    /** 法律服务 */
    L7230("L7230"),
    /** 律师及相关法律服务 */
    L7231("L7231"),
    /** 公证服务 */
    L7232("L7232"),
    /** 其他法律服务 */
    L7239("L7239"),
    /** 咨询与调查 */
    L7240("L7240"),
    /** 会计、审计及税务服务 */
    L7241("L7241"),
    /** 市场调查 */
    L7242("L7242"),
    /** 社会经济咨询 */
    L7243("L7243"),
    /** 健康咨询 */
    L7244("L7244"),
    /** 环保咨询 */
    L7245("L7245"),
    /** 体育咨询 */
    L7246("L7246"),
    /** 其他专业咨询与调查 */
    L7249("L7249"),
    /** 广告业 */
    L7250("L7250"),
    /** 互联网广告服务 */
    L7251("L7251"),
    /** 其他广告服务 */
    L7259("L7259"),
    /** 人力资源服务 */
    L7260("L7260"),
    /** 公共就业服务 */
    L7261("L7261"),
    /** 职业中介服务 */
    L7262("L7262"),
    /** 劳务派遣服务 */
    L7263("L7263"),
    /** 创业指导服务 */
    L7264("L7264"),
    /** 其他人力资源服务 */
    L7269("L7269"),
    /** 安全保护服务 */
    L7270("L7270"),
    /** 安全服务 */
    L7271("L7271"),
    /** 安全系统监控服务 */
    L7272("L7272"),
    /** 其他安全保护服务 */
    L7279("L7279"),
    /** 会议、展览及相关服务 */
    L7280("L7280"),
    /** 科技会展服务 */
    L7281("L7281"),
    /** 旅游会展服务 */
    L7282("L7282"),
    /** 体育会展服务 */
    L7283("L7283"),
    /** 文化会展服务 */
    L7284("L7284"),
    /** 其他会议、会展及相关服务 */
    L7289("L7289"),
    /** 其他商务服务业 */
    L7290("L7290"),
    /** 旅行社及相关服务 */
    L7291("L7291"),
    /** 包装服务 */
    L7292("L7292"),
    /** 办公服务 */
    L7293("L7293"),
    /** 翻译服务 */
    L7294("L7294"),
    /** 信用服务 */
    L7295("L7295"),
    /** 非融资担保服务 */
    L7296("L7296"),
    /** 商务代理代办服务 */
    L7297("L7297"),
    /** 票务代理服务 */
    L7298("L7298"),
    /** 其他未列明商务服务业 */
    L7299("L7299"),
    /** 科学研究和技术服务业 */
    M("M"),
    /** 研究和试验发展 */
    M7300("M7300"),
    /** 自然科学研究和试验发展 */
    M7310("M7310"),
    /** 自然科学研究和试验发展 */
    M7311("M7311"),
    /** 工程和技术研究和试验发展 */
    M7320("M7320"),
    /** 工程和技术研究和试验发展 */
    M7321("M7321"),
    /** 农业科学研究和试验发展 */
    M7330("M7330"),
    /** 农业科学研究和试验发展 */
    M7331("M7331"),
    /** 医学研究和试验发展 */
    M7340("M7340"),
    /** 医学研究和试验发展 */
    M7341("M7341"),
    /** 社会人文科学研究 */
    M7350("M7350"),
    /** 社会人文科学研究 */
    M7351("M7351"),
    /** 专业技术服务业 */
    M7400("M7400"),
    /** 气象服务 */
    M7410("M7410"),
    /** 气象服务 */
    M7411("M7411"),
    /** 地震服务 */
    M7420("M7420"),
    /** 地震服务 */
    M7421("M7421"),
    /** 海洋服务 */
    M7430("M7430"),
    /** 海洋气象服务 */
    M7431("M7431"),
    /** 海洋环境服务 */
    M7432("M7432"),
    /** 其他海洋服务 */
    M7439("M7439"),
    /** 测绘地理信息服务 */
    M7440("M7440"),
    /** 遥感测绘服务 */
    M7441("M7441"),
    /** 其他测绘地理信息服务 */
    M7449("M7449"),
    /** 质检技术服务 */
    M7450("M7450"),
    /** 检验检疫服务 */
    M7451("M7451"),
    /** 检测服务 */
    M7452("M7452"),
    /** 计量服务 */
    M7453("M7453"),
    /** 标准化服务 */
    M7454("M7454"),
    /** 认证认可服务 */
    M7455("M7455"),
    /** 其他质检技术服务 */
    M7459("M7459"),
    /** 环境与生态监测检测服务 */
    M7460("M7460"),
    /** 环境保护监测 */
    M7461("M7461"),
    /** 生态资源监测 */
    M7462("M7462"),
    /** 野生动物疫源疫病防控监测 */
    M7463("M7463"),
    /** 地质勘查 */
    M7470("M7470"),
    /** 能源矿产地质勘查 */
    M7471("M7471"),
    /** 固体矿产地质勘查 */
    M7472("M7472"),
    /** 水、二氧化碳等矿产地质勘查 */
    M7473("M7473"),
    /** 基础地质勘查 */
    M7474("M7474"),
    /** 地质勘查技术服务 */
    M7475("M7475"),
    /** 工程技术与设计服务 */
    M7480("M7480"),
    /** 工程管理服务 */
    M7481("M7481"),
    /** 工程监理服务 */
    M7482("M7482"),
    /** 工程勘察活动 */
    M7483("M7483"),
    /** 工程设计活动 */
    M7484("M7484"),
    /** 规划设计管理 */
    M7485("M7485"),
    /** 土地规划服务 */
    M7486("M7486"),
    /** 工业与专业设计及其他专业技术服务 */
    M7490("M7490"),
    /** 工业设计服务 */
    M7491("M7491"),
    /** 专业设计服务 */
    M7492("M7492"),
    /** 兽医服务 */
    M7493("M7493"),
    /** 其他未列明专业技术服务业 */
    M7499("M7499"),
    /** 科技推广和应用服务业 */
    M7500("M7500"),
    /** 技术推广服务 */
    M7510("M7510"),
    /** 农林牧渔技术推广服务 */
    M7511("M7511"),
    /** 生物技术推广服务 */
    M7512("M7512"),
    /** 新材料技术推广服务 */
    M7513("M7513"),
    /** 节能技术推广服务 */
    M7514("M7514"),
    /** 新能源技术推广服务 */
    M7515("M7515"),
    /** 环保技术推广服务 */
    M7516("M7516"),
    /** 三维（3D)打印技术推广服务 */
    M7517("M7517"),
    /** 其他技术推广服务 */
    M7519("M7519"),
    /** 知识产权服务 */
    M7520("M7520"),
    /** 知识产权服务 */
    M7521("M7521"),
    /** 科技中介服务 */
    M7530("M7530"),
    /** 科技中介服务 */
    M7531("M7531"),
    /** 创业空间服务 */
    M7540("M7540"),
    /** 创业空间服务 */
    M7541("M7541"),
    /** 其他科技推广服务业 */
    M7590("M7590"),
    /** 其他科技推广服务业 */
    M7591("M7591"),
    /** 水利、环境和公共设施管理业 */
    N("N"),
    /** 水利管理业 */
    N7600("N7600"),
    /** 防洪除涝设施管理 */
    N7610("N7610"),
    /** 防洪除涝设施管理 */
    N7611("N7611"),
    /** 水资源管理 */
    N7620("N7620"),
    /** 水资源管理 */
    N7621("N7621"),
    /** 天然水收集与分配 */
    N7630("N7630"),
    /** 天然水收集与分配 */
    N7631("N7631"),
    /** 水文服务 */
    N7640("N7640"),
    /** 水文服务 */
    N7641("N7641"),
    /** 其他水利管理业 */
    N7690("N7690"),
    /** 其他水利管理业 */
    N7691("N7691"),
    /** 生态保护和环境治理业 */
    N7700("N7700"),
    /** 生态保护 */
    N7710("N7710"),
    /** 自然生态系统保护管理 */
    N7711("N7711"),
    /** 自然遗迹保护管理 */
    N7712("N7712"),
    /** 野生动物保护 */
    N7713("N7713"),
    /** 野生植物保护 */
    N7714("N7714"),
    /** 动物园、水族馆管理服务 */
    N7715("N7715"),
    /** 植物园管理服务 */
    N7716("N7716"),
    /** 其他自然保护 */
    N7719("N7719"),
    /** 环境治理业 */
    N7720("N7720"),
    /** 水污染治理 */
    N7721("N7721"),
    /** 大气污染治理 */
    N7722("N7722"),
    /** 固体废物治理 */
    N7723("N7723"),
    /** 危险废物治理 */
    N7724("N7724"),
    /** 放射性废物治理 */
    N7725("N7725"),
    /** 土壤污染治理与修复服务 */
    N7726("N7726"),
    /** 噪声与振动控制服务 */
    N7727("N7727"),
    /** 其他污染治理 */
    N7729("N7729"),
    /** 公共设施管理业 */
    N7800("N7800"),
    /** 市政设施管理 */
    N7810("N7810"),
    /** 市政设施管理 */
    N7811("N7811"),
    /** 环境卫生管理 */
    N7820("N7820"),
    /** 环境卫生管理 */
    N7821("N7821"),
    /** 城乡市容管理 */
    N7830("N7830"),
    /** 城乡市容管理 */
    N7831("N7831"),
    /** 绿化管理 */
    N7840("N7840"),
    /** 绿化管理 */
    N7841("N7841"),
    /** 城市公园管理 */
    N7850("N7850"),
    /** 城市公园管理 */
    N7851("N7851"),
    /** 游览景区管理 */
    N7860("N7860"),
    /** 名胜风景区管理 */
    N7861("N7861"),
    /** 森林公园管理 */
    N7862("N7862"),
    /** 其他游览景区管理 */
    N7869("N7869"),
    /** 土地管理业 */
    N7900("N7900"),
    /** 土地整治服务 */
    N7910("N7910"),
    /** 土地整治服务 */
    N7911("N7911"),
    /** 土地调查评估服务 */
    N7920("N7920"),
    /** 土地调查评估服务 */
    N7921("N7921"),
    /** 土地登记服务 */
    N7930("N7930"),
    /** 土地登记服务 */
    N7931("N7931"),
    /** 土地登记代理服务 */
    N7940("N7940"),
    /** 土地登记代理服务 */
    N7941("N7941"),
    /** 其他土地管理服务 */
    N7990("N7990"),
    /** 其他土地管理服务 */
    N7991("N7991"),
    /** 居民服务、修理和其他服务业 */
    O("O"),
    /** 居民服务业 */
    O8000("O8000"),
    /** 家庭服务 */
    O8010("O8010"),
    /** 家庭服务 */
    O8011("O8011"),
    /** 托儿所服务 */
    O8020("O8020"),
    /** 托儿所服务 */
    O8021("O8021"),
    /** 洗染服务 */
    O8030("O8030"),
    /** 洗染服务 */
    O8031("O8031"),
    /** 理发及美容服务 */
    O8040("O8040"),
    /** 理发及美容服务 */
    O8041("O8041"),
    /** 洗浴和保健养生服务 */
    O8050("O8050"),
    /** 洗浴服务 */
    O8051("O8051"),
    /** 足浴服务 */
    O8052("O8052"),
    /** 养生保健服务 */
    O8053("O8053"),
    /** 摄影扩印服务 */
    O8060("O8060"),
    /** 摄影扩印服务 */
    O8061("O8061"),
    /** 婚姻服务 */
    O8070("O8070"),
    /** 婚姻服务 */
    O8071("O8071"),
    /** 殡葬服务 */
    O8080("O8080"),
    /** 殡葬服务 */
    O8081("O8081"),
    /** 其他居民服务业 */
    O8090("O8090"),
    /** 其他居民服务业 */
    O8091("O8091"),
    /** 机动车、电子产品和日用产品修理业 */
    O8100("O8100"),
    /** 汽车、摩托车等修理与维护 */
    O8110("O8110"),
    /** 汽车修理与维护 */
    O8111("O8111"),
    /** 大型车辆装备修理与维护 */
    O8112("O8112"),
    /** 摩托车修理与维护 */
    O8113("O8113"),
    /** 助动车等修理与维护 */
    O8114("O8114"),
    /** 计算机和办公设备维修 */
    O8120("O8120"),
    /** 计算机和辅助设备修理 */
    O8121("O8121"),
    /** 通讯设备修理 */
    O8122("O8122"),
    /** 其他办公设备维修 */
    O8129("O8129"),
    /** 家用电器修理 */
    O8130("O8130"),
    /** 家用电子产品修理 */
    O8131("O8131"),
    /** 日用电器修理 */
    O8132("O8132"),
    /** 其他日用产品修理业 */
    O8190("O8190"),
    /** 自行车修理 */
    O8191("O8191"),
    /** 鞋和皮革修理 */
    O8192("O8192"),
    /** 家具和相关物品修理 */
    O8193("O8193"),
    /** 其他未列明日用产品修理业 */
    O8199("O8199"),
    /** 其他服务业 */
    O8200("O8200"),
    /** 清洁服务 */
    O8210("O8210"),
    /** 建筑物清洁服务 */
    O8211("O8211"),
    /** 其他清洁服务 */
    O8219("O8219"),
    /** 宠物服务 */
    O8220("O8220"),
    /** 宠物饲养 */
    O8221("O8221"),
    /** 宠物医院服务 */
    O8222("O8222"),
    /** 宠物美容服务 */
    O8223("O8223"),
    /** 宠物寄托收养服务 */
    O8224("O8224"),
    /** 其他宠物服务 */
    O8229("O8229"),
    /** 其他未列明服务业 */
    O8290("O8290"),
    /** 其他未列明服务业 */
    O8291("O8291"),
    /** 教育 */
    P("P"),
    /** 教育 */
    P8300("P8300"),
    /** 学前教育 */
    P8310("P8310"),
    /** 学前教育 */
    P8311("P8311"),
    /** 初等教育 */
    P8320("P8320"),
    /** 普通小学教育 */
    P8321("P8321"),
    /** 成人小学教育 */
    P8322("P8322"),
    /** 中等教育 */
    P8330("P8330"),
    /** 普通初中教育 */
    P8331("P8331"),
    /** 职业初中教育 */
    P8332("P8332"),
    /** 成人初中教育 */
    P8333("P8333"),
    /** 普通高中教育 */
    P8334("P8334"),
    /** 成人高中教育 */
    P8335("P8335"),
    /** 中等职业学校教育 */
    P8336("P8336"),
    /** 高等教育 */
    P8340("P8340"),
    /** 普通高等教育 */
    P8341("P8341"),
    /** 成人高等教育 */
    P8342("P8342"),
    /** 特殊教育 */
    P8350("P8350"),
    /** 特殊教育 */
    P8351("P8351"),
    /** 技能培训、教育辅助及其他教育 */
    P8390("P8390"),
    /** 职业技能培训 */
    P8391("P8391"),
    /** 体校及体育培训 */
    P8392("P8392"),
    /** 文化艺术培训 */
    P8393("P8393"),
    /** 教育辅助服务 */
    P8394("P8394"),
    /** 其他未列明教育 */
    P8399("P8399"),
    /** 卫生和社会工作 */
    Q("Q"),
    /** 卫生 */
    Q8400("Q8400"),
    /** 医院 */
    Q8410("Q8410"),
    /** 综合医院 */
    Q8411("Q8411"),
    /** 中医医院 */
    Q8412("Q8412"),
    /** 中西医结合医院 */
    Q8413("Q8413"),
    /** 民族医院 */
    Q8414("Q8414"),
    /** 专科医院 */
    Q8415("Q8415"),
    /** 疗养院 */
    Q8416("Q8416"),
    /** 基层医疗卫生服务 */
    Q8420("Q8420"),
    /** 社区卫生服务中心（站） */
    Q8421("Q8421"),
    /** 街道卫生院 */
    Q8422("Q8422"),
    /** 乡镇卫生院 */
    Q8423("Q8423"),
    /** 村卫生室 */
    Q8424("Q8424"),
    /** 门诊部（所） */
    Q8425("Q8425"),
    /** 专业公共卫生服务 */
    Q8430("Q8430"),
    /** 疾病预防控制中心 */
    Q8431("Q8431"),
    /** 专科疾病防治院（所、站） */
    Q8432("Q8432"),
    /** 妇幼保健院（所、站） */
    Q8433("Q8433"),
    /** 急救中心（站）服务 */
    Q8434("Q8434"),
    /** 采供血机构服务 */
    Q8435("Q8435"),
    /** 计划生育技术服务活动 */
    Q8436("Q8436"),
    /** 其他卫生活动 */
    Q8490("Q8490"),
    /** 健康体检服务 */
    Q8491("Q8491"),
    /** 临床检验服务 */
    Q8492("Q8492"),
    /** 其他未列明卫生服务 */
    Q8499("Q8499"),
    /** 社会工作 */
    Q8500("Q8500"),
    /** 提供住宿社会工作 */
    Q8510("Q8510"),
    /** 干部休养所 */
    Q8511("Q8511"),
    /** 护理机构服务 */
    Q8512("Q8512"),
    /** 精神康复服务 */
    Q8513("Q8513"),
    /** 老年人、残疾人养护服务 */
    Q8514("Q8514"),
    /** 临终关怀服务 */
    Q8515("Q8515"),
    /** 孤残儿童收养和庇护服务 */
    Q8516("Q8516"),
    /** 其他提供住宿社会救助 */
    Q8519("Q8519"),
    /** 不提供住宿社会工作 */
    Q8520("Q8520"),
    /** 社会看护与帮助服务 */
    Q8521("Q8521"),
    /** 康复辅具适配服务 */
    Q8522("Q8522"),
    /** 其他不提供住宿社会工作 */
    Q8529("Q8529"),
    /** 文化、体育和娱乐业 */
    R("R"),
    /** 新闻和出版业 */
    R8600("R8600"),
    /** 新闻业 */
    R8610("R8610"),
    /** 新闻业 */
    R8611("R8611"),
    /** 出版业 */
    R8620("R8620"),
    /** 图书出版 */
    R8621("R8621"),
    /** 报纸出版 */
    R8622("R8622"),
    /** 期刊出版 */
    R8623("R8623"),
    /** 音像制品出版 */
    R8624("R8624"),
    /** 电子出版物出版 */
    R8625("R8625"),
    /** 数字出版 */
    R8626("R8626"),
    /** 其他出版业 */
    R8629("R8629"),
    /** 广播、电视、电影和录音制作业 */
    R8700("R8700"),
    /** 广播 */
    R8710("R8710"),
    /** 广播 */
    R8711("R8711"),
    /** 电视 */
    R8720("R8720"),
    /** 电视 */
    R8721("R8721"),
    /** 影视节目制作 */
    R8730("R8730"),
    /** 影视节目制作 */
    R8731("R8731"),
    /** 广播电视集成播控 */
    R8740("R8740"),
    /** 广播电视集成播控 */
    R8741("R8741"),
    /** 电影和广播电视节目发行 */
    R8750("R8750"),
    /** 电影和广播电视节目发行 */
    R8751("R8751"),
    /** 电影放映 */
    R8760("R8760"),
    /** 电影放映 */
    R8761("R8761"),
    /** 录音制作 */
    R8770("R8770"),
    /** 录音制作 */
    R8771("R8771"),
    /** 文化艺术业 */
    R8800("R8800"),
    /** 文艺创作与表演 */
    R8810("R8810"),
    /** 文艺创作与表演 */
    R8811("R8811"),
    /** 艺术表演场馆 */
    R8820("R8820"),
    /** 艺术表演场馆 */
    R8821("R8821"),
    /** 图书馆与档案馆 */
    R8830("R8830"),
    /** 图书馆 */
    R8831("R8831"),
    /** 档案馆 */
    R8832("R8832"),
    /** 文物及非物质文化遗产保护 */
    R8840("R8840"),
    /** 文物及非物质文化遗产保护 */
    R8841("R8841"),
    /** 博物馆 */
    R8850("R8850"),
    /** 博物馆 */
    R8851("R8851"),
    /** 烈士陵园、纪念馆 */
    R8860("R8860"),
    /** 烈士陵园、纪念馆 */
    R8861("R8861"),
    /** 群众文体活动 */
    R8870("R8870"),
    /** 群众文体活动 */
    R8871("R8871"),
    /** 其他文化艺术业 */
    R8890("R8890"),
    /** 其他文化艺术业 */
    R8891("R8891"),
    /** 体育 */
    R8900("R8900"),
    /** 体育组织 */
    R8910("R8910"),
    /** 体育竞赛组织 */
    R8911("R8911"),
    /** 体育保障组织 */
    R8912("R8912"),
    /** 其他体育组织 */
    R8919("R8919"),
    /** 体育场地设施管理 */
    R8920("R8920"),
    /** 体育场馆管理 */
    R8921("R8921"),
    /** 其他体育场地设施管理 */
    R8929("R8929"),
    /** 健身休闲活动 */
    R8930("R8930"),
    /** 健身休闲活动 */
    R8931("R8931"),
    /** 其他体育 */
    R8990("R8990"),
    /** 体育中介代理服务 */
    R8991("R8991"),
    /** 体育健康服务 */
    R8992("R8992"),
    /** 其他未列明体育 */
    R8999("R8999"),
    /** 娱乐业 */
    R9000("R9000"),
    /** 室内娱乐活动 */
    R9010("R9010"),
    /** 歌舞厅娱乐活动 */
    R9011("R9011"),
    /** 电子游艺厅娱乐活动 */
    R9012("R9012"),
    /** 网吧活动 */
    R9013("R9013"),
    /** 其他室内娱乐活动 */
    R9019("R9019"),
    /** 游乐园 */
    R9020("R9020"),
    /** 游乐园 */
    R9021("R9021"),
    /** 休闲观光活动 */
    R9030("R9030"),
    /** 休闲观光活动 */
    R9031("R9031"),
    /** 彩票活动 */
    R9040("R9040"),
    /** 体育彩票服务 */
    R9041("R9041"),
    /** 福利彩票服务 */
    R9042("R9042"),
    /** 其他彩票服务 */
    R9049("R9049"),
    /** 文化体育娱乐活动与经纪代理服务 */
    R9050("R9050"),
    /** 文化活动服务 */
    R9051("R9051"),
    /** 体育表演服务 */
    R9052("R9052"),
    /** 文化娱乐经纪人 */
    R9053("R9053"),
    /** 体育经纪人 */
    R9054("R9054"),
    /** 其他文化艺术经纪代理 */
    R9059("R9059"),
    /** 其他娱乐业 */
    R9090("R9090"),
    /** 其他娱乐业 */
    R9091("R9091"),
    /** 公共管理、社会保障和社会组织 */
    S("S"),
    /** 中国共产党机关 */
    S9100("S9100"),
    /** 中国共产党机关 */
    S9101("S9101"),
    /** 中国共产党机关 */
    S9110("S9110"),
    /** 国家机构 */
    S9200("S9200"),
    /** 国家权力机构 */
    S9210("S9210"),
    /** 国家权力机构 */
    S9211("S9211"),
    /** 国家行政机构 */
    S9220("S9220"),
    /** 综合事务管理机构 */
    S9221("S9221"),
    /** 对外事务管理机构 */
    S9222("S9222"),
    /** 公共安全管理机构 */
    S9223("S9223"),
    /** 社会事务管理机构 */
    S9224("S9224"),
    /** 经济事务管理机构 */
    S9225("S9225"),
    /** 行政监督检查机构 */
    S9226("S9226"),
    /** 人民法院和人民检察院 */
    S9230("S9230"),
    /** 人民法院 */
    S9231("S9231"),
    /** 人民检察院 */
    S9232("S9232"),
    /** 其他国家机构 */
    S9290("S9290"),
    /** 消防管理机构 */
    S9291("S9291"),
    /** 其他未列明国家机构 */
    S9299("S9299"),
    /** 人民政协、民主党派 */
    S9300("S9300"),
    /** 人民政协 */
    S9310("S9310"),
    /** 人民政协 */
    S9311("S9311"),
    /** 民主党派 */
    S9320("S9320"),
    /** 民主党派 */
    S9321("S9321"),
    /** 社会保障 */
    S9400("S9400"),
    /** 基本保险 */
    S9410("S9410"),
    /** 基本养老保险 */
    S9411("S9411"),
    /** 基本医疗保险 */
    S9412("S9412"),
    /** 失业保险 */
    S9413("S9413"),
    /** 工伤保险 */
    S9414("S9414"),
    /** 生育保险 */
    S9415("S9415"),
    /** 其他基本保险 */
    S9419("S9419"),
    /** 补充保险 */
    S9420("S9420"),
    /** 补充保险 */
    S9421("S9421"),
    /** 其他社会保障 */
    S9490("S9490"),
    /** 其他社会保障 */
    S9491("S9491"),
    /** 群众团体、社会团体和其他成员组织 */
    S9500("S9500"),
    /** 群众团体 */
    S9510("S9510"),
    /** 工会 */
    S9511("S9511"),
    /** 妇联 */
    S9512("S9512"),
    /** 共青团 */
    S9513("S9513"),
    /** 其他群众团体 */
    S9519("S9519"),
    /** 社会团体 */
    S9520("S9520"),
    /** 专业性团体 */
    S9521("S9521"),
    /** 行业性团体 */
    S9522("S9522"),
    /** 其他社会团体 */
    S9529("S9529"),
    /** 基金会 */
    S9530("S9530"),
    /** 基金会 */
    S9531("S9531"),
    /** 宗教组织 */
    S9540("S9540"),
    /** 宗教团体服务 */
    S9541("S9541"),
    /** 宗教活动场所服务 */
    S9542("S9542"),
    /** 基层群众自治组织及其他组织 */
    S9600("S9600"),
    /** 社区居民自治组织 */
    S9610("S9610"),
    /** 社区居民自治组织 */
    S9611("S9611"),
    /** 村民自治组织 */
    S9620("S9620"),
    /** 村民自治组织 */
    S9621("S9621"),
    /** 国际组织 */
    T("T"),
    /** 国际组织 */
    T9700("T9700"),
    /** 国际组织 */
    T9701("T9701"),
    /** 国际组织 */
    T9710("T9710");

    private String value;

    private Industry(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static Industry byValue(String value) {
        for (Industry item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}