package com.dcits.blacklist.enums;

/** 职业 */
public enum OccupationCode {
    /** 康复辅具工程技术人员 */
    VALUE_20235("20235"),
    /** 轻工工程技术人员 */
    VALUE_20236("20236"),
    /** 土地整治工程技术人员 */
    VALUE_20237("20237"),
    /** 兵器工程技术人员 */
    VALUE_20290("20290"),
    /** 航天工程技术人员 */
    VALUE_20291("20291"),
    /** 其他工程技术人员 */
    VALUE_20299("20299"),
    /** 农业技术人员 */
    VALUE_20300("20300"),
    /** 土壤肥料技术人员 */
    VALUE_20301("20301"),
    /** 农业技术指导人员 */
    VALUE_20302("20302"),
    /** 植物保护技术人员 */
    VALUE_20303("20303"),
    /** 园艺技术人员 */
    VALUE_20304("20304"),
    /** 作物遗传育种栽培技术人员 */
    VALUE_20305("20305"),
    /** 兽医兽药技术人员 */
    VALUE_20306("20306"),
    /** 畜牧与草业技术人员 */
    VALUE_20307("20307"),
    /** 水产技术人员 */
    VALUE_20308("20308"),
    /** 农业工程技术人员 */
    VALUE_20309("20309"),
    /** 其他农业技术人员 */
    VALUE_20399("20399"),
    /** 飞机和船舶技术人员 */
    VALUE_20400("20400"),
    /** 飞行人员和领航人员 */
    VALUE_20401("20401"),
    /** 船舶指挥和引航人员 */
    VALUE_20402("20402"),
    /** 其他飞机和船舶技术人员 */
    VALUE_20499("20499"),
    /** 卫生专业技术人员 */
    VALUE_20500("20500"),
    /** 西医医师 */
    VALUE_20501("20501"),
    /** 中医医师 */
    VALUE_20502("20502"),
    /** 中西医结合医师 */
    VALUE_20503("20503"),
    /** 民族医医师 */
    VALUE_20504("20504"),
    /** 公共卫生与健康医师 */
    VALUE_20505("20505"),
    /** 药学技术人员 */
    VALUE_20506("20506"),
    /** 医疗卫生技术人员 */
    VALUE_20507("20507"),
    /** 护理人员 */
    VALUE_20508("20508"),
    /** 乡村医生 */
    VALUE_20509("20509"),
    /** 其他卫生专业技术人员 */
    VALUE_20599("20599"),
    /** 经济和金融专业人员 */
    VALUE_20600("20600"),
    /** 经济专业人员 */
    VALUE_20601("20601"),
    /** 统计专业人员 */
    VALUE_20602("20602"),
    /** 会计专业人员 */
    VALUE_20603("20603"),
    /** 审计专业人员 */
    VALUE_20604("20604"),
    /** 税务专业人员 */
    VALUE_20605("20605"),
    /** 评估专业人员 */
    VALUE_20606("20606"),
    /** 商务专业人员 */
    VALUE_20607("20607"),
    /** 人力资源专业人员 */
    VALUE_20608("20608"),
    /** 银行专业人员 */
    VALUE_20609("20609"),
    /** 保险专业人员 */
    VALUE_20610("20610"),
    /** 证券专业人员 */
    VALUE_20611("20611"),
    /** 知识产权专业人员 */
    VALUE_20612("20612"),
    /** 其他经济和金融专业人员 */
    VALUE_20699("20699"),
    /** 法律、社会和宗教专业人员 */
    VALUE_20700("20700"),
    /** 法官 */
    VALUE_20701("20701"),
    /** 检察官 */
    VALUE_20702("20702"),
    /** 律师 */
    VALUE_20703("20703"),
    /** 公证员 */
    VALUE_20704("20704"),
    /** 司法鉴定人员 */
    VALUE_20705("20705"),
    /** 审判辅助人员 */
    VALUE_20706("20706"),
    /** 法律顾问 */
    VALUE_20707("20707"),
    /** 宗教教职人员 */
    VALUE_20708("20708"),
    /** 社会工作专业人员 */
    VALUE_20709("20709"),
    /** 其他法律、社会和宗教专业人员 */
    VALUE_20799("20799"),
    /** 教学人员 */
    VALUE_20800("20800"),
    /** 高等教育教师 */
    VALUE_20801("20801"),
    /** 中等职业教育教师 */
    VALUE_20802("20802"),
    /** 中小学教育教师 */
    VALUE_20803("20803"),
    /** 幼儿教育教师 */
    VALUE_20804("20804"),
    /** 特殊教育教师 */
    VALUE_20805("20805"),
    /** 其他教学人员 */
    VALUE_20899("20899"),
    /** 文学艺术、体育专业人员 */
    VALUE_20900("20900"),
    /** 文艺创作与编导人员 */
    VALUE_20901("20901"),
    /** 音乐指挥与演员 */
    VALUE_20902("20902"),
    /** 电影电视制作专业人员 */
    VALUE_20903("20903"),
    /** 舞台专业人员 */
    VALUE_20904("20904"),
    /** 美术专业人员 */
    VALUE_20905("20905"),
    /** 工艺美术与创意设计专业人员 */
    VALUE_20906("20906"),
    /** 体育专业人员 */
    VALUE_20907("20907"),
    /** 其他文学艺术、体育专业人员 */
    VALUE_20999("20999"),
    /** 新闻出版、文化专业人员 */
    VALUE_21000("21000"),
    /** 记者 */
    VALUE_21001("21001"),
    /** 编辑 */
    VALUE_21002("21002"),
    /** 校对员 */
    VALUE_21003("21003"),
    /** 播音员及节目主持人 */
    VALUE_21004("21004"),
    /** 翻译人员 */
    VALUE_21005("21005"),
    /** 图书资料与微缩摄影专业人员 */
    VALUE_21006("21006"),
    /** 档案专业人员 */
    VALUE_21007("21007"),
    /** 考古及文物保护专业人员 */
    VALUE_21008("21008"),
    /** 其他新闻出版、文化专业人员 */
    VALUE_21099("21099"),
    /** 其他专业技术人员 */
    VALUE_29900("29900"),
    /** 办事人员和有关人员 */
    VALUE_30000("30000"),
    /** 办事人员 */
    VALUE_30100("30100"),
    /** 行政业务办理人员 */
    VALUE_30101("30101"),
    /** 行政事务处理人员 */
    VALUE_30102("30102"),
    /** 行政执法和仲裁人员 */
    VALUE_30103("30103"),
    /** 其他办事人员 */
    VALUE_30199("30199"),
    /** 安全和消防人员 */
    VALUE_30200("30200"),
    /** 人民警察 */
    VALUE_30201("30201"),
    /** 保卫人员 */
    VALUE_30202("30202"),
    /** 消防和应急救援人员 */
    VALUE_30203("30203"),
    /** 其他安全和消防人员 */
    VALUE_30299("30299"),
    /** 其他办事人员和有关人员 */
    VALUE_39900("39900"),
    /** 社会生产服务和生活服务人员 */
    VALUE_40000("40000"),
    /** 批发与零售服务人员 */
    VALUE_40100("40100"),
    /** 采购人员 */
    VALUE_40101("40101"),
    /** 商务咨询服务人员 */
    VALUE_40702("40702"),
    /** 人力资源服务人员 */
    VALUE_40703("40703"),
    /** 旅游及公共游览场所服务人员 */
    VALUE_40704("40704"),
    /** 安全保护服务人员 */
    VALUE_40705("40705"),
    /** 市场管理服务人员 */
    VALUE_40706("40706"),
    /** 会议及展览服务人员 */
    VALUE_40707("40707"),
    /** 其他租赁和商务服务人员 */
    VALUE_40799("40799"),
    /** 技术辅助服务人员 */
    VALUE_40800("40800"),
    /** 气象服务人员 */
    VALUE_40801("40801"),
    /** 海洋服务人员 */
    VALUE_40802("40802"),
    /** 测绘服务人员 */
    VALUE_40803("40803"),
    /** 地理信息服务人员 */
    VALUE_40804("40804"),
    /** 检验、检测和计量服务人员 */
    VALUE_40805("40805"),
    /** 环境监测服务人员 */
    VALUE_40806("40806"),
    /** 地质勘查人员 */
    VALUE_40807("40807"),
    /** 专业化设计服务人员 */
    VALUE_40808("40808"),
    /** 摄影扩印服务人员 */
    VALUE_40809("40809"),
    /** 其他技术辅助服务人员 */
    VALUE_40899("40899"),
    /** 水利、环境和公共设施管理服务人员 */
    VALUE_40900("40900"),
    /** 水利设施管养人员 */
    VALUE_40901("40901"),
    /** 水文服务人员 */
    VALUE_40902("40902"),
    /** 水土保持人员 */
    VALUE_40903("40903"),
    /** 农田灌排人员 */
    VALUE_40904("40904"),
    /** 自然保护区和草地监护人员 */
    VALUE_40905("40905"),
    /** 野生动植物保护人员 */
    VALUE_40906("40906"),
    /** 环境治理服务人员 */
    VALUE_40907("40907"),
    /** 环境卫生服务人员 */
    VALUE_40908("40908"),
    /** 有害生物防制人员 */
    VALUE_40909("40909"),
    /** 绿化与园艺服务人员 */
    VALUE_40910("40910"),
    /** 其他水利、环境和公共设施管理服务人员 */
    VALUE_40999("40999"),
    /** 居民服务人员 */
    VALUE_41000("41000"),
    /** 生活照料服务人员 */
    VALUE_41001("41001"),
    /** 服装裁剪和洗染织补人员 */
    VALUE_41002("41002"),
    /** 美容美发和浴池服务人员 */
    VALUE_41003("41003"),
    /** 保健服务人员 */
    VALUE_41004("41004"),
    /** 婚姻服务人员 */
    VALUE_41005("41005"),
    /** 殡葬服务人员 */
    VALUE_41006("41006"),
    /** 宠物服务人员 */
    VALUE_41007("41007"),
    /** 其他居民服务人员 */
    VALUE_41099("41099"),
    /** 电力、燃气及水供应服务人员 */
    VALUE_41100("41100"),
    /** 电力供应服务人员 */
    VALUE_41101("41101"),
    /** 燃气供应服务人员 */
    VALUE_41102("41102"),
    /** 水供应服务人员 */
    VALUE_41103("41103"),
    /** 其他电力、燃气及水供应服务人员 */
    VALUE_41199("41199"),
    /** 修理及制作服务人员 */
    VALUE_41200("41200"),
    /** 汽车摩托车修理技术服务人员 */
    VALUE_41201("41201"),
    /** 计算机和办公设备维修人员 */
    VALUE_41202("41202"),
    /** 家用电子电器产品维修人员 */
    VALUE_41203("41203"),
    /** 日用产品修理服务人员 */
    VALUE_41204("41204"),
    /** 乐器维修人员 */
    VALUE_41205("41205"),
    /** 印章制作人员 */
    VALUE_41206("41206"),
    /** 其他修理及制作服务人员 */
    VALUE_41299("41299"),
    /** 文化、体育和娱乐服务人员 */
    VALUE_41300("41300"),
    /** 群众文化活动服务人员 */
    VALUE_41301("41301"),
    /** 广播、电视、电影和影视录音制作人员 */
    VALUE_41302("41302"),
    /** 文物保护作业人员 */
    VALUE_41303("41303"),
    /** 健身和娱乐场所服务人员 */
    VALUE_41304("41304"),
    /** 文化、娱乐、体育经纪代理人员 */
    VALUE_41305("41305"),
    /** 其他文化、体育和娱乐服务人员 */
    VALUE_41399("41399"),
    /** 健康服务人员 */
    VALUE_41400("41400"),
    /** 医疗辅助服务人员 */
    VALUE_41401("41401"),
    /** 健康咨询服务人员 */
    VALUE_41402("41402"),
    /** 康复矫正服务人员 */
    VALUE_41403("41403"),
    /** 公共卫生辅助服务人员 */
    VALUE_41404("41404"),
    /** 其他健康服务人员 */
    VALUE_41499("41499"),
    /** 其他社会生产和生活服务人员 */
    VALUE_49900("49900"),
    /** 农、林、牧、渔业生产及辅助人员 */
    VALUE_50000("50000"),
    /** 农业生产人员 */
    VALUE_50100("50100"),
    /** 作物种子（苗）繁育生产人员 */
    VALUE_50101("50101"),
    /** 农作物生产人员 */
    VALUE_50102("50102"),
    /** 其他农业生产人员 */
    VALUE_50199("50199"),
    /** 林业生产人员 */
    VALUE_50200("50200"),
    /** 林木种苗繁育人员 */
    VALUE_50201("50201"),
    /** 营造林人员 */
    VALUE_50202("50202"),
    /** 森林经营和管护人员 */
    VALUE_50203("50203"),
    /** 木材采运人员 */
    VALUE_50204("50204"),
    /** 其他林业生产人员 */
    VALUE_50299("50299"),
    /** 畜牧业生产人员 */
    VALUE_50300("50300"),
    /** 畜禽种苗繁育人员 */
    VALUE_50301("50301"),
    /** 畜禽饲养人员 */
    VALUE_50302("50302"),
    /** 特种经济动物饲养人员 */
    VALUE_50303("50303"),
    /** 其他畜牧业生产人员 */
    VALUE_50399("50399"),
    /** 渔业生产人员 */
    VALUE_50400("50400"),
    /** 水产苗种繁育人员 */
    VALUE_50401("50401"),
    /** 水产养殖人员 */
    VALUE_50402("50402"),
    /** 水产捕捞及有关人员 */
    VALUE_50403("50403"),
    /** 其他渔业生产人员 */
    VALUE_50499("50499"),
    /** 农林牧渔生产辅助人员 */
    VALUE_50500("50500"),
    /** 农业生产服务人员 */
    VALUE_50501("50501"),
    /** 动植物疫病防治人员 */
    VALUE_50502("50502"),
    /** 农村能源利用人员 */
    VALUE_50503("50503"),
    /** 农村环境保护人员 */
    VALUE_50504("50504"),
    /** 农机化服务人员 */
    VALUE_50505("50505"),
    /** 农副林特产品初加工人员 */
    VALUE_50506("50506"),
    /** 其他农林牧渔生产辅助人员 */
    VALUE_50599("50599"),
    /** 其他农、林、牧、渔业生产及辅助人员 */
    VALUE_59900("59900"),
    /** 生产制造及有关人员 */
    VALUE_60000("60000"),
    /** 农副产品加工人员 */
    VALUE_60100("60100"),
    /** 粮油加工人员 */
    VALUE_60101("60101"),
    /** 饲料加工人员 */
    VALUE_60102("60102"),
    /** 制糖人员 */
    VALUE_60103("60103"),
    /** 畜禽制品加工人员 */
    VALUE_60104("60104"),
    /** 石油和天然气开采与储运人员 */
    VALUE_61602("61602"),
    /** 采盐人员 */
    VALUE_61603("61603"),
    /** 其他采矿人员 */
    VALUE_61699("61699"),
    /** 金属冶炼和压延加工人员 */
    VALUE_61700("61700"),
    /** 炼铁人员 */
    VALUE_61701("61701"),
    /** 炼钢人员 */
    VALUE_61702("61702"),
    /** 铸铁管人员 */
    VALUE_61703("61703"),
    /** 铁合金冶炼人员 */
    VALUE_61704("61704"),
    /** 重有色金属冶炼人员 */
    VALUE_61705("61705"),
    /** 轻有色金属冶炼人员 */
    VALUE_61706("61706"),
    /** 稀贵金属冶炼人员 */
    VALUE_61707("61707"),
    /** 半导体材料制备人员 */
    VALUE_61708("61708"),
    /** 金属轧制人员 */
    VALUE_61709("61709"),
    /** 硬质合金生产人员 */
    VALUE_61710("61710"),
    /** 其他金属冶炼和压延加工人员 */
    VALUE_61799("61799"),
    /** 机械制造基础加工人员 */
    VALUE_61800("61800"),
    /** 机械冷加工人员 */
    VALUE_61801("61801"),
    /** 机械热加工人员 */
    VALUE_61802("61802"),
    /** 机械表面处理加工人员 */
    VALUE_61803("61803"),
    /** 工装工具制造加工人员 */
    VALUE_61804("61804"),
    /** 其他机械制造基础加工人员 */
    VALUE_61899("61899"),
    /** 金属制品制造人员 */
    VALUE_61900("61900"),
    /** 五金制品制作装配人员 */
    VALUE_61901("61901"),
    /** 其他金属制品制造人员 */
    VALUE_61999("61999"),
    /** 通用设备制造人员 */
    VALUE_62000("62000"),
    /** 通用基础件装配制造人员 */
    VALUE_62001("62001"),
    /** 锅炉及原动设备制造人员 */
    VALUE_62002("62002"),
    /** 金属加工机械制造人员 */
    VALUE_62003("62003"),
    /** 物料搬运设备制造人员 */
    VALUE_62004("62004"),
    /** 泵、压缩机、阀门及类似机械制造人员 */
    VALUE_62005("62005"),
    /** 烘炉、水处理、衡器等设备制造人员 */
    VALUE_62006("62006"),
    /** 文化办公机械制造人员 */
    VALUE_62007("62007"),
    /** 其他通用设备制造人员 */
    VALUE_62099("62099"),
    /** 专用设备制造人员 */
    VALUE_62100("62100"),
    /** 采矿、建筑专用设备制造人员 */
    VALUE_62101("62101"),
    /** 印刷生产专用设备制造人员 */
    VALUE_62102("62102"),
    /** 纺织服装和皮革加工专用设备制造人员 */
    VALUE_62103("62103"),
    /** 电子专用设备装配调试人员 */
    VALUE_62104("62104"),
    /** 农业机械制造人员 */
    VALUE_62105("62105"),
    /** 医疗器械制品和康复辅具生产人员 */
    VALUE_62106("62106"),
    /** 其他专用设备生产制造人员 */
    VALUE_62199("62199"),
    /** 汽车制造人员 */
    VALUE_62200("62200"),
    /** 汽车零部件、饰件生产加工人员 */
    VALUE_62201("62201"),
    /** 汽车整车制造人员 */
    VALUE_62202("62202"),
    /** 其他汽车制造人员 */
    VALUE_62299("62299"),
    /** 铁路、船舶、航空设备制造人员 */
    VALUE_62300("62300"),
    /** 轨道交通运输设备制造人员 */
    VALUE_62301("62301"),
    /** 船舶制造人员 */
    VALUE_62302("62302"),
    /** 航空产品装配、调试人员 */
    VALUE_62303("62303"),
    /** 摩托车、自行车制造人员 */
    VALUE_62304("62304"),
    /** 其他铁路、船舶、航空设备制造人员 */
    VALUE_62399("62399"),
    /** 电气机械和器材制造人员 */
    VALUE_62400("62400"),
    /** 电机制造人员 */
    VALUE_62401("62401"),
    /** 输配电及控制设备制造人员 */
    VALUE_62402("62402"),
    /** 电线电缆、光纤光缆及电工器材制造人员 */
    VALUE_62403("62403"),
    /** 电池制造人员 */
    VALUE_62404("62404"),
    /** 家用电力器具制造人员 */
    VALUE_62405("62405"),
    /** 非电力家用器具制造人员 */
    VALUE_62406("62406"),
    /** 照明器具制造人员 */
    VALUE_62407("62407"),
    /** 电气信号设备装置制造人员 */
    VALUE_62408("62408"),
    /** 其他电气机械和器材制造人员 */
    VALUE_62499("62499"),
    /** 计算机、通信和其他电子设备制造人员 */
    VALUE_62500("62500"),
    /** 电子元件制造人员 */
    VALUE_62501("62501"),
    /** 电子器件制造人员 */
    VALUE_62502("62502"),
    /** 计算机制造人员 */
    VALUE_62503("62503"),
    /** 电子设备装配调试人员 */
    VALUE_62504("62504"),
    /** 其他计算机、通信和其他电子设备制造人员 */
    VALUE_62599("62599"),
    /** 仪器仪表制造人员 */
    VALUE_62600("62600"),
    /** 仪器仪表装配人员 */
    VALUE_62601("62601"),
    /** 其他仪器仪表制造人员 */
    VALUE_62699("62699"),
    /** 废弃资源综合利用人员 */
    VALUE_62700("62700"),
    /** 废料和碎屑加工处理人员 */
    VALUE_62701("62701"),
    /** 其他废弃资源综合利用人员 */
    VALUE_62799("62799"),
    /** 电力、热力、气体、水生产和输配人员 */
    VALUE_62800("62800"),
    /** 电力、热力生产和供应人员 */
    VALUE_62801("62801"),
    /** 气体生产、处理和输送人员 */
    VALUE_62802("62802"),
    /** 水生产、输排和水处理人员 */
    VALUE_62803("62803"),
    /** 其他电力、热力、气体、水生产和输配人员 */
    VALUE_62899("62899"),
    /** 建筑施工人员 */
    VALUE_62900("62900"),
    /** 房屋建筑施工人员 */
    VALUE_62901("62901"),
    /** 土木工程建筑施工人员 */
    VALUE_62902("62902"),
    /** 建筑安装施工人员 */
    VALUE_62903("62903"),
    /** 建筑装饰人员 */
    VALUE_62904("62904"),
    /** 古建筑修建人员 */
    VALUE_62905("62905"),
    /** 其他建筑施工人员 */
    VALUE_62999("62999"),
    /** 运输设备和通用工程机械操作人员及有关人员 */
    VALUE_63000("63000"),
    /** 专用车辆操作人员 */
    VALUE_63001("63001"),
    /** 轨道交通运输机械设备操作人员 */
    VALUE_63002("63002"),
    /** 民用航空设备操作及有关人员 */
    VALUE_63003("63003"),
    /** 水上运输设备操作及有关人员 */
    VALUE_63004("63004"),
    /** 通用工程机械操作人员 */
    VALUE_63005("63005"),
    /** 其他运输设备和通用工程机械操作人员及有关人员 */
    VALUE_63099("63099"),
    /** 生产辅助人员 */
    VALUE_63100("63100"),
    /** 机械设备修理人员 */
    VALUE_63101("63101"),
    /** 水产品加工人员 */
    VALUE_60105("60105"),
    /** 果蔬和坚果加工人员 */
    VALUE_60106("60106"),
    /** 淀粉和豆制品加工人员 */
    VALUE_60107("60107"),
    /** 其他农副产品加工人员 */
    VALUE_60199("60199"),
    /** 食品、饮料生产加工人员 */
    VALUE_60200("60200"),
    /** 焙烤食品制造人员 */
    VALUE_60201("60201"),
    /** 糖制品加工人员 */
    VALUE_60202("60202"),
    /** 方便食品和罐头食品加工人员 */
    VALUE_60203("60203"),
    /** 乳制品加工人员 */
    VALUE_60204("60204"),
    /** 调味品及食品添加剂制作人员 */
    VALUE_60205("60205"),
    /** 酒、饮料及精制茶制造人员 */
    VALUE_60206("60206"),
    /** 其他食品、饮料生产加工人员 */
    VALUE_60299("60299"),
    /** 烟草及其制品加工人员 */
    VALUE_60300("60300"),
    /** 烟叶初加工人员 */
    VALUE_60301("60301"),
    /** 烟用材料生产人员 */
    VALUE_60302("60302"),
    /** 烟草制品生产人员 */
    VALUE_60303("60303"),
    /** 其他烟草及其制品加工人员 */
    VALUE_60399("60399"),
    /** 纺织、针织、印染人员 */
    VALUE_60400("60400"),
    /** 纤维预处理人员 */
    VALUE_60401("60401"),
    /** 纺纱人员 */
    VALUE_60402("60402"),
    /** 织造人员 */
    VALUE_60403("60403"),
    /** 针织人员 */
    VALUE_60404("60404"),
    /** 非织造布制造人员 */
    VALUE_60405("60405"),
    /** 印染人员 */
    VALUE_60406("60406"),
    /** 其他纺织、针织、印染人员 */
    VALUE_60499("60499"),
    /** 纺织品、服装和皮革、毛皮制品加工制作人员 */
    VALUE_60500("60500"),
    /** 纺织品和服装剪裁缝纫人员 */
    VALUE_60501("60501"),
    /** 皮革、毛皮及其制品加工人员 */
    VALUE_60502("60502"),
    /** 羽绒羽毛加工及制品制造人员 */
    VALUE_60503("60503"),
    /** 鞋帽制作人员 */
    VALUE_60504("60504"),
    /** 其他纺织品、服装和皮革、毛皮制品加工制作人员 */
    VALUE_60599("60599"),
    /** 木材加工、家具与木制品制作人员 */
    VALUE_60600("60600"),
    /** 木材加工人员 */
    VALUE_60601("60601"),
    /** 人造板制造人员 */
    VALUE_60602("60602"),
    /** 木制品制造人员 */
    VALUE_60603("60603"),
    /** 家具制造人员 */
    VALUE_60604("60604"),
    /** 其他木材加工、家具与木制品制作人员 */
    VALUE_60699("60699"),
    /** 纸及纸制品生产加工人员 */
    VALUE_60700("60700"),
    /** 制浆造纸人员 */
    VALUE_60701("60701"),
    /** 纸制品制作人员 */
    VALUE_60702("60702"),
    /** 其他纸及纸制品生产加工人员 */
    VALUE_60799("60799"),
    /** 印刷和记录煤介复制人员 */
    VALUE_60800("60800"),
    /** 印刷人员 */
    VALUE_60801("60801"),
    /** 记录媒介复制人员 */
    VALUE_60802("60802"),
    /** 其他印刷和记录媒介复制人员 */
    VALUE_60899("60899"),
    /** 文教、工美、体育和娱乐用品制作人员 */
    VALUE_60900("60900"),
    /** 文教用品制作人员 */
    VALUE_60901("60901"),
    /** 乐器制作人员 */
    VALUE_60902("60902"),
    /** 工艺美术品制作人员 */
    VALUE_60903("60903"),
    /** 体育用品制作人员 */
    VALUE_60904("60904"),
    /** 玩具制作人员 */
    VALUE_60905("60905"),
    /** 其他文教、工美、体育和娱乐用品制作人员 */
    VALUE_60999("60999"),
    /** 石油加工和炼焦、煤化工生产人员 */
    VALUE_61000("61000"),
    /** 石油炼制生产人员 */
    VALUE_61001("61001"),
    /** 炼焦人员 */
    VALUE_61002("61002"),
    /** 煤化工生产人员 */
    VALUE_61003("61003"),
    /** 其他石油加工和炼焦、煤化工生产人员 */
    VALUE_61099("61099"),
    /** 化学原料和化学制品制造人员 */
    VALUE_61100("61100"),
    /** 化工产品生产通用工艺人员 */
    VALUE_61101("61101"),
    /** 基础化学原料制造人员 */
    VALUE_61102("61102"),
    /** 化学肥料生产人员 */
    VALUE_61103("61103"),
    /** 农药生产人员 */
    VALUE_61104("61104"),
    /** 涂料、油墨、颜料及类似产品制造人员 */
    VALUE_61105("61105"),
    /** 合成树脂生产人员 */
    VALUE_61106("61106"),
    /** 合成橡胶生产人员 */
    VALUE_61107("61107"),
    /** 专用化学产品生产人员 */
    VALUE_61108("61108"),
    /** 火工品制造、保管、爆破及焰火产品制造人员 */
    VALUE_61109("61109"),
    /** 日用化学品生产人员 */
    VALUE_61110("61110"),
    /** 其他化学原料和化学制品制造人员 */
    VALUE_61199("61199"),
    /** 医药制造人员 */
    VALUE_61200("61200"),
    /** 化学药品原料药制造人员 */
    VALUE_61201("61201"),
    /** 中药饮片加工人员 */
    VALUE_61202("61202"),
    /** 药物制剂人员 */
    VALUE_61203("61203"),
    /** 兽用药品制造人员 */
    VALUE_61204("61204"),
    /** 生物药品制造人员 */
    VALUE_61205("61205"),
    /** 其他医药制造人员 */
    VALUE_61299("61299"),
    /** 化学纤维制造人员 */
    VALUE_61300("61300"),
    /** 化学纤维原料制造人员 */
    VALUE_61301("61301"),
    /** 化学纤维纺丝及后处理人员 */
    VALUE_61302("61302"),
    /** 其他化学纤维制造人员 */
    VALUE_61399("61399"),
    /** 橡胶和塑料制品制造人员 */
    VALUE_61400("61400"),
    /** 橡胶制品生产人员 */
    VALUE_61401("61401"),
    /** 塑料制品加工人员 */
    VALUE_61402("61402"),
    /** 其他橡胶和塑料制品制造人员 */
    VALUE_61499("61499"),
    /** 非金属矿物制品制造人员 */
    VALUE_61500("61500"),
    /** 水泥、石灰、石膏及其制品制造人员 */
    VALUE_61501("61501"),
    /** 砖瓦石材等建筑材料制造人员 */
    VALUE_61502("61502"),
    /** 玻璃及玻璃制品生产加工人员 */
    VALUE_61503("61503"),
    /** 玻璃纤维及玻璃纤维增强塑料制品制造人员 */
    VALUE_61504("61504"),
    /** 陶瓷制品制造人员 */
    VALUE_61505("61505"),
    /** 耐火材料制品生产人员 */
    VALUE_61506("61506"),
    /** 石墨及炭素制品生产人员 */
    VALUE_61507("61507"),
    /** 高岭土、珍珠岩等非金属矿物加工人员 */
    VALUE_61508("61508"),
    /** 其他非金属矿物制品制造人员 */
    VALUE_61599("61599"),
    /** 采矿人员 */
    VALUE_61600("61600"),
    /** 矿物采选人员 */
    VALUE_61601("61601"),
    /** 党的机关、国家机关、群众团体和社会组织、企事业单位负责人 */
    VALUE_10000("10000"),
    /** 中国共产党机关负责人 */
    VALUE_10100("10100"),
    /** 国家机关负责人 */
    VALUE_10200("10200"),
    /** 国家权力机关负责人 */
    VALUE_10201("10201"),
    /** 国家行政机关负责人 */
    VALUE_10202("10202"),
    /** 人民政协机关负责人 */
    VALUE_10203("10203"),
    /** 人民法院和人民检察院负责人 */
    VALUE_10204("10204"),
    /** 民主党派和工商联负责人 */
    VALUE_10300("10300"),
    /** 人民团体和群众团体、社会组织及其他成员组织负责人 */
    VALUE_10400("10400"),
    /** 人民团体和群众团体负责人 */
    VALUE_10401("10401"),
    /** 社会团体负责人 */
    VALUE_10402("10402"),
    /** 民办非企业单位负责人 */
    VALUE_10403("10403"),
    /** 社会中介组织负责人 */
    VALUE_10404("10404"),
    /** 基金会负责人 */
    VALUE_10405("10405"),
    /** 宗教组织负责人 */
    VALUE_10406("10406"),
    /** 基层群众自治组织负责人 */
    VALUE_10500("10500"),
    /** 企事业单位负责人 */
    VALUE_10600("10600"),
    /** 企业负责人 */
    VALUE_10601("10601"),
    /** 事业单位负责人 */
    VALUE_10602("10602"),
    /** 专业技术人员 */
    VALUE_20000("20000"),
    /** 科学研究人员 */
    VALUE_20100("20100"),
    /** 哲学研究人员 */
    VALUE_20101("20101"),
    /** 经济学研究人员 */
    VALUE_20102("20102"),
    /** 法学研究人员 */
    VALUE_20103("20103"),
    /** 教育学研究人员 */
    VALUE_20104("20104"),
    /** 历史学研究人员 */
    VALUE_20105("20105"),
    /** 农学研究人员 */
    VALUE_20107("20107"),
    /** 医学研究人员 */
    VALUE_20108("20108"),
    /** 管理学研究人员 */
    VALUE_20109("20109"),
    /** 军事学研究人员 */
    VALUE_20111("20111"),
    /** 文学研究人员 */
    VALUE_20112("20112"),
    /** 理学研究人员 */
    VALUE_20113("20113"),
    /** 工学研究人员 */
    VALUE_20114("20114"),
    /** 艺术学研究人员 */
    VALUE_20115("20115"),
    /** 其他科学研究人员 */
    VALUE_20199("20199"),
    /** 工程技术人员 */
    VALUE_20200("20200"),
    /** 地质勘探工程技术人员 */
    VALUE_20201("20201"),
    /** 测绘和地理信息工程技术人员 */
    VALUE_20202("20202"),
    /** 矿山工程技术人员 */
    VALUE_20203("20203"),
    /** 石油天然气工程技术人员 */
    VALUE_20204("20204"),
    /** 冶金工程技术人员 */
    VALUE_20205("20205"),
    /** 化工工程技术人员 */
    VALUE_20206("20206"),
    /** 机械工程技术人员 */
    VALUE_20207("20207"),
    /** 航空工程技术人员 */
    VALUE_20208("20208"),
    /** 电子工程技术人员 */
    VALUE_20209("20209"),
    /** 信息和通信工程技术人员 */
    VALUE_20210("20210"),
    /** 电气工程技术人员 */
    VALUE_20211("20211"),
    /** 电力工程技术人员 */
    VALUE_20212("20212"),
    /** 邮政和快递工程技术人员 */
    VALUE_20213("20213"),
    /** 广播电影电视及演艺设备工程技术人员 */
    VALUE_20214("20214"),
    /** 道路和水上运输工程技术人员 */
    VALUE_20215("20215"),
    /** 民用航空工程技术人员 */
    VALUE_20216("20216"),
    /** 铁道工程技术人员 */
    VALUE_20217("20217"),
    /** 建筑工程技术人员 */
    VALUE_20218("20218"),
    /** 建材工程技术人员 */
    VALUE_20219("20219"),
    /** 林业工程技术人员 */
    VALUE_20220("20220"),
    /** 水利工程技术人员 */
    VALUE_20221("20221"),
    /** 海洋工程技术人员 */
    VALUE_20222("20222"),
    /** 纺织服装工程技术人员 */
    VALUE_20223("20223"),
    /** 食品工程技术人员 */
    VALUE_20224("20224"),
    /** 气象工程技术人员 */
    VALUE_20225("20225"),
    /** 地震工程技术人员 */
    VALUE_20226("20226"),
    /** 环境保护工程技术人员 */
    VALUE_20227("20227"),
    /** 安全工程技术人员 */
    VALUE_20228("20228"),
    /** 标准化、计量、质量和认证认可工程技术人员 */
    VALUE_20229("20229"),
    /** 管理(工业)工程技术人员 */
    VALUE_20230("20230"),
    /** 检验检疫工程技术人员 */
    VALUE_20231("20231"),
    /** 制药工程技术人员 */
    VALUE_20232("20232"),
    /** 印刷复制工程技术人员 */
    VALUE_20233("20233"),
    /** 工业（产品）设计工程技术人员 */
    VALUE_20234("20234"),
    /** 销售人员 */
    VALUE_40102("40102"),
    /** 贸易经纪代理人员 */
    VALUE_40103("40103"),
    /** 再生物资回收人员 */
    VALUE_40104("40104"),
    /** 特殊商品购销人员 */
    VALUE_40105("40105"),
    /** 其他批发与零售服务人员 */
    VALUE_40199("40199"),
    /** 交通运输、仓储和邮政业服务人员 */
    VALUE_40200("40200"),
    /** 轨道交通运输服务人员 */
    VALUE_40201("40201"),
    /** 道路运输服务人员 */
    VALUE_40202("40202"),
    /** 水上运输服务人员 */
    VALUE_40203("40203"),
    /** 航空运输服务人员 */
    VALUE_40204("40204"),
    /** 装卸搬运和运输代理服务人员 */
    VALUE_40205("40205"),
    /** 仓储人员 */
    VALUE_40206("40206"),
    /** 邮政和快递服务人员 */
    VALUE_40207("40207"),
    /** 其他交通运输、仓储和邮政业服务人员 */
    VALUE_40299("40299"),
    /** 住宿和餐饮服务人员 */
    VALUE_40300("40300"),
    /** 住宿服务人员 */
    VALUE_40301("40301"),
    /** 餐饮服务人员 */
    VALUE_40302("40302"),
    /** 其他住宿和餐饮服务人员 */
    VALUE_40399("40399"),
    /** 信息传输、软件和信息技术服务人员 */
    VALUE_40400("40400"),
    /** 信息通信业务人员 */
    VALUE_40401("40401"),
    /** 信息通信网络维护人员 */
    VALUE_40402("40402"),
    /** 广播电视传输服务人员 */
    VALUE_40403("40403"),
    /** 信息通信网络运行管理人员 */
    VALUE_40404("40404"),
    /** 软件和信息技术服务人员 */
    VALUE_40405("40405"),
    /** 其他信息传输、软件和信息技术服务人员 */
    VALUE_40499("40499"),
    /** 金融服务人员 */
    VALUE_40500("40500"),
    /** 银行服务人员 */
    VALUE_40501("40501"),
    /** 证券服务人员 */
    VALUE_40502("40502"),
    /** 期货服务人员 */
    VALUE_40503("40503"),
    /** 保险服务人员 */
    VALUE_40504("40504"),
    /** 典当服务人员 */
    VALUE_40505("40505"),
    /** 信托服务人员 */
    VALUE_40506("40506"),
    /** 其他金融服务人员 */
    VALUE_40599("40599"),
    /** 房地产服务人员 */
    VALUE_40600("40600"),
    /** 物业管理服务人员 */
    VALUE_40601("40601"),
    /** 房地产中介服务人员 */
    VALUE_40602("40602"),
    /** 其他房地产服务人员 */
    VALUE_40699("40699"),
    /** 祖赁和商务服务人员 */
    VALUE_40700("40700"),
    /** 租赁业务人员 */
    VALUE_40701("40701"),
    /** 船舶、民用航空器修理人员 */
    VALUE_63102("63102"),
    /** 检验试验人员 */
    VALUE_63103("63103"),
    /** 称重计量人员 */
    VALUE_63104("63104"),
    /** 包装人员 */
    VALUE_63105("63105"),
    /** 安全生产管理人员 */
    VALUE_63106("63106"),
    /** 其他生产辅助人员 */
    VALUE_63199("63199"),
    /** 其他生产制造及有关人员 */
    VALUE_69900("69900"),
    /** 军人 */
    VALUE_70000("70000"),
    /** 不便分类的其他从业人员 */
    VALUE_80000("80000");

    private String value;

    private OccupationCode(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static OccupationCode byValue(String value) {
        for (OccupationCode item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}