package com.dcits.blacklist.enums;

/** 语种代码 */
public enum SpokenLanguage {
    /** 英文 */
    E("E"),
    /** 中文 */
    C("C"),
    /** 阿法尔语 */
    AA("aa"),
    /** 阿布哈兹语 */
    AB("ab"),
    /** 阿维斯陀语 */
    AE("ae"),
    /** 阿非利堪斯语 */
    AF("af"),
    /** 阿坎语 */
    AK("ak"),
    /** 阿姆哈拉语 */
    AM("am"),
    /** 阿拉伯语 */
    AR("ar"),
    /** 阿萨姆语 */
    AS("as"),
    /** 阿瓦尔语 */
    AV("av"),
    /** 艾马拉语 */
    AY("ay"),
    /** 阿塞拜疆语 */
    AZ("az"),
    /** 巴什基尔语 */
    BA("ba"),
    /** 白俄罗斯语 */
    BE("be"),
    /** 保加利亚语 */
    BG("bg"),
    /** 比哈尔语 */
    BH("bh"),
    /** 比斯拉玛语 */
    BI("bi"),
    /** 班巴拉语 */
    BM("bm"),
    /** 孟加拉语 */
    BN("bn"),
    /** 藏语 */
    BO("bo"),
    /** 布列塔尼语 */
    BR("br"),
    /** 波斯尼亚语 */
    BS("bs"),
    /** 加泰隆语 */
    CA("ca"),
    /** 车臣语 */
    CE("ce"),
    /** 查莫罗语 */
    CH("ch"),
    /** 科西嘉语 */
    CO("co"),
    /** 克里语 */
    CR("cr"),
    /** 捷克语 */
    CS("cs"),
    /** 教会斯拉夫语 */
    CU("cu"),
    /** 楚瓦什语 */
    CV("cv"),
    /** 威尔士语 */
    CY("cy"),
    /** 丹麦语 */
    DA("da"),
    /** 德语 */
    DE("de"),
    /** 马尔代夫语 */
    DV("dv"),
    /** 不丹语 */
    DZ("dz"),
    /** 信德语 */
    ED("ed"),
    /** 埃维语 */
    EE("ee"),
    /** 现代希腊语(公元1453年以后) */
    EL("el"),
    /** 英语 */
    EN("en"),
    /** 世界语 */
    EO("eo"),
    /** 西班牙语 */
    ES("es"),
    /** 爱沙尼亚语 */
    ET("et"),
    /** 巴斯克语 */
    EU("eu"),
    /** 波斯语 */
    FA("fa"),
    /** 富拉语 */
    FF("ff"),
    /** 芬兰语 */
    FI("fi"),
    /** 斐济语 */
    FJ("fj"),
    /** 法罗斯语 */
    FO("fo"),
    /** 法语 */
    FR("fr"),
    /** 弗里西亚语 */
    FY("fy"),
    /** 爱尔兰语 */
    GA("ga"),
    /** 苏格兰语 */
    GD("gd"),
    /** 加利西亚语 */
    GL("gl"),
    /** 瓜拉尼语 */
    GN("gn"),
    /** 古吉拉特语 */
    GU("gu"),
    /** 马恩岛语 */
    GV("gv"),
    /** 豪萨语 */
    HA("ha"),
    /** 希伯来语 */
    HE("he"),
    /** 印地语 */
    HI("hi"),
    /** 希里奠图语 */
    HO("ho"),
    /** 克罗地亚语 */
    HR("hr"),
    /** 匈牙利语 */
    HU("hu"),
    /** 亚美尼亚语 */
    HY("hy"),
    /** 赫雷罗语 */
    HZ("hz"),
    /** 国际语A */
    IA("ia"),
    /** 印尼语 */
    ID("id"),
    /** 国际语E */
    IE("ie"),
    /** 伊博语 */
    IG("ig"),
    /** 依努庇克语 */
    IK("ik"),
    /** 伊多语 */
    IO("io"),
    /** 冰岛语 */
    IS("is"),
    /** 意大利语 */
    IT("it"),
    /** 伊努伊特语 */
    IU("iu"),
    /** 日语 */
    JA("ja"),
    /** 爪哇语 */
    JV("jv"),
    /** 格鲁吉亚语 */
    KA("ka"),
    /** 刚果语 */
    KG("kg"),
    /** 基库尤语 */
    KI("ki"),
    /** 夸尼亚玛语 */
    KJ("kj"),
    /** 哈萨克语 */
    KK("kk"),
    /** 格陵兰语 */
    KL("kl"),
    /** 柬埔寨语 */
    KM("km"),
    /** 坎纳达语 */
    KN("kn"),
    /** 朝鲜语 */
    KO("ko"),
    /** 卡努里语 */
    KR("kr"),
    /** 克什米尔语 */
    KS("ks"),
    /** 库尔德语 */
    KU("ku"),
    /** 科米语 */
    KV("kv"),
    /** 康沃尔语 */
    KW("kw"),
    /** 吉尔青斯语 */
    KY("ky"),
    /** 拉丁语 */
    LA("la"),
    /** 卢森堡语 */
    LB("lb"),
    /** 干达语 */
    LG("lg"),
    /** 林加拉语 */
    LN("ln"),
    /** 老挝语 */
    LO("lo"),
    /** 立陶宛语 */
    LT("lt"),
    /** 卢巴一加丹加语 */
    LU("lu"),
    /** 拉脱维亚语 */
    LV("lv"),
    /** 马达加斯加语 */
    MG("mg"),
    /** 马绍尔语 */
    MH("mh"),
    /** 毛利语 */
    MI("mi"),
    /** 马拉亚拉姆语 */
    MJ("mj"),
    /** 马其顿语 */
    MK("mk"),
    /** 蒙古语 */
    MN("mn"),
    /** 摩尔达维亚语 */
    MO("mo"),
    /** 马拉提语 */
    MR("mr"),
    /** 马来语 */
    MS("ms"),
    /** 马耳他语 */
    MT("mt"),
    /** 缅甸语 */
    MY("my"),
    /** 瑙鲁语 */
    NA("na"),
    /** 挪威布克摩尔语 */
    NB("nb"),
    /** 北恩德贝勒语 */
    ND("nd"),
    /** 尼泊尔语 */
    NE("ne"),
    /** 恩敦加语 */
    NG("ng"),
    /** 荷兰语 */
    NL("nl"),
    /** 尼诺斯克挪威语 */
    NN("nn"),
    /** 挪威语 */
    NO("no"),
    /** 南恩德贝勒语 */
    NR("nr"),
    /** 纳瓦霍语 */
    NV("nv"),
    /** 班图语 */
    NY("ny"),
    /** 普罗旺斯语(公元1500年以后) */
    OC("oc"),
    /** 奥吉布瓦语 */
    OJ("oj"),
    /** 阿芳·奥洛莫语 */
    OM("om"),
    /** 奥利亚语 */
    OR("or"),
    /** 奥塞梯语 */
    OS("os"),
    /** 旁遮普语 */
    PA("pa"),
    /** 巴利语 */
    PI("pi"),
    /** 波兰语 */
    PL("pl"),
    /** 普什图语 */
    PS("ps"),
    /** 葡萄牙语 */
    PT("pt"),
    /** 凯楚亚语 */
    QU("qu"),
    /** 利托罗曼语 */
    RM("rm"),
    /** 基隆迪语 */
    RN("rn"),
    /** 罗马尼亚语 */
    RO("ro"),
    /** 俄语 */
    RU("ru"),
    /** 卢旺达语 */
    RW("rw"),
    /** 梵语 */
    SA("sa"),
    /** 撒丁语 */
    SC("sc"),
    /** 北萨摩斯语 */
    SE("se"),
    /** 桑戈语 */
    SG("sg"),
    /** 塞尔维亚一克罗地亚语 */
    SH("sh"),
    /** 僧加罗语 */
    SI("si"),
    /** 斯洛伐克语 */
    SK("sk"),
    /** 斯洛文尼亚语 */
    SL("sl"),
    /** 萨摩亚语 */
    SM("sm"),
    /** 绍纳语 */
    SN("sn"),
    /** 索马里语 */
    SO("so"),
    /** 阿尔巴尼亚语 */
    SQ("sq"),
    /** 塞尔维亚语 */
    SR("sr"),
    /** 塞斯瓦特语 */
    SS("ss"),
    /** 南索托语 */
    ST("st"),
    /** 巽他语 */
    SU("su"),
    /** 瑞典语 */
    SV("sv"),
    /** 斯瓦希里语 */
    SW("sw"),
    /** 泰米尔语 */
    TA("ta"),
    /** 泰卢固语 */
    TE("te"),
    /** 塔吉克语 */
    TG("tg"),
    /** 泰语 */
    TH("th"),
    /** 提格里尼亚语 */
    TI("ti"),
    /** 土库曼语 */
    TK("tk"),
    /** 他加禄语 */
    TL("tl"),
    /** 茨瓦纳语 */
    TN("tn"),
    /** 汤加语(汤加岛) */
    TO("to"),
    /** 土耳其语 */
    TR("tr"),
    /** 宗加语 */
    TS("ts"),
    /** 塔塔尔语 */
    TT("tt"),
    /** 特威语 */
    TW("tw"),
    /** 塔希提语 */
    TY("ty"),
    /** 维吾尔语 */
    UG("ug"),
    /** 乌克兰语 */
    UK("uk"),
    /** 乌尔都语 */
    UR("ur"),
    /** 乌兹别克语 */
    UZ("uz"),
    /** 文达语 */
    VE("ve"),
    /** 越南语 */
    VI("vi"),
    /** 沃拉普克语 */
    VO("vo"),
    /** 瓦隆语 */
    WA("wa"),
    /** 沃洛夫语 */
    WO("wo"),
    /** 科萨语 */
    XH("xh"),
    /** 依地语 */
    YI("yi"),
    /** 约鲁巴语 */
    YO("yo"),
    /** 壮语 */
    ZA("za"),
    /** 汉语《中文) */
    ZH("zh"),
    /** 祖鲁语 */
    ZU("zu"),
    /** 其他语言 */
    ZZ("zz");

    private String value;

    private SpokenLanguage(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static SpokenLanguage byValue(String value) {
        for (SpokenLanguage item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}