package com.dcits.blacklist.enums;

/** 交易类型 */
public enum TranType {
    /** 曼兑维修资金转入 */
    VALUE_31("31"),
    /** 曼兑维修资金转入-冲销 */
    VALUE_32("32"),
    /** 曼兑维修资金转出 */
    VALUE_34("34"),
    /** 曼兑维修资金转出-冲销 */
    VALUE_35("35"),
    /** 财政代发转出 */
    VALUE_36("36"),
    /** 财政代发转出-冲销 */
    VALUE_37("37"),
    /** 财政代发转入 */
    VALUE_38("38"),
    /** 财政代发转入-冲销 */
    VALUE_39("39"),
    /** 税银代扣转出(卡折) */
    VALUE_40("40"),
    /** 税银代扣转出(卡折)-冲销 */
    VALUE_41("41"),
    /** 税银代扣转入(卡折) */
    VALUE_42("42"),
    /** 税银代扣转入(卡折)-冲销 */
    VALUE_43("43"),
    /** 社保直连养老代发转出 */
    VALUE_44("44"),
    /** 社保直连养老代发转出-冲销 */
    VALUE_45("45"),
    /** 社保直连养老代发转入 */
    VALUE_46("46"),
    /** 社保直连养老代发转入-冲销 */
    VALUE_47("47"),
    /** 税银代扣转入(现金) */
    VALUE_52("52"),
    /** 税银代扣转入(现金)-冲销 */
    VALUE_53("53"),
    /** 外围单边入账 */
    VALUE_54("54"),
    /** 外围单边入账-冲销 */
    VALUE_55("55"),
    /** 代收付转出 */
    VALUE_359("359"),
    /** 代收付转出-冲销 */
    VALUE_360("360"),
    /** 代收付转入 */
    VALUE_361("361"),
    /** 代收付转入-冲销 */
    VALUE_362("362"),
    /** 代收付转账社保－转出 */
    VALUE_383("383"),
    /** 代收付转账社保－转出-冲销 */
    VALUE_384("384"),
    /** 代收付转账社保－转入 */
    VALUE_385("385"),
    /** 代收付转账社保－转入-冲销 */
    VALUE_386("386"),
    /** 现金存入 */
    VALUE_1000("1000"),
    /** 现金存入-冲销 */
    VALUE_1001("1001"),
    /** 现金支取 */
    VALUE_1003("1003"),
    /** 现金支取-冲销 */
    VALUE_1004("1004"),
    /** 现金支票支取 */
    VALUE_1006("1006"),
    /** 现金支票支取-冲销 */
    VALUE_1007("1007"),
    /** 资产内部户现金存入 */
    VALUE_1008("1008"),
    /** 资产内部户现金存入-冲销 */
    VALUE_1009("1009"),
    /** 资产内部账现金存入 */
    VALUE_1010("1010"),
    /** 资产内部账现金存入-冲销 */
    VALUE_1011("1011"),
    /** 资产内部账现金支取 */
    VALUE_1012("1012"),
    /** 资产内部账现金支取-冲销 */
    VALUE_1013("1013"),
    /** 现金销户分位处理-少付多收 */
    VALUE_1014("1014"),
    /** 现金销户分位处理-少付多收-冲正 */
    VALUE_1015("1015"),
    /** 现金销户分位处理-多付少收 */
    VALUE_1016("1016"),
    /** 现金销户分位处理-多付少收-冲正 */
    VALUE_1017("1017"),
    /** 现金存入隔日冲正-客户账 */
    VALUE_1020("1020"),
    /** 现金存入隔日冲正-内部账 */
    VALUE_1022("1022"),
    /** 现金支取隔日冲正-内部账 */
    VALUE_1024("1024"),
    /** 现金支取隔日冲正-客户账 */
    VALUE_1026("1026"),
    /** 现金存入-移植专用 */
    VALUE_1030("1030"),
    /** 现金存入-移植专用-冲正 */
    VALUE_1031("1031"),
    /** 现金支取-移植专用 */
    VALUE_1033("1033"),
    /** 现金支取-移植专用-冲正 */
    VALUE_1034("1034"),
    /** 单账户借记-科目 */
    VALUE_1035("1035"),
    /** 单账户借记-科目-冲正 */
    VALUE_1036("1036"),
    /** 单账户贷记-科目 */
    VALUE_1037("1037"),
    /** 单账户贷记-科目-冲正 */
    VALUE_1038("1038"),
    /** 太平保险转出 */
    VALUE_1088("1088"),
    /** 太平保险转出-冲正 */
    VALUE_1089("1089"),
    /** 太平保险转入 */
    VALUE_1090("1090"),
    /** 太平保险转入-冲正 */
    VALUE_1091("1091"),
    /** 出纳短款挂账 */
    VALUE_2113("2113"),
    /** 出纳短款挂账-冲销 */
    VALUE_2114("2114"),
    /** 出纳长款挂账 */
    VALUE_2119("2119"),
    /** 出纳长款挂账-冲销 */
    VALUE_2120("2120"),
    /** ATM短款挂账 */
    VALUE_2121("2121"),
    /** ATM短款挂账-冲销 */
    VALUE_2122("2122"),
    /** ATM长款挂账 */
    VALUE_2123("2123"),
    /** ATM长款挂账-冲销 */
    VALUE_2124("2124"),
    /** 强制扣划转账支取(非支票) */
    VALUE_2125("2125"),
    /** 强制扣划转账支取(非支票)-冲销 */
    VALUE_2126("2126"),
    /** 强制扣划转账存入(非支票) */
    VALUE_2128("2128"),
    /** 强制扣划转账存入(非支票)-冲销 */
    VALUE_2129("2129"),
    /** 待处理款项调增 */
    VALUE_2130("2130"),
    /** 待处理款项调减 */
    VALUE_2131("2131"),
    /** 待处理款项入账-冲正 */
    VALUE_2132("2132"),
    /** 待处理款项出账-冲正 */
    VALUE_2133("2133"),
    /** 结算户转久悬户 */
    VALUE_2201("2201"),
    /** 久悬现金销户 */
    VALUE_2202("2202"),
    /** 久悬转账销户-单位 */
    VALUE_2203("2203"),
    /** 久悬转账销户 */
    VALUE_22032("22032"),
    /** 久悬户激活 */
    VALUE_2204("2204"),
    /** 久悬户转营业外收入 */
    VALUE_2205("2205"),
    /** 营业外久悬款项转账销户 */
    VALUE_2206("2206"),
    /** 营业外转账销户 */
    VALUE_22062("22062"),
    /** 个人冒名账户销户 */
    VALUE_2207("2207"),
    /** 个人冒名销户账户处置 */
    VALUE_2208("2208"),
    /** 个人冒名账户销户-冲正 */
    VALUE_2209("2209"),
    /** 个人冒名销户账户处置-冲正 */
    VALUE_2210("2210"),
    /** 久悬转账销户-个人 */
    VALUE_2211("2211"),
    /** 久悬转账支取-个人冒名 */
    VALUE_2212("2212"),
    /** 久悬转账支取-个人冒名-冲销 */
    VALUE_2213("2213"),
    /** 久悬现金支取-个人冒名 */
    VALUE_2214("2214"),
    /** 久悬现金支取-个人冒名-冲销 */
    VALUE_2215("2215"),
    /** 非现金销户分位处理-少付多收 */
    VALUE_2216("2216"),
    /** 非现金销户分位处理-少付多收-冲正 */
    VALUE_2217("2217"),
    /** 非现金销户分位处理-多付少收 */
    VALUE_2218("2218"),
    /** 非现金销户分位处理-多付少收-冲正 */
    VALUE_2219("2219"),
    /** 存量电子账户久悬款项转账 */
    VALUE_2220("2220"),
    /** 存量电子账户久悬款项转账-冲销 */
    VALUE_2221("2221"),
    /** 存量电子账户久悬款项现金支取 */
    VALUE_2222("2222"),
    /** 存量电子账户营业外转账 */
    VALUE_2223("2223"),
    /** 存量电子账户营业外转账-冲销 */
    VALUE_2224("2224"),
    /** 存量电子账户营业外现金支取 */
    VALUE_2225("2225"),
    /** 久悬户激活销户重开 */
    VALUE_2226("2226"),
    /** 营业外激活 */
    VALUE_2227("2227"),
    /** 营业外现金销户 */
    VALUE_2228("2228"),
    /** 营业外激活销户重开 */
    VALUE_2229("2229"),
    /** 久悬转账销户-个人-冲销 */
    VALUE_2295("2295"),
    /** 结算户转久悬户-冲销 */
    VALUE_2296("2296"),
    /** 营业外转账销户-冲销 */
    VALUE_22972("22972"),
    /** 营业外久悬款项转账销户-冲销 */
    VALUE_2297("2297"),
    /** 久悬现金销户-冲销 */
    VALUE_2298("2298"),
    /** 久悬转账销户-冲销 */
    VALUE_22992("22992"),
    /** 久悬转账销户-单位-冲销 */
    VALUE_2299("2299"),
    /** 资产类内部户借记 */
    VALUE_4101("4101"),
    /** 资产类内部户借记-冲销 */
    VALUE_4102("4102"),
    /** 资产类内部户贷记 */
    VALUE_4103("4103"),
    /** 资产类内部户贷记-冲销 */
    VALUE_4104("4104"),
    /** 内部户负债转账存入 */
    VALUE_4105("4105"),
    /** 内部户负债转账存入-冲销 */
    VALUE_4106("4106"),
    /** 内部户负债转账支取 */
    VALUE_4107("4107"),
    /** 内部户负债转账支取-冲销 */
    VALUE_4108("4108"),
    /** 内部户营业外转入 */
    VALUE_4109("4109"),
    /** 内部户营业外转入-冲销 */
    VALUE_4110("4110"),
    /** 内部户支取到营业外 */
    VALUE_4111("4111"),
    /** 内部户支取到营业外-冲销 */
    VALUE_4112("4112"),
    /** 行内转账支取(支票) */
    VALUE_4180("4180"),
    /** 行内转账支取(支票)-冲销 */
    VALUE_4181("4181"),
    /** 行内转账存入(支票) */
    VALUE_4183("4183"),
    /** 行内转账存入(支票)-冲销 */
    VALUE_4184("4184"),
    /** 行内转账支取(非支票) */
    VALUE_4186("4186"),
    /** 行内转账支取(非支票)-冲销 */
    VALUE_4187("4187"),
    /** 转账支取更正 */
    VALUE_4188("4188"),
    /** 行内转账存入(非支票) */
    VALUE_4189("4189"),
    /** 行内转账存入(非支票)-冲销 */
    VALUE_4190("4190"),
    /** 转账存入更正 */
    VALUE_4191("4191"),
    /** 钞汇互转存入交易类型 */
    VALUE_4192("4192"),
    /** 钞汇互转存入交易类型-冲销 */
    VALUE_4193("4193"),
    /** 钞汇互转支取交易类型 */
    VALUE_4194("4194"),
    /** 钞汇互转支取交易类型-冲销 */
    VALUE_4195("4195"),
    /** 行内资金划拨转出 */
    VALUE_4196("4196"),
    /** 行内资金划拨转出-冲销 */
    VALUE_4197("4197"),
    /** 行内资金划拨转入 */
    VALUE_4198("4198"),
    /** 行内资金划拨转入-冲销 */
    VALUE_4199("4199"),
    /** 存放同业借方 */
    VALUE_4210("4210"),
    /** 存放同业借方-冲销 */
    VALUE_4211("4211"),
    /** 存放同业贷方 */
    VALUE_4212("4212"),
    /** 存放同业贷方-冲销 */
    VALUE_4213("4213"),
    /** 大额现金转账支取(支票) */
    VALUE_4280("4280"),
    /** 大额现金转账支取(支票)-冲销 */
    VALUE_4281("4281"),
    /** 大额现金转账存入(支票) */
    VALUE_4283("4283"),
    /** 大额现金转账存入(支票)-冲销 */
    VALUE_4284("4284"),
    /** 大额现金转账支取(非支票) */
    VALUE_4286("4286"),
    /** 大额现金转账支取(非支票)-冲销 */
    VALUE_4287("4287"),
    /** 转账支取更正-冲销 */
    VALUE_4288("4288"),
    /** 大额现金转账存入(非支票) */
    VALUE_4289("4289"),
    /** 大额现金转账存入(非支票)-冲销 */
    VALUE_4290("4290"),
    /** 转账存入更正-冲销 */
    VALUE_4291("4291"),
    /** 现金支取更正-冲销 */
    VALUE_4295("4295"),
    /** 现金支票支取更正-冲销 */
    VALUE_4296("4296"),
    /** 现金存入更正-冲销 */
    VALUE_4297("4297"),
    /** 转账支票支取更正-冲销 */
    VALUE_4299("4299"),
    /** 行内转账支取(系统用) */
    VALUE_4304("4304"),
    /** 行内转账支取(系统用)-冲销 */
    VALUE_4305("4305"),
    /** 行内转账存入(系统用) */
    VALUE_4306("4306"),
    /** 行内转账存入(系统用)-冲销 */
    VALUE_4307("4307"),
    /** 存款开户存入 */
    VALUE_4308("4308"),
    /** 存款开户存入-冲销 */
    VALUE_4309("4309"),
    /** 行内转账支取(支票) */
    VALUE_43802("43802"),
    /** 行内转账支取(批量支票) */
    VALUE_4380("4380"),
    /** 行内转账支取(批量支票)-冲销 */
    VALUE_43812("43812"),
    /** 行内转账支取(支票)-冲销 */
    VALUE_4381("4381"),
    /** 行内转账存入(支票) */
    VALUE_43832("43832"),
    /** 行内转账存入(批量支票) */
    VALUE_4383("4383"),
    /** 行内转账存入(支票)-冲销 */
    VALUE_4384("4384"),
    /** 行内转账存入(批量支票)-冲销 */
    VALUE_43842("43842"),
    /** 行内转账支取(批量非支票) */
    VALUE_4386("4386"),
    /** 行内转账支取(批量非支票)-冲销 */
    VALUE_4387("4387"),
    /** 转账支票支取更正 */
    VALUE_4388("4388"),
    /** 行内转账存入(批量非支票) */
    VALUE_43892("43892"),
    /** 行内转账支取(批量非支票) */
    VALUE_4389("4389"),
    /** 行内转账存入(批量非支票)-冲销 */
    VALUE_4390("4390"),
    /** 现金支取更正 */
    VALUE_4395("4395"),
    /** 现金支票支取更正 */
    VALUE_4396("4396"),
    /** 现金存入更正 */
    VALUE_4397("4397"),
    /** 一户通手工交易调整转出 */
    VALUE_4486("4486"),
    /** 一户通手工交易调整转出-冲销 */
    VALUE_4487("4487"),
    /** 一户通手工交易调整转入 */
    VALUE_4489("4489"),
    /** 一户通手工交易调整转入-冲销 */
    VALUE_4490("4490"),
    /** 卡理财产品转出 */
    VALUE_4586("4586"),
    /** 卡理财产品转出-冲销 */
    VALUE_4587("4587"),
    /** 卡理财产品转入 */
    VALUE_4589("4589"),
    /** 卡理财产品转入-冲销 */
    VALUE_4590("4590"),
    /** 串户冲正借方-错账账户 */
    VALUE_4601("4601"),
    /** 串户冲正借方-正确账户 */
    VALUE_4602("4602"),
    /** 串户冲正贷方-错账账户 */
    VALUE_4603("4603"),
    /** 串户冲正贷方-正确账户 */
    VALUE_4604("4604"),
    /** 资产类内部账户-串户冲正-借方-错账账户 */
    VALUE_4605("4605"),
    /** 资产类内部账户-串户冲正-借方-正确账户 */
    VALUE_4606("4606"),
    /** 资产类内部账户-串户冲正-贷方-错账账户 */
    VALUE_4607("4607"),
    /** 资产类内部账户-串户冲正-贷方-正确账户 */
    VALUE_4608("4608"),
    /** 串户冲正借方-错账账户-冲正 */
    VALUE_4611("4611"),
    /** 串户冲正借方-正确账户-冲正 */
    VALUE_4612("4612"),
    /** 串户冲正贷方-错账账户-冲正 */
    VALUE_4613("4613"),
    /** 串户冲正贷方-正确账户-冲正 */
    VALUE_4614("4614"),
    /** 资产类内部账户-串户冲正-借方-错账账户-冲正 */
    VALUE_4615("4615"),
    /** 资产类内部账户-串户冲正-借方-正确账户-冲正 */
    VALUE_4616("4616"),
    /** 资产类内部账户-串户冲正-贷方-错账账户-冲正 */
    VALUE_4617("4617"),
    /** 资产类内部账户-串户冲正-贷方-正确账户-冲正 */
    VALUE_4618("4618"),
    /** 串户冲正借方-错账账户-负债户 */
    VALUE_4619("4619"),
    /** 串户冲正借方-正确账户 */
    VALUE_4620("4620"),
    /** 串户冲正贷方-错账账户-负债户 */
    VALUE_4621("4621"),
    /** 串户冲正贷方-正确账户 */
    VALUE_4622("4622"),
    /** 串户冲正借方-错账账户-负债户-冲正 */
    VALUE_4623("4623"),
    /** 串户冲正借方-正确账户-冲正 */
    VALUE_4624("4624"),
    /** 串户冲正贷方-错账账户-负债户-冲正 */
    VALUE_4625("4625"),
    /** 串户冲正贷方-正确账户-冲正 */
    VALUE_4626("4626"),
    /** 外围通用转账-转出 */
    VALUE_4686("4686"),
    /** 外围通用转账-转出-冲正 */
    VALUE_4687("4687"),
    /** 外围通用转账-转入 */
    VALUE_4689("4689"),
    /** 外围通用转账-转入-冲正 */
    VALUE_4690("4690"),
    /** 转账支取-移植专用 */
    VALUE_4986("4986"),
    /** 转账支取-移植专用-冲正 */
    VALUE_4987("4987"),
    /** 转账存入-移植专用 */
    VALUE_4989("4989"),
    /** 转账存入-移植专用-冲正 */
    VALUE_4990("4990"),
    /** 贷方利息资本化(系统结息) */
    VALUE_5000("5000"),
    /** 借方利息资本化(系统结息)-负利率 */
    VALUE_5000CF("5000CF"),
    /** 借方利息资本化(系统结息)-负利率-冲正 */
    VALUE_5000CR("5000CR"),
    /** 贷方利息资本化(系统结息)-负利率 */
    VALUE_5000F("5000F"),
    /** 贷方利息资本化(系统结息)-负利率-冲正 */
    VALUE_5000FR("5000FR"),
    /** 贷方利息调整入账(单户结息) */
    VALUE_5001("5001"),
    /** 贷方利息调整入账冲销(单户结息) */
    VALUE_5002("5002"),
    /** 内部账户结息(资产) */
    VALUE_5003("5003"),
    /** 内部账户结息(负债) */
    VALUE_5004("5004"),
    /** MM拆入结息 */
    VALUE_5005("5005"),
    /** MM拆入结息冲正 */
    VALUE_5006("5006"),
    /** 利息税 */
    VALUE_5011("5011"),
    /** 利息税冲销 */
    VALUE_5012("5012"),
    /** 定期本息转存贷记本金+利息(系统用) */
    VALUE_5015("5015"),
    /** 定期本金转存贷记利息(系统用) */
    VALUE_5016("5016"),
    /** 前付息提前支取结息-冲正 */
    VALUE_5ACR("5ACR"),
    /** 前付息提前支取结息 */
    VALUE_5ACY("5ACY"),
    /** 前付息 */
    VALUE_5ADF("5ADF"),
    /** 反冲前付息 */
    VALUE_5ADJ("5ADJ"),
    /** 预付利息调整-冲销 */
    VALUE_5ADR("5ADR"),
    /** 前付息-冲销 */
    VALUE_5ADT("5ADT"),
    /** 反冲按频率付息-冲销 */
    VALUE_5EQR("5EQR"),
    /** 反冲按频率付息 */
    VALUE_5EQX("5EQX"),
    /** 定期本息转存贷记本金+利息(系统用) */
    VALUE_6006("6006"),
    /** 账户清扫-存入 */
    VALUE_9001("9001"),
    /** 冲正-账户清扫存入 */
    VALUE_9002("9002"),
    /** 账户清扫-支取 */
    VALUE_9003("9003"),
    /** 冲正-账户清扫支取 */
    VALUE_9004("9004"),
    /** 同城票交借方结算-冲销 */
    VALUE_9006("9006"),
    /** 同城票交贷方结算-冲销 */
    VALUE_9007("9007"),
    /** 同城票交借方结算 */
    VALUE_9008("9008"),
    /** 同城票交贷方结算 */
    VALUE_9009("9009"),
    /** 同城票交借方提出退票结算 */
    VALUE_9012("9012"),
    /** 同城票交贷方提出退票结算 */
    VALUE_9013("9013"),
    /** 同城票交借方提出退票结算-冲销 */
    VALUE_9014("9014"),
    /** 同城票交贷方提出退票结算-冲销 */
    VALUE_9015("9015"),
    /** 同城票交借方提入退票结算 */
    VALUE_9016("9016"),
    /** 同城票交贷方提入退票结算 */
    VALUE_9017("9017"),
    /** 同城票交借方提入退票结算-冲销 */
    VALUE_9018("9018"),
    /** 同城票交贷方提入退票结算-冲销 */
    VALUE_9019("9019"),
    /** 同城票交借方结算(退票) */
    VALUE_9020("9020"),
    /** 同城票交贷方结算(退票) */
    VALUE_9021("9021"),
    /** 同城票交借方结算(退票)-冲销 */
    VALUE_9022("9022"),
    /** 同城票交贷方结算(退票)-冲销 */
    VALUE_9023("9023"),
    /** 同城票交提出借方结算(退票) */
    VALUE_9024("9024"),
    /** 同城票交提出贷方结算(退票) */
    VALUE_9025("9025"),
    /** 同城票交提出借方结算(退票)-冲销 */
    VALUE_9026("9026"),
    /** 同城票交提出贷方结算(退票)-冲销 */
    VALUE_9027("9027"),
    /** 同城票交提出托收退票（重提提出） */
    VALUE_9028("9028"),
    /** 同城票交提出托收退票（重提提出）-冲销 */
    VALUE_9029("9029"),
    /** 同城票交提出托付退票（重提提出） */
    VALUE_9030("9030"),
    /** 同城票交提出托付退票（重提提出）-冲销 */
    VALUE_9031("9031"),
    /** 同城票交提出托付退票(重提提出-提入) */
    VALUE_9032("9032"),
    /** 同城票交提出托付退票(重提提出-提入)-冲正 */
    VALUE_9033("9033"),
    /** 清差划拨(提出托收结转) */
    VALUE_9101("9101"),
    /** 清差划拨(提出托收结转)-冲销 */
    VALUE_9102("9102"),
    /** 清差划拨(提出托付结转) */
    VALUE_9103("9103"),
    /** 清差划拨(提出托付结转)-冲销 */
    VALUE_9104("9104"),
    /** 清差划拨(提入托收结转) */
    VALUE_9105("9105"),
    /** 清差划拨(提入托收结转)-冲销 */
    VALUE_9106("9106"),
    /** 清差划拨(提入托付结转) */
    VALUE_9107("9107"),
    /** 清差划拨(提入托付结转)-冲销 */
    VALUE_9108("9108"),
    /** 清差划拨(收差) */
    VALUE_9109("9109"),
    /** 清差划拨(收差)-冲销 */
    VALUE_9110("9110"),
    /** 清差划拨(付差) */
    VALUE_9111("9111"),
    /** 清差划拨(付差)-冲销 */
    VALUE_9112("9112"),
    /** 同城清算(收差) */
    VALUE_9113("9113"),
    /** 同城清算(收差)-冲销 */
    VALUE_9114("9114"),
    /** 同城清算(付差) */
    VALUE_9115("9115"),
    /** 同城清算(付差)-冲销 */
    VALUE_9116("9116"),
    /** 存款账户利息返还 */
    VALUE_9990("9990"),
    /** 其它模块支票结算_借方(系统用) */
    VALUE_9991("9991"),
    /** 其它模块支票结算_借方(系统用)-冲销 */
    VALUE_9992("9992"),
    /** 其它模块现金结算_借方(系统用) */
    VALUE_9993("9993"),
    /** 其它模块现金结算_借方(系统用)-冲销 */
    VALUE_9994("9994"),
    /** 其它模块结算_贷方(系统用)-冲销 */
    VALUE_9996("9996"),
    /** 其它模块结算_借方(系统用)-冲销 */
    VALUE_9997("9997"),
    /** 贷款发放 */
    VALUE_9998("9998"),
    /** 贷款回收 */
    VALUE_9999("9999"),
    /** 资产证券化赎回结算账户 */
    ABSB("ABSB"),
    /** 资产证券化发行撤销结算账户 */
    ABSR("ABSR"),
    /** 资产证券化发行结算账户 */
    ABSS("ABSS"),
    /** 行内ATM取款 */
    AC01("AC01"),
    /** 行内ATM取款-冲销 */
    AC02("AC02"),
    /** 行内ATM转账存入 */
    AC05("AC05"),
    /** 行内ATM转账存入-冲销 */
    AC06("AC06"),
    /** 行内CDM现金存入 */
    AC07("AC07"),
    /** 行内CDM现金存入-冲销 */
    AC08("AC08"),
    /** 本行POS消费 */
    AC10("AC10"),
    /** 本行POS消费 -冲正 */
    AC11("AC11"),
    /** 本行POS消费撤销 */
    AC12("AC12"),
    /** 本行POS消费撤销 -冲正 */
    AC13("AC13"),
    /** 本行POS退货 */
    AC14("AC14"),
    /** 本行POS退货 -冲正 */
    AC15("AC15"),
    /** 本行POS预授权完成 */
    AC16("AC16"),
    /** 本行POS预授权完成 -冲正 */
    AC17("AC17"),
    /** 本行POS预授权完成撤销 */
    AC18("AC18"),
    /** 本行POS预授权完成撤销 -冲正 */
    AC19("AC19"),
    /** 行内ATM次日转账存入 */
    AC25("AC25"),
    /** 行内ATM次日转账存入-冲销 */
    AC26("AC26"),
    /** 行内ATM转账支取 */
    AC27("AC27"),
    /** 行内ATM转账支取-冲销 */
    AC28("AC28"),
    /** 行内ATM次日转账支取 */
    AC29("AC29"),
    /** 行内ATM次日转账支取-冲销 */
    AC30("AC30"),
    /** 本行贷记卡POS消费 */
    AC40("AC40"),
    /** 本行贷记卡POS消费-冲销 */
    AC41("AC41"),
    /** 本行贷记卡POS消费撤销 */
    AC42("AC42"),
    /** 本行贷记卡POS消费撤销-冲销 */
    AC43("AC43"),
    /** 本行贷记卡POS预授权完成 */
    AC44("AC44"),
    /** 本行贷记卡POS预授权完成-冲销 */
    AC45("AC45"),
    /** 本行贷记卡POS预授权完成撤销 */
    AC46("AC46"),
    /** 本行贷记卡POS预授权完成撤销-冲销 */
    AC47("AC47"),
    /** 本行贷记卡POS退货 */
    AC48("AC48"),
    /** 本行贷记卡POS退货 -冲销 */
    AC49("AC49"),
    /** POS商户入账-借记卡借方 */
    AC50("AC50"),
    /** POS商户入账-借记卡借方 -冲销 */
    AC51("AC51"),
    /** POS商户入账-借记卡贷方 */
    AC52("AC52"),
    /** POS商户入账-借记卡贷方 -冲销 */
    AC53("AC53"),
    /** 计提 */
    ACR("ACR"),
    /** 计提-冲销 */
    ACRR("ACRR"),
    /** 资产证券化贷款计提-不转产品 */
    ACRZ("ACRZ"),
    /** 未使用凭证使用-冲销 */
    ACT_NUS("ACT_NUS"),
    /** 本金调增 */
    ADPA("ADPA"),
    /** 本金调减 */
    ADPD("ADPD"),
    /** 费用摊销 */
    AMOR2("AMOR2"),
    /** 费用收入摊销 */
    AMOR("AMOR"),
    /** 费用摊销-冲销 */
    AMRR2("AMRR2"),
    /** 费用收入摊销-冲销 */
    AMRR("AMRR"),
    /** 资产转让后转出金额回收 */
    AREC("AREC"),
    /** 资产转让后转出金额回收-冲正 */
    ARECR("ARECR"),
    /** 资产转让撤销 */
    ASSB2("ASSB2"),
    /** 资产转让回购 */
    ASSB("ASSB"),
    /** 资产转让--冲正 */
    ASSR("ASSR"),
    /** 资产转让前收息贷款 */
    ASSS2("ASSS2"),
    /** 资产转让 */
    ASSS("ASSS"),
    /** 资产转让未实现利息撤销 */
    ASSSC("ASSSC"),
    /** 资产转让未实现利息冲正 */
    ASSSR("ASSSR"),
    /** ATM机具清机-入库 */
    ATM_IN("ATM_IN"),
    /** ATM机具加钞入库-集中式 */
    ATM_IN1("ATM_IN1"),
    /** ATM清机-入库-集中式 */
    ATM_JIN("ATM_JIN"),
    /** ATM机具清机-入库-集中式 */
    ATM_JIN1("ATM_JIN1"),
    /** ATM机具清机-入库-撤销-集中式 */
    ATM_JIN1R("ATM_JIN1R"),
    /** ATM清机-入库-撤销-集中式 */
    ATM_JINR("ATM_JINR"),
    /** ATM清机-出库-集中式 */
    ATM_JOUT("ATM_JOUT"),
    /** ATM机具清机-出库-集中式 */
    ATM_JOUT1("ATM_JOUT1"),
    /** ATM机具清机-出库-撤销-集中式 */
    ATM_JOUT1R("ATM_JOUT1R"),
    /** ATM清机-出库-撤销-集中式 */
    ATM_JOUTR("ATM_JOUTR"),
    /** ATM加钞出库 */
    ATM_OUT("ATM_OUT"),
    /** ATM加钞出库-集中式 */
    ATM_OUT1("ATM_OUT1"),
    /** ATM加钞出库-撤销-集中式 */
    ATM_OUT1R("ATM_OUT1R"),
    /** ATM加钞出库-撤销 */
    ATM_OUTR("ATM_OUTR"),
    /** ATM清机 */
    ATMCL("ATMCL"),
    /** ATM清机-机具出库-撤销 */
    ATMCLR("ATMCLR"),
    /** ATM加钞确认 */
    ATMIN("ATMIN"),
    /** 保险代销转账转入 */
    BD01("BD01"),
    /** 保险代销转账转入-冲销 */
    BD02("BD02"),
    /** 保险代销转账支取 */
    BD03("BD03"),
    /** 保险代销转账支取-冲销 */
    BD04("BD04"),
    /** 表外贷款发放-冲销 */
    BDRR("BDRR"),
    /** 表外贷款发放 */
    BDRW("BDRW"),
    /** 三省一市汇票转账签发 */
    BE01("BE01"),
    /** 冲正-三省一市汇票转账签发 */
    BE02("BE02"),
    /** 三省一市汇票现金签发 */
    BE03("BE03"),
    /** 冲正-三省一市汇票现金签发 */
    BE04("BE04"),
    /** 三省一市汇票转账兑付 */
    BE05("BE05"),
    /** 冲正-三省一市汇票转账兑付 */
    BE06("BE06"),
    /** 三省一市汇票现金兑付 */
    BE07("BE07"),
    /** 冲正-三省一市汇票现金兑付 */
    BE08("BE08"),
    /** 三省一市汇票转账退回 */
    BE09("BE09"),
    /** 冲正-三省一市汇票转账退回 */
    BE10("BE10"),
    /** 三省一市汇票现金退回 */
    BE11("BE11"),
    /** 冲正-三省一市汇票现金退回 */
    BE12("BE12"),
    /** 三省一市汇票法院执行 */
    BE13("BE13"),
    /** 冲正-三省一市汇票法院执行 */
    BE14("BE14"),
    /** 三省一市汇票多余退回 */
    BE15("BE15"),
    /** 冲正-三省一市汇票多余退回 */
    BE16("BE16"),
    /** 晋商快付客户本金结算 */
    BF012("BF012"),
    /** 神州数码快付客户本金结算 */
    BF01("BF01"),
    /** 晋商快付客户本金结算-冲销 */
    BF022("BF022"),
    /** 神州数码快付客户本金结算-冲销 */
    BF02("BF02"),
    /** 神州数码快付网联资金清算 */
    BF032("BF032"),
    /** 晋商快付网联资金清算 */
    BF03("BF03"),
    /** 晋商快付网联资金清算 -冲销 */
    BF042("BF042"),
    /** 神州数码快付网联资金清算 -冲销 */
    BF04("BF04"),
    /** 神州数码快付转账转出 */
    BF052("BF052"),
    /** 晋商快付转账转出 */
    BF05("BF05"),
    /** 神州数码快付转账转出-冲销 */
    BF062("BF062"),
    /** 晋商快付转账转出-冲销 */
    BF06("BF06"),
    /** 神州数码快付转账转入 */
    BF072("BF072"),
    /** 晋商快付转账转入 */
    BF07("BF07"),
    /** 神州数码快付转账转入-冲销 */
    BF082("BF082"),
    /** 晋商快付转账转入-冲销 */
    BF08("BF08"),
    /** 神州数码快付手续费结算-支付宝 */
    BF092("BF092"),
    /** 晋商快付手续费结算-支付宝 */
    BF09("BF09"),
    /** 晋商快付手续费结算-支付宝-冲销 */
    BF10("BF10"),
    /** 神州数码快付手续费结算-支付宝-冲销 */
    BF102("BF102"),
    /** 神州数码快付手续费结算-微信 */
    BF11("BF11"),
    /** 晋商快付手续费结算-微信 */
    BF112("BF112"),
    /** 晋商快付手续费结算-微信-冲销 */
    BF12("BF12"),
    /** 神州数码快付手续费结算-微信-冲销 */
    BF122("BF122"),
    /** 公积金转账转入 */
    BR01("BR01"),
    /** 公积金转账转入-冲正 */
    BR02("BR02"),
    /** 公积金转账转出 */
    BR03("BR03"),
    /** 公积金转账转出-冲正 */
    BR04("BR04"),
    /** 我行表外权益收回 */
    BREC("BREC"),
    /** 我行表外权益收回-不转产品 */
    BRECZ("BRECZ"),
    /** 表外贷款回收-冲销 */
    BRER("BRER"),
    /** 智能报销清算-借记 */
    BX01("BX01"),
    /** 智能报销清算-借记-冲正 */
    BX02("BX02"),
    /** 智能报销清算-贷记 */
    BX03("BX03"),
    /** 智能报销清算-贷记-冲正 */
    BX04("BX04"),
    /** 受托支付支取 */
    C001("C001"),
    /** 受托支付存入 */
    C002("C002"),
    /** 受托支付退回支取 */
    C003("C003"),
    /** 受托支付退回存入 */
    C004("C004"),
    /** 受托支付退回支取-冲销 */
    C005("C005"),
    /** 受托支付退回存入-冲销 */
    C006("C006"),
    /** 结息 */
    CAPT("CAPT"),
    /** 结息冲正 */
    CAPTR("CAPTR"),
    /** 本行现金入库 */
    CASH_IN("CASH_IN"),
    /** 本行现金出库 */
    CASH_OUT("CASH_OUT"),
    /** 个人网银普通转账存入 */
    CB01("CB01"),
    /** 个人网银普通转账存入-冲销 */
    CB02("CB02"),
    /** 个人网银普通转账支取 */
    CB03("CB03"),
    /** 个人网银普通转账支取-冲销 */
    CB04("CB04"),
    /** 个人网银次日转账存入 */
    CB05("CB05"),
    /** 个人网银次日转账存入-冲销 */
    CB06("CB06"),
    /** 个人网银次日转账支取 */
    CB07("CB07"),
    /** 个人网银次日转账支取-冲销 */
    CB08("CB08"),
    /** 手机银行普通转账存入 */
    CB09("CB09"),
    /** 手机银行普通转账存入-冲销 */
    CB10("CB10"),
    /** 手机银行普通转账支取 */
    CB11("CB11"),
    /** 手机银行普通转账支取-冲销 */
    CB12("CB12"),
    /** 手机银行次日转账存入 */
    CB13("CB13"),
    /** 手机银行次日转账存入-冲销 */
    CB14("CB14"),
    /** 手机银行次日转账支取 */
    CB15("CB15"),
    /** 手机银行次日转账支取-冲销 */
    CB16("CB16"),
    /** 企业网银普通转账存入 */
    CB31("CB31"),
    /** 企业网银普通转账存入-冲销 */
    CB32("CB32"),
    /** 企业网银普通转账支取 */
    CB33("CB33"),
    /** 企业网银普通转账支取-冲销 */
    CB34("CB34"),
    /** 企业网银次日转账存入 */
    CB35("CB35"),
    /** 企业网银次日转账存入-冲销 */
    CB36("CB36"),
    /** 企业网银次日转账支取 */
    CB37("CB37"),
    /** 企业网银次日转账支取-冲销 */
    CB38("CB38"),
    /** 代发工资（企业网银）转出 */
    CB45("CB45"),
    /** 代发工资（企业网银）转出-冲销 */
    CB46("CB46"),
    /** 代发工资（企业网银）转入 */
    CB47("CB47"),
    /** 代发工资（企业网银）转入-冲销 */
    CB48("CB48"),
    /** 总账现金存入 */
    CCGL("CCGL"),
    /** 总账现金存入-冲销 */
    CEGL("CEGL"),
    /** 营业外账户入账 */
    CEOA("CEOA"),
    /** 营业外账户入账冲正 */
    CEOR("CEOR"),
    /** 久悬户账户入账 */
    CESA("CESA"),
    /** 久悬户账户入账 */
    CESR("CESR"),
    /** 银转证 */
    CG01("CG01"),
    /** 银转证-冲正 */
    CG02("CG02"),
    /** 证转银 */
    CG03("CG03"),
    /** 证转银-冲正 */
    CG04("CG04"),
    /** 理财转账存入 */
    CH01("CH01"),
    /** 理财转账存入-冲销 */
    CH02("CH02"),
    /** 理财转账支取 */
    CH03("CH03"),
    /** 理财转账支取-冲销 */
    CH04("CH04"),
    /** 存入-长款处理 */
    CK01("CK01"),
    /** 现金-长款处理 */
    CK02("CK02"),
    /** 总账-长款处理 */
    CK03("CK03"),
    /** 信用卡账户-长款处理 */
    CK04("CK04"),
    /** 银联清算-长款处理 */
    CK05("CK05"),
    /** ATM机具加钞确认-入库-集中式 */
    CM_IN1("CM_IN1"),
    /** ATM加钞 */
    CM_OUT("CM_OUT"),
    /** ATM机具加钞确认-出库-集中式 */
    CM_OUT1("CM_OUT1"),
    /** 现金系统归集支取 */
    CM05("CM05"),
    /** 现金系统归集存入 */
    CM06("CM06"),
    /** 现金系统归集支取-冲销 */
    CM15("CM15"),
    /** 现金系统归集存入-冲销 */
    CM16("CM16"),
    /** 小额汇兑往账(现管) */
    CM19("CM19"),
    /** 冲正-小额汇兑往账(现管) */
    CM20("CM20"),
    /** 大额汇兑往账(现管) */
    CM21("CM21"),
    /** 冲正-大额汇兑往账(现管) */
    CM22("CM22"),
    /** 现金系统账户计提 */
    CM41("CM41"),
    /** 现金系统账户结息 */
    CM42("CM42"),
    /** 现金系统普通转账支取 */
    CM50("CM50"),
    /** 现金系统普通转账支取-冲销 */
    CM51("CM51"),
    /** 现金系统普通转账存入 */
    CM52("CM52"),
    /** 现金系统普通转账存入-冲销 */
    CM53("CM53"),
    /** 现金系统次日转账支取 */
    CM54("CM54"),
    /** 现金系统次日转账支取-冲销 */
    CM55("CM55"),
    /** 现金系统次日转账存入 */
    CM56("CM56"),
    /** 现金系统次日转账存入-冲销 */
    CM57("CM57"),
    /** 代发工资（现金管理）转出 */
    CM58("CM58"),
    /** 代发工资（现金管理）转出-冲销 */
    CM59("CM59"),
    /** 代发工资（现金管理）转入 */
    CM60("CM60"),
    /** 代发工资（现金管理）转入-冲销 */
    CM61("CM61"),
    /** 代收水电煤费（现金管理）转出 */
    CM62("CM62"),
    /** 代收水电煤费（现金管理）转出-冲销 */
    CM63("CM63"),
    /** 代收水电煤费（现金管理）转入 */
    CM64("CM64"),
    /** 代收水电煤费（现金管理）转入-冲销 */
    CM65("CM65"),
    /** 贷款承诺额 */
    COM("COM"),
    /** 承诺-冲正 */
    COM1("COM1"),
    /** 承诺额度减少 */
    COM2("COM2"),
    /** 优惠券减免 */
    COUPON("COUPON"),
    /** 优惠券减免金额回冲 */
    COUPONB("COUPONB"),
    /** 优惠券减免金额回冲-冲销 */
    COUPONBR("COUPONBR"),
    /** 优惠券减免-冲销 */
    COUPONR("COUPONR"),
    /** 资金池归集存入-冲销 */
    CP01("CP01"),
    /** 资金池归集支取-冲销 */
    CP02("CP02"),
    /** 资金池下拨存入-冲销 */
    CP03("CP03"),
    /** 资金池下拨支取-冲销 */
    CP04("CP04"),
    /** 资金池归集存入 */
    CP0C("CP0C"),
    /** 资金池归集支取 */
    CP0D("CP0D"),
    /** 资金池下拨存入 */
    CP1C("CP1C"),
    /** 资金池下拨支取 */
    CP1D("CP1D"),
    /** 资金池内部计价贷记 */
    CP2C("CP2C"),
    /** 资金池内部计价贷记-冲销 */
    CP2CR("CP2CR"),
    /** 资金池内部计价借记 */
    CP2D("CP2D"),
    /** 资金池内部计价借记-冲销 */
    CP2DR("CP2DR"),
    /** 受托支付支取-冲销 */
    CR01("CR01"),
    /** 受托支付存入-冲销 */
    CR02("CR02"),
    /** 红字贷记事件 */
    CRED("CRED"),
    /** 贷记事件-冲销 */
    CRER("CRER"),
    /** 贷记事件 */
    CRET("CRET"),
    /** 总账贷记事件 */
    CRGL("CRGL"),
    /** 总账贷记事件-冲销 */
    CRGR("CRGR"),
    /** 红字贷记事件-冲销 */
    CRRR("CRRR"),
    /** 小额汇兑往账(国库) */
    CS19("CS19"),
    /** 冲正-小额汇兑往账(国库) */
    CS20("CS20"),
    /** 大额汇兑往账(国库) */
    CS21("CS21"),
    /** 冲正-大额汇兑往账(国库) */
    CS22("CS22"),
    /** 超级网银往帐-转账 */
    CW01("CW01"),
    /** 超级网银往帐-转账-冲正 */
    CW02("CW02"),
    /** 超级网银借记来帐回执 */
    CW03("CW03"),
    /** 超级网银借记来帐回执-冲正 */
    CW04("CW04"),
    /** 超级网银来帐入账 */
    CW05("CW05"),
    /** 超级网银来帐入账-冲正 */
    CW06("CW06"),
    /** 超级网银差错入账 */
    CW07("CW07"),
    /** 超级网银差错入账-冲正 */
    CW08("CW08"),
    /** 超级网银维护入账 */
    CW09("CW09"),
    /** 超级网银维护入账-冲正 */
    CW10("CW10"),
    /** 超级网银手机号码转账入账 */
    CW11("CW11"),
    /** 超级网银手机号码转账入账-冲正 */
    CW12("CW12"),
    /** 城银来帐入账 */
    CY01("CY01"),
    /** 城银来帐入账-冲正 */
    CY02("CY02"),
    /** 城银往帐扣款 */
    CY03("CY03"),
    /** 城银往帐扣款-冲正 */
    CY04("CY04"),
    /** 城银往帐-现金 */
    CY05("CY05"),
    /** 城银往帐-现金-冲正 */
    CY06("CY06"),
    /** 城银维护入账 */
    CY07("CY07"),
    /** 城银维护入账-冲正 */
    CY08("CY08"),
    /** 城银清算入账 */
    CY09("CY09"),
    /** 城银清算入账-冲正 */
    CY10("CY10"),
    /** 城银清算扣款 */
    CY11("CY11"),
    /** 城银清算扣款-冲正 */
    CY12("CY12"),
    /** 城银往帐删除 */
    CY13("CY13"),
    /** 城银往帐删除-冲正 */
    CY14("CY14"),
    /** 财政零余额过渡-付款 */
    CY15("CY15"),
    /** 财政零余额过渡-付款-冲正 */
    CY16("CY16"),
    /** 财政零余额过渡-收款 */
    CY17("CY17"),
    /** 财政零余额过渡-收款-冲正 */
    CY18("CY18"),
    /** 财政垫款转出 */
    CZ01("CZ01"),
    /** 财政垫款转出-冲正 */
    CZ02("CZ02"),
    /** 财政垫款转入 */
    CZ03("CZ03"),
    /** 财政垫款转入-冲正 */
    CZ04("CZ04"),
    /** 财政垫款退款转出 */
    CZ05("CZ05"),
    /** 财政垫款退款转出-冲正 */
    CZ06("CZ06"),
    /** 财政垫款退款转出转入 */
    CZ07("CZ07"),
    /** 财政垫款退款转出转入-冲正 */
    CZ08("CZ08"),
    /** 银企直联转账转入 */
    DC01("DC01"),
    /** 银企直联转账转入-冲销 */
    DC02("DC02"),
    /** 银企直联转账支取 */
    DC03("DC03"),
    /** 银企直联转账支取-冲销 */
    DC04("DC04"),
    /** 大额存单赎回-借记 */
    DC05("DC05"),
    /** 大额存单赎回-借记-冲正 */
    DC06("DC06"),
    /** 大额存单赎回-贷记 */
    DC07("DC07"),
    /** 大额存单赎回-贷记-冲正 */
    DC08("DC08"),
    /** 大额存单转让-借记 */
    DC09("DC09"),
    /** 大额存单转让-借记-冲正 */
    DC10("DC10"),
    /** 大额存单转让-贷记 */
    DC11("DC11"),
    /** 大额存单转让-贷记-冲正 */
    DC12("DC12"),
    /** 贴现发放 */
    DDRW("DDRW"),
    /** 贴现发放-冲正 */
    DDRWR("DDRWR"),
    /** 大额往帐扣款 */
    DE01("DE01"),
    /** 大额往帐扣款-冲正 */
    DE02("DE02"),
    /** 电子渠道往帐挂账 */
    DE03("DE03"),
    /** 电子渠道往帐挂账-冲正 */
    DE04("DE04"),
    /** 大额来帐入账 */
    DE05("DE05"),
    /** 大额来帐入账-冲正 */
    DE06("DE06"),
    /** 大额维护入 */
    DE07("DE07"),
    /** 大额维护入-冲正 */
    DE08("DE08"),
    /** 大额来帐入账 */
    DE09("DE09"),
    /** 大额来帐入账-冲正 */
    DE10("DE10"),
    /** 大额被人行拒绝退款 */
    DE11("DE11"),
    /** 大额被人行拒绝退款-冲正 */
    DE12("DE12"),
    /** 转账签发汇票 */
    DE13("DE13"),
    /** 转账签发汇票-冲正 */
    DE14("DE14"),
    /** 现金签发汇票 */
    DE15("DE15"),
    /** 现金签发汇票-冲正 */
    DE16("DE16"),
    /** 汇票退回 */
    DE17("DE17"),
    /** 汇票退回-冲正 */
    DE18("DE18"),
    /** 即时转账扣款 */
    DE19("DE19"),
    /** 即时转账扣款-冲正 */
    DE20("DE20"),
    /** 即时转账入账 */
    DE21("DE21"),
    /** 即时转账入账-冲正 */
    DE22("DE22"),
    /** 大额往帐-现金 */
    DE23("DE23"),
    /** 大额往帐-现金-冲正 */
    DE24("DE24"),
    /** 大额往帐-转账 */
    DE25("DE25"),
    /** 大额往帐-转账-冲正 */
    DE26("DE26"),
    /** 汇票资金多余划回 */
    DE27("DE27"),
    /** 汇票资金多余划回-冲正 */
    DE28("DE28"),
    /** 汇票资金清算 */
    DE29("DE29"),
    /** 汇票资金清算-冲正 */
    DE30("DE30"),
    /** 汇票资金逾期退回 */
    DE31("DE31"),
    /** 汇票资金逾期退回-冲正 */
    DE32("DE32"),
    /** 汇票资金未用退回 */
    DE33("DE33"),
    /** 汇票资金未用退回-冲正 */
    DE34("DE34"),
    /** 大额往帐删除 */
    DE35("DE35"),
    /** 大额往帐删除-冲正 */
    DE36("DE36"),
    /** 财政零余额过渡-付款 */
    DE37("DE37"),
    /** 财政零余额过渡-付款-冲正 */
    DE38("DE38"),
    /** 财政零余额过渡-收款 */
    DE39("DE39"),
    /** 财政零余额过渡-收款-冲正 */
    DE40("DE40"),
    /** 大额次日转账 */
    DE41("DE41"),
    /** 大额次日转账-冲正 */
    DE42("DE42"),
    /** 借记事件-冲销 */
    DEBR("DEBR"),
    /** 借记事件 */
    DEBT("DEBT"),
    /** 债权减免 */
    DEF("DEF"),
    /** 总账借记事件 */
    DEGL("DEGL"),
    /** 总账借记事件-冲销 */
    DEGR("DEGR"),
    /** 借记其他应付款-久悬未取款项 */
    DESA("DESA"),
    /** 借记其他应付款-久悬未取款项-冲正 */
    DESR("DESR"),
    /** 假币解缴 */
    DEV("DEV"),
    /** 单位客户纸质缴税转入-冲正 */
    DGC2("DGC2"),
    /** 单位客户纸质缴税转出-冲正 */
    DGJ2("DGJ2"),
    /** 单位客户纸质缴税转入 */
    DGJC("DGJC"),
    /** 单位客户纸质缴税转出 */
    DGJS("DGJS"),
    /** (资产)利息非资本化转入-负利率 */
    DINTDF("DINTDF"),
    /** (资产)利息非资本化转入-负利率-冲销 */
    DINTDFR("DINTDFR"),
    /** 信用卡预借现金 */
    DJ01("DJ01"),
    /** 信用卡预借现金-冲正 */
    DJ02("DJ02"),
    /** 信用卡预借现金撤销 */
    DJ03("DJ03"),
    /** 信用卡预借现金撤销-冲正 */
    DJ04("DJ04"),
    /** 信用卡现金还款 */
    DJ05("DJ05"),
    /** 信用卡现金还款-冲正 */
    DJ06("DJ06"),
    /** 信用卡现金还款撤销 */
    DJ07("DJ07"),
    /** 信用卡现金还款撤销-冲正 */
    DJ08("DJ08"),
    /** 信用卡转账支取 */
    DJ09("DJ09"),
    /** 信用卡转账支取-冲销 */
    DJ10("DJ10"),
    /** 信用卡转账支取撤销 */
    DJ11("DJ11"),
    /** 信用卡转账支取撤销-冲销 */
    DJ12("DJ12"),
    /** 信用卡转账存入 */
    DJ13("DJ13"),
    /** 信用卡转账存入-冲销 */
    DJ14("DJ14"),
    /** 信用卡转账存入撤销 */
    DJ15("DJ15"),
    /** 信用卡转账存入撤销-冲销 */
    DJ16("DJ16"),
    /** 信用卡转账存入(支票) */
    DJ17("DJ17"),
    /** 信用卡转账存入(支票)-冲销 */
    DJ18("DJ18"),
    /** 信用卡转账存入撤销(支票) */
    DJ19("DJ19"),
    /** 信用卡转账存入撤销(支票)-冲销 */
    DJ20("DJ20"),
    /** 信用卡销户结清(现金) */
    DJ21("DJ21"),
    /** 信用卡销户结清(现金)-冲销 */
    DJ22("DJ22"),
    /** 信用卡自扣还款 */
    DJ23("DJ23"),
    /** 信用卡自动结清 */
    DJ24("DJ24"),
    /** 自助终端信用卡预借现金 */
    DJ25("DJ25"),
    /** 自助终端信用卡预借现金-冲正 */
    DJ26("DJ26"),
    /** 自助终端信用卡现金还款 */
    DJ27("DJ27"),
    /** 自助终端信用卡现金还款-冲正 */
    DJ28("DJ28"),
    /** 自助终端信用卡转账支取 */
    DJ29("DJ29"),
    /** 自助终端信用卡转账支取-冲正 */
    DJ30("DJ30"),
    /** 自助终端信用卡转账存入 */
    DJ31("DJ31"),
    /** 自助终端信用卡转账存入-冲正 */
    DJ32("DJ32"),
    /** 网银信用卡转账支取 */
    DJ33("DJ33"),
    /** 网银信用卡转账支取-冲正 */
    DJ34("DJ34"),
    /** 信用卡购销易－强制扣划 */
    DJ35("DJ35"),
    /** 信用卡购销易－强制扣划－冲销 */
    DJ36("DJ36"),
    /** 客服信用卡转账存入 */
    DJ37("DJ37"),
    /** 客服信用卡转账存入-冲正 */
    DJ38("DJ38"),
    /** 智能终端信用卡转账支取 */
    DJ39("DJ39"),
    /** 智能终端信用卡转账支取-冲正 */
    DJ40("DJ40"),
    /** 智能终端信用卡转账存入 */
    DJ41("DJ41"),
    /** 智能终端信用卡转账存入-冲正 */
    DJ42("DJ42"),
    /** 信用卡快捷支付记账 */
    DJ43("DJ43"),
    /** 快捷支付退货 */
    DJ44("DJ44"),
    /** 快捷支付退货-冲正 */
    DJ45("DJ45"),
    /** 网联信用卡消费支付 */
    DJ46("DJ46"),
    /** 网联信用卡消费退货 */
    DJ47("DJ47"),
    /** 网联信用卡消费退货-冲销 */
    DJ48("DJ48"),
    /** 信用卡快捷支付记账-冲正 */
    DJ49("DJ49"),
    /** 晋商E付贷记卡消费 */
    DJ50("DJ50"),
    /** 神州数码E付贷记卡消费 */
    DJ502("DJ502"),
    /** 晋商E付贷记卡消费-冲正 */
    DJ51("DJ51"),
    /** 神州数码E付贷记卡消费-冲正 */
    DJ512("DJ512"),
    /** 晋商E付贷记卡退货 */
    DJ522("DJ522"),
    /** 神州数码E付贷记卡退货 */
    DJ52("DJ52"),
    /** 晋商E付贷记卡退货-冲正 */
    DJ532("DJ532"),
    /** 神州数码E付贷记卡退货-冲正 */
    DJ53("DJ53"),
    /** 贷记卡二次并账本金入账 */
    DJ54("DJ54"),
    /** 贷记卡二次并账本金入账-冲正 */
    DJ55("DJ55"),
    /** 网联信用卡还款 */
    DJ56("DJ56"),
    /** 网联信用卡还款-冲销 */
    DJ57("DJ57"),
    /** 积分商城手续费收入 */
    DJ58("DJ58"),
    /** 积分商城手续费收入-冲销 */
    DJ59("DJ59"),
    /** 积分商城回佣 */
    DJ60("DJ60"),
    /** 积分商城回佣-冲销 */
    DJ61("DJ61"),
    /** 信用卡转账还款 */
    DJ62("DJ62"),
    /** 信用卡转账还款-冲销 */
    DJ63("DJ63"),
    /** 网联信用卡消费支付-冲销 */
    DJ99("DJ99"),
    /** 信用卡存款帐户调整贷方 */
    DJKC("DJKC"),
    /** 信用卡存款帐户调整借方 */
    DJKD("DJKD"),
    /** 支取-短款处理 */
    DK01("DK01"),
    /** 现金-短款处理 */
    DK02("DK02"),
    /** 总账-短款处理 */
    DK03("DK03"),
    /** 信用卡账户-短款处理 */
    DK04("DK04"),
    /** 银联清算-短款处理 */
    DK05("DK05"),
    /** 支取-短款处理-冲销 */
    DR01("DR01"),
    /** 现金-短款处理-冲销 */
    DR02("DR02"),
    /** 总账-短款处理-冲销 */
    DR03("DR03"),
    /** 信用卡账户-短款处理-冲销 */
    DR04("DR04"),
    /** 银联清算-短款处理-冲销 */
    DR05("DR05"),
    /** 贴现回收 */
    DREC("DREC"),
    /** 贴现回收-冲正 */
    DRECR("DRECR"),
    /** 红字借记事件 */
    DRED("DRED"),
    /** 红字借记事件-冲销 */
    DRRR("DRRR"),
    /** 贷款放款 */
    DRW1("DRW1"),
    /** 贷款放款-冲销 */
    DRW2("DRW2"),
    /** 前收息利息 */
    DRW3("DRW3"),
    /** 前收息利息冲正 */
    DRW4("DRW4"),
    /** 贴现利息扣收-冲销 */
    DSWR("DSWR"),
    /** 贴现利息扣收 */
    DSWT("DSWT"),
    /** 转账签发汇票转出 */
    DT13("DT13"),
    /** 转账签发汇票-冲正 */
    DT14("DT14"),
    /** 现金签发汇票 */
    DT15("DT15"),
    /** 现金签发汇票-冲正 */
    DT16("DT16"),
    /** 转账签发汇票转入 */
    DT19("DT19"),
    /** 转账签发汇票转入-冲正 */
    DT20("DT20"),
    /** 汇票签发户转出 */
    DT21("DT21"),
    /** 汇票签发资金转出-冲正 */
    DT22("DT22"),
    /** 汇票移存户转入 */
    DT23("DT23"),
    /** 汇票移存户转入-冲正 */
    DT24("DT24"),
    /** 汇票逾期退回户转出 */
    DT25("DT25"),
    /** 汇票签发资金转出-冲正 */
    DT26("DT26"),
    /** 汇票资金多余划回 */
    DT27("DT27"),
    /** 汇票资金多余划回-冲正 */
    DT28("DT28"),
    /** 汇票逾期退回户转入 */
    DT29("DT29"),
    /** 汇票移存户转入-冲正 */
    DT30("DT30"),
    /** 汇票资金逾期退回 */
    DT31("DT31"),
    /** 汇票资金逾期退回-冲正 */
    DT32("DT32"),
    /** 汇票资金未用退回 */
    DT33("DT33"),
    /** 汇票资金未用退回-冲正 */
    DT34("DT34"),
    /** 结息 */
    DUE("DUE"),
    /** 资产证券化递延负债摊销-不转产品 */
    DUEL("DUEL"),
    /** 结息-冲正 */
    DUER("DUER"),
    /** 定期续存-借记 */
    DXC1("DXC1"),
    /** 定期续存-借记-冲正 */
    DXC2("DXC2"),
    /** 定期续存-贷记 */
    DXC3("DXC3"),
    /** 定期续存-贷记-冲正 */
    DXC4("DXC4"),
    /** 抵消分录 */
    DXFL("DXFL"),
    /** 抵质押入库 */
    DY01("DY01"),
    /** 抵质押入库-冲销 */
    DY02("DY02"),
    /** 抵质押提取-保管机构 */
    DY03("DY03"),
    /** 抵质押提取-保管机构-冲销 */
    DY04("DY04"),
    /** 抵质押借阅 */
    DY05("DY05"),
    /** 抵质押借阅-冲销 */
    DY06("DY06"),
    /** 抵质押退回 */
    DY07("DY07"),
    /** 抵质押退回-冲销 */
    DY08("DY08"),
    /** 抵质押变更出库 */
    DY09("DY09"),
    /** 抵质押变更出库-冲销 */
    DY10("DY10"),
    /** 抵质押变更交回-交回支行 */
    DY11("DY11"),
    /** 抵质押变更交回-交回支行-冲销 */
    DY12("DY12"),
    /** 抵质押物变更交回-支行出库冲销 */
    DY13("DY13"),
    /** 抵质押入库-保管机构 */
    DY15("DY15"),
    /** 抵质押入库-保管机构-冲销 */
    DY16("DY16"),
    /** 抵质押提取 */
    DY17("DY17"),
    /** 抵质押提取-冲销 */
    DY18("DY18"),
    /** 抵质押变更交回-保管机构 */
    DY19("DY19"),
    /** 抵质押变更交回-保管机构-冲销 */
    DY20("DY20"),
    /** 抵质押物变更交回-支行出库冲销-冲销 */
    DY21("DY21"),
    /** 久悬户销户激活 */
    EF051("EF051"),
    /** 久悬户销户激活-冲正 */
    EF052("EF052"),
    /** 营业外销户激活 */
    EF053("EF053"),
    /** 营业外销户激活-冲正 */
    EF054("EF054"),
    /** 票据面值借方 */
    ES001("ES001"),
    /** 冲正-票据面值借方 */
    ES002("ES002"),
    /** 票据业务处理账户转入 */
    ES003("ES003"),
    /** 冲正-票据业务处理账户转入 */
    ES004("ES004"),
    /** 票据业务处理账户转出 */
    ES005("ES005"),
    /** 冲正-票据业务处理账户转出 */
    ES006("ES006"),
    /** 票据利息调整贷方 */
    ES007("ES007"),
    /** 冲正-票据利息调整贷方 */
    ES008("ES008"),
    /** 票据业务往来清算贷方 */
    ES009("ES009"),
    /** 冲正-票据业务往来清算贷方 */
    ES010("ES010"),
    /** 票据业务往来清算借方 */
    ES011("ES011"),
    /** 冲正-票据业务往来清算借方 */
    ES012("ES012"),
    /** 票据利息调整借方 */
    ES013("ES013"),
    /** 冲正-票据利息调整借方 */
    ES014("ES014"),
    /** 票据面值贷方 */
    ES015("ES015"),
    /** 冲正-票据面值贷方 */
    ES016("ES016"),
    /** 应收买入返售金融资产息 */
    ES017("ES017"),
    /** 冲正-应收买入返售金融资产息 */
    ES018("ES018"),
    /** 应付卖出回购金融资产利息 */
    ES019("ES019"),
    /** 冲正-应付卖出回购金融资产利息 */
    ES020("ES020"),
    /** 存放中央银行准备金存款 */
    ES021("ES021"),
    /** 冲正-存放中央银行准备金存款 */
    ES022("ES022"),
    /** 应收票据追偿款借方 */
    ES023("ES023"),
    /** 冲正-应收票据追偿款借方 */
    ES024("ES024"),
    /** 应收票据追偿款贷方 */
    ES025("ES025"),
    /** 冲正-应收票据追偿款贷方 */
    ES026("ES026"),
    /** 账户转出 */
    ES027("ES027"),
    /** 冲正-账户转出 */
    ES028("ES028"),
    /** 质押式卖出回购银行承兑汇票面值贷方 */
    ES029("ES029"),
    /** 冲正-质押式卖出回购银行承兑汇票面值贷方 */
    ES030("ES030"),
    /** 质押式卖出回购银行承兑汇票面值借方 */
    ES031("ES031"),
    /** 冲正-质押式卖出回购银行承兑汇票面值借方 */
    ES032("ES032"),
    /** 存放中央银行准备金存款 */
    ES033("ES033"),
    /** 存放中央银行准备金存款-冲销 */
    ES034("ES034"),
    /** 银行承兑汇票签发(纸票) */
    ES100("ES100"),
    /** 冲正-银行承兑汇票签发(纸票) */
    ES101("ES101"),
    /** 银行承兑汇票未用退回(纸票) */
    ES102("ES102"),
    /** 冲正-银行承兑汇票未用退回(纸票) */
    ES103("ES103"),
    /** 银行承兑汇票备款转出 */
    ES104("ES104"),
    /** 银行承兑汇票备款转出-冲正 */
    ES105("ES105"),
    /** 银行承兑汇票备款转入 */
    ES106("ES106"),
    /** 银行承兑汇票备款转入-冲正 */
    ES107("ES107"),
    /** 到期未兑付银行承兑汇票登记(纸票) */
    ES108("ES108"),
    /** 冲正-到期未兑付银行承兑汇票登记(纸票) */
    ES109("ES109"),
    /** 到期未兑付银行承兑汇票销记(纸票) */
    ES110("ES110"),
    /** 冲正-到期未兑付银行承兑汇票销记(纸票) */
    ES111("ES111"),
    /** 到期兑付结清 */
    ES112("ES112"),
    /** 冲正-到期兑付结清 */
    ES113("ES113"),
    /** 到期解付结清销代保管(纸票) */
    ES114("ES114"),
    /** 冲正-到期解付结清销代保管(纸票) */
    ES115("ES115"),
    /** 小额汇兑往账(财务) */
    ES19("ES19"),
    /** 冲正-小额汇兑往账(财务) */
    ES20("ES20"),
    /** 银行承兑汇票签发(电票) */
    ES200("ES200"),
    /** 冲正-银行承兑汇票签发(电票) */
    ES201("ES201"),
    /** 银行承兑汇票未用退回(电票) */
    ES202("ES202"),
    /** 冲正-银行承兑汇票未用退回(电票) */
    ES203("ES203"),
    /** 到期未兑付银行承兑汇票登记(电票) */
    ES208("ES208"),
    /** 冲正-到期未兑付银行承兑汇票登记(电票) */
    ES209("ES209"),
    /** 大额汇兑往账(财务) */
    ES21("ES21"),
    /** 到期未兑付银行承兑汇票销记(电票) */
    ES210("ES210"),
    /** 冲正-到期未兑付银行承兑汇票销记(电票) */
    ES211("ES211"),
    /** 纸质银行承兑汇票到期扣款 */
    ES212("ES212"),
    /** 纸质银行承兑汇票到期扣款-冲正 */
    ES213("ES213"),
    /** 电子银行承兑汇票到期扣款 */
    ES214("ES214"),
    /** 电子银行承兑汇票到期扣款-冲正 */
    ES215("ES215"),
    /** 代客托收票据入库 */
    ES216("ES216"),
    /** 代客托收票据入库-冲正 */
    ES217("ES217"),
    /** 代客托收发出 */
    ES218("ES218"),
    /** 代客托收发出-冲正 */
    ES219("ES219"),
    /** 冲正-大额汇兑往账(财务) */
    ES22("ES22"),
    /** 冲正-发出付款确认实物被退回 */
    ES869("ES869"),
    /** 冲正-发出付款确认实物（直贴未转卖票据） */
    ES870("ES870"),
    /** 冲正-商业承兑汇票电票表外解押 */
    ES871("ES871"),
    /** 冲正-银行承兑汇票电票表外解押 */
    ES872("ES872"),
    /** 冲正-商业承兑汇票电票表外登记 */
    ES873("ES873"),
    /** 冲正-银行承兑汇票纸票表外解押 */
    ES874("ES874"),
    /** 冲正-商业承兑汇票电票表外登记 */
    ES875("ES875"),
    /** 冲正-商业承兑汇票电票表外登记 */
    ES876("ES876"),
    /** 冲正-商业承兑汇票纸票表外登记 */
    ES877("ES877"),
    /** 冲正-银行承兑汇票纸票表外登记 */
    ES878("ES878"),
    /** 冲正-表外托收拒付 */
    ES879("ES879"),
    /** 冲正-表外托收登记 */
    ES880("ES880"),
    /** 冲正-表外代客托收被拒付 */
    ES881("ES881"),
    /** 冲正-表外代客托收 */
    ES882("ES882"),
    /** 冲正-表外其他机构代保管销记 */
    ES883("ES883"),
    /** 冲正-表外其他机构代保管登记 */
    ES884("ES884"),
    /** 冲正-表外代其他机构保管销记 */
    ES885("ES885"),
    /** 冲正-表外代其他机构保管登记 */
    ES886("ES886"),
    /** 冲正-表外实物销记 */
    ES887("ES887"),
    /** 冲正-表外实物登记 */
    ES888("ES888"),
    /** 发出付款确认实物被退回 */
    ES980("ES980"),
    /** 发出付款确认实物（直贴未转卖票据） */
    ES981("ES981"),
    /** 商业承兑汇票电票表外解押 */
    ES982("ES982"),
    /** 银行承兑汇票电票表外解押 */
    ES983("ES983"),
    /** 商业承兑汇票纸票表外解押 */
    ES984("ES984"),
    /** 银行承兑汇票纸票表外解押 */
    ES985("ES985"),
    /** 商业承兑汇票电票表外登记 */
    ES986("ES986"),
    /** 银行承兑汇票电票表外登记 */
    ES987("ES987"),
    /** 商业承兑汇票纸票表外登记 */
    ES988("ES988"),
    /** 银行承兑汇票纸票表外登记 */
    ES989("ES989"),
    /** 表外托收拒付 */
    ES990("ES990"),
    /** 表外托收登记 */
    ES991("ES991"),
    /** 表外代客托收被拒付 */
    ES992("ES992"),
    /** 表外代客托收 */
    ES993("ES993"),
    /** 表外代其他机构保管登记 */
    ES994("ES994"),
    /** 表外代其他机构保管销记 */
    ES995("ES995"),
    /** 表外其他机构代保管登记 */
    ES996("ES996"),
    /** 表外其他机构代保管销记 */
    ES997("ES997"),
    /** 表外实物销记 */
    ES998("ES998"),
    /** 表外实物登记 */
    ES999("ES999"),
    /** 冲正-贴现利息支出（折价） */
    ESDR("ESDR"),
    /** 贴现利息支出（折价） */
    ESDS("ESDS"),
    /** 持有兼出售模式贴现银行承兑汇票转让支出 */
    ESDS1("ESDS1"),
    /** 冲正-持有兼出售模式贴现银行承兑汇票转让支出 */
    ESDS2("ESDS2"),
    /** 持有兼出售模式贴现商业承兑汇票转让支出 */
    ESDS3("ESDS3"),
    /** 冲正-持有兼出售模式贴现商业承兑汇票转让支出 */
    ESDS4("ESDS4"),
    /** 持有兼出售模式转贴现银行承兑汇票投资收益(折价) */
    ESDS5("ESDS5"),
    /** 冲正-持有兼出售模式转贴现银行承兑汇票投资收益(折价) */
    ESDS6("ESDS6"),
    /** 贴现利息支出冲正 */
    ESDSR("ESDSR"),
    /** 贴现利息收入（溢价） */
    ESPR("ESPR"),
    /** 持有兼出售模式贴现银行承兑汇票转让收入 */
    ESPR1("ESPR1"),
    /** 冲正-持有兼出售模式贴现银行承兑汇票转让收入 */
    ESPR2("ESPR2"),
    /** 持有兼出售模式贴现商业承兑汇票转让收入 */
    ESPR3("ESPR3"),
    /** 冲正-持有兼出售模式贴现商业承兑汇票转让收入 */
    ESPR4("ESPR4"),
    /** 持有兼出售模式转贴现银行承兑汇票投资收益(溢价) */
    ESPR5("ESPR5"),
    /** 冲正-持有兼出售模式转贴现银行承兑汇票投资收益(溢价) */
    ESPR6("ESPR6"),
    /** 贴现利息收入冲正 */
    ESPRR("ESPRR"),
    /** 冲正-贴现利息收入（溢价） */
    ESPS("ESPS"),
    /** 商户金融消金发放贷款转账-贷方 */
    FB01("FB01"),
    /** 商户金融消金发放贷款转账-贷方-冲销 */
    FB02("FB02"),
    /** 商户金融消金发放贷款转账-借方 */
    FB03("FB03"),
    /** 商户金融消金发放贷款转账-借方-冲销 */
    FB04("FB04"),
    /** 商户金融实时扣款 */
    FB05("FB05"),
    /** 商户金融实时扣款-冲销 */
    FB06("FB06"),
    /** 商户金融实时退款 */
    FB07("FB07"),
    /** 商户金融实时退款-冲销 */
    FB08("FB08"),
    /** 晋商E付超级网银贷记往账提现 */
    FB132("FB132"),
    /** 神州数码E付超级网银贷记往账提现 */
    FB13("FB13"),
    /** 冲正-晋商E付超级网银贷记往账提现 */
    FB142("FB142"),
    /** 冲正-神州数码E付超级网银贷记往账提现 */
    FB14("FB14"),
    /** 晋商E付贷记来账 */
    FB172("FB172"),
    /** 神州数码E付贷记来账 */
    FB17("FB17"),
    /** 冲正-晋商E付贷记来账 */
    FB182("FB182"),
    /** 冲正-神州数码E付贷记来账 */
    FB18("FB18"),
    /** 商户清算 */
    FB19("FB19"),
    /** 商户清算-冲销 */
    FB20("FB20"),
    /** 现金收费-冲销 */
    FECR("FECR"),
    /** 转账收费 */
    FEE1("FEE1"),
    /** 通用费用支出-借记 */
    FEE11("FEE11"),
    /** 通用费用支出-借记-冲正 */
    FEE12("FEE12"),
    /** 费用转账退费 */
    FEE13("FEE13"),
    /** 费用调整 */
    FEE132("FEE132"),
    /** 费用转账退费冲正 */
    FEE14("FEE14"),
    /** 费用调整冲正 */
    FEE142("FEE142"),
    /** 费用现金退回 */
    FEE15("FEE15"),
    /** 现金退费 */
    FEE152("FEE152"),
    /** 费用现金退回-冲正 */
    FEE16("FEE16"),
    /** 现金退费-冲正 */
    FEE162("FEE162"),
    /** 现金收费 */
    FEE2("FEE2"),
    /** 费用收入-内部户核销 */
    FEEI1("FEEI1"),
    /** 费用收入-内部户核销-冲销 */
    FEEI1R("FEEI1R"),
    /** 费用收入手工核销 */
    FEEI2("FEEI2"),
    /** 费用收入手工核销-冲销 */
    FEEI2R("FEEI2R"),
    /** 费用收入每日预提 */
    FEEIYT("FEEIYT"),
    /** 费用收入每日预提-冲销 */
    FEEIYTR("FEEIYTR"),
    /** 费用支出 */
    FEEO1("FEEO1"),
    /** 费用支出-冲销 */
    FEEO2("FEEO2"),
    /** 费用支出确认 */
    FEEO3("FEEO3"),
    /** 费用支出确认-冲销 */
    FEEO4("FEEO4"),
    /** 费用支出计提 */
    FEEOACR("FEEOACR"),
    /** 费用支出计提-冲销 */
    FEEOACRR("FEEOACRR"),
    /** 费用支出待摊销 */
    FEEOAM("FEEOAM"),
    /** 费用支出待摊销-冲销 */
    FEEOAMR("FEEOAMR"),
    /** 费用支出预提 */
    FEEOYT("FEEOYT"),
    /** 费用支出预提-冲销 */
    FEEOYTR("FEEOYTR"),
    /** 费用付费-不摊销 */
    FEEP("FEEP"),
    /** 费用付费-摊销 */
    FEEPP("FEEPP"),
    /** 费用付费-摊销-冲销 */
    FEEPPR("FEEPPR"),
    /** 费用付费-不摊销-冲销 */
    FEEPR("FEEPR"),
    /** 转账收费-冲销 */
    FEER2("FEER2"),
    /** 费用收取-不摊销 */
    FEER("FEER"),
    /** 费用收取-摊销 */
    FEERP("FEERP"),
    /** 费用收取-摊销-冲销 */
    FEERPR("FEERPR"),
    /** 费用收取-不摊销-冲销 */
    FEERR("FEERR"),
    /** 财务系统跨行转出 */
    FM01("FM01"),
    /** 财务系统跨行转出-冲正 */
    FM02("FM02"),
    /** 财务系统行内转账支取 */
    FM03("FM03"),
    /** 财务系统行内转账支取-冲销 */
    FM04("FM04"),
    /** 财务系统行内转账存入 */
    FM05("FM05"),
    /** 财务系统行内转账存入-冲销 */
    FM06("FM06"),
    /** 跨行实时贷记往账 */
    FP01("FP01"),
    /** 冲正-跨行实时贷记往账 */
    FP02("FP02"),
    /** 跨行实时贷记来账 */
    FP03("FP03"),
    /** 冲正-跨行实时贷记来账 */
    FP04("FP04"),
    /** 跨行实时借记往账 */
    FP05("FP05"),
    /** 冲正-跨行实时借记往账 */
    FP06("FP06"),
    /** 跨行实时借记来账 */
    FP07("FP07"),
    /** 冲正-跨行实时借记来账 */
    FP08("FP08"),
    /** 跨行实时轧差清算(借记人行) */
    FP13("FP13"),
    /** 冲正-跨行实时轧差清算(借记人行) */
    FP14("FP14"),
    /** 跨行实时轧差清算(贷记人行) */
    FP19("FP19"),
    /** 冲正-跨行实时轧差清算(贷记人行) */
    FP20("FP20"),
    /** 跨行网银信用卡贷记来账 */
    FP89("FP89"),
    /** 冲正-跨行网银信用卡贷记来账 */
    FP90("FP90"),
    /** 非应计贷款回收 */
    FREC("FREC"),
    /** 资产转让后非应计贷款回收 */
    FRECT("FRECT"),
    /** 资产转让后非应计贷款回收-冲销 */
    FRECTR("FRECTR"),
    /** 非应计贷款回收-冲销 */
    FRER("FRER"),
    /** 基金转账存入 */
    FU01("FU01"),
    /** 基金转账存入-冲销 */
    FU02("FU02"),
    /** 基金转账支取 */
    FU03("FU03"),
    /** 基金转账支取-冲销 */
    FU04("FU04"),
    /** 结汇cashtocash */
    FX01("FX01"),
    /** 结汇cashtoA/C */
    FX02("FX02"),
    /** 结汇A/Ctocash */
    FX03("FX03"),
    /** 结汇A/CtoA/C */
    FX04("FX04"),
    /** 结汇A/CtoA/C转账支取 */
    FX05("FX05"),
    /** 售汇cashtocash */
    FX06("FX06"),
    /** 售汇cashtoA/C */
    FX07("FX07"),
    /** 售汇A/Ctocash */
    FX08("FX08"),
    /** 售汇A/CtoA/C */
    FX09("FX09"),
    /** 售汇A/CtoA/C转账支取 */
    FX10("FX10"),
    /** 外汇兑换cashtocash */
    FX11("FX11"),
    /** 外汇兑换cashtocash */
    FX11C("FX11C"),
    /** 外汇兑换cashtocash */
    FX11D("FX11D"),
    /** 外汇兑换cashtocash */
    FX11M("FX11M"),
    /** 外汇兑换cashtoA/C */
    FX12("FX12"),
    /** 外汇兑换cashtoA/C */
    FX12C("FX12C"),
    /** 外汇兑换cashtoA/C */
    FX12D("FX12D"),
    /** 外汇兑换cashtoA/C */
    FX12M("FX12M"),
    /** 外汇兑换A/Ctocash */
    FX13("FX13"),
    /** 外汇兑换A/Ctocash */
    FX13C("FX13C"),
    /** 外汇兑换A/Ctocash */
    FX13D("FX13D"),
    /** 外汇兑换A/Ctocash */
    FX13M("FX13M"),
    /** 外汇兑换A/CtoA/C */
    FX15("FX15"),
    /** 外汇兑换A/CtoA/C */
    FX15C("FX15C"),
    /** 外汇兑换A/CtoA/C */
    FX15M("FX15M"),
    /** 外汇兑换A/CtoA/C转账支取 */
    FX16("FX16"),
    /** 外汇兑换A/CtoA/C */
    FX16D("FX16D"),
    /** 冲正-结汇cashtocash */
    FX17("FX17"),
    /** 冲正-结汇cashtoA/C */
    FX18("FX18"),
    /** 冲正-结汇A/Ctocash */
    FX19("FX19"),
    /** 冲正-结汇A/CtoA/C */
    FX20("FX20"),
    /** 冲正-结汇A/CtoA/C转账支取 */
    FX21("FX21"),
    /** 冲正-售汇cashtocash */
    FX22("FX22"),
    /** 冲正-售汇cashtoA/C */
    FX23("FX23"),
    /** 冲正-售汇A/Ctocash */
    FX24("FX24"),
    /** 冲正-售汇A/CtoA/C */
    FX25("FX25"),
    /** 冲正-售汇A/CtoA/C转账支取 */
    FX26("FX26"),
    /** 冲正-外汇兑换cashtocash */
    FX27("FX27"),
    /** 冲正-外汇兑换cashtoA/C */
    FX28("FX28"),
    /** 冲正-外汇兑换A/Ctocash */
    FX29("FX29"),
    /** 冲正-外汇兑换A/CtoA/C */
    FX30("FX30"),
    /** 冲正-外汇兑换A/CtoA/C转账支取 */
    FX31("FX31"),
    /** 冲正-外汇兑换cashtocash */
    FX31C("FX31C"),
    /** 冲正-外汇兑换cashtocash */
    FX31D("FX31D"),
    /** 冲正-外汇兑换cashtocash */
    FX31M("FX31M"),
    /** 平盘买入 */
    FX32("FX32"),
    /** 冲正-外汇兑换cashtoA/C */
    FX32C("FX32C"),
    /** 冲正-外汇兑换cashtoA/C */
    FX32D("FX32D"),
    /** 冲正-外汇兑换cashtoA/C */
    FX32M("FX32M"),
    /** 平盘卖出 */
    FX33("FX33"),
    /** 冲正-外汇兑换A/Ctocash */
    FX33C("FX33C"),
    /** 冲正-外汇兑换A/Ctocash */
    FX33D("FX33D"),
    /** 冲正-外汇兑换A/Ctocash */
    FX33M("FX33M"),
    /** 平盘收益 */
    FX34("FX34"),
    /** 平盘损失 */
    FX35("FX35"),
    /** 冲正-外汇兑换A/CtoA/C */
    FX35C("FX35C"),
    /** 冲正-外汇兑换A/CtoA/C */
    FX35M("FX35M"),
    /** 系统内头寸平补借方 */
    FX36("FX36"),
    /** 冲正-外汇兑换A/CtoA/C */
    FX36D("FX36D"),
    /** 系统内头寸平补贷方 */
    FX37("FX37"),
    /** 市场头寸平补借方 */
    FX38("FX38"),
    /** 市场头寸平补贷方 */
    FX39("FX39"),
    /** 系统内头寸平补借方-冲正 */
    FX40("FX40"),
    /** 系统内头寸平补贷方-冲正 */
    FX41("FX41"),
    /** 冲正-平盘买入 */
    FX42("FX42"),
    /** 冲正-平盘卖出 */
    FX43("FX43"),
    /** 冲正-平盘收益 */
    FX44("FX44"),
    /** 冲正-平盘损失 */
    FX45("FX45"),
    /** 市场头寸平补借方-冲正 */
    FX46("FX46"),
    /** 市场头寸平补贷方-冲正 */
    FX47("FX47"),
    /** 钞汇互转cashtoA/C */
    FX48("FX48"),
    /** 钞汇互转A/Ctocash */
    FX49("FX49"),
    /** 钞汇互转A/CtoA/C */
    FX50("FX50"),
    /** 钞汇互转A/CtoA/C转账支取 */
    FX51("FX51"),
    /** 冲正-钞汇互转cashtoA/C */
    FX52("FX52"),
    /** 冲正-钞汇互转A/Ctocash */
    FX53("FX53"),
    /** 冲正-钞汇互转A/CtoA/C */
    FX54("FX54"),
    /** 冲正-钞汇互转A/CtoA/C转账支取 */
    FX55("FX55"),
    /** 对客结售汇借方 */
    FX56("FX56"),
    /** 对客结售汇贷方 */
    FX57("FX57"),
    /** 钞汇互转套汇借方 */
    FX58("FX58"),
    /** 钞汇互转套汇贷方 */
    FX59("FX59"),
    /** 对客结售汇借方-冲正 */
    FX60("FX60"),
    /** 对客结售汇贷方-冲正 */
    FX61("FX61"),
    /** 钞汇互转套汇借方-冲正 */
    FX62("FX62"),
    /** 钞汇互转套汇贷方-冲正 */
    FX63("FX63"),
    /** 结售汇收益借方 */
    FX64("FX64"),
    /** 结售汇损失 */
    FX65("FX65"),
    /** 钞汇互转收益借方 */
    FX66("FX66"),
    /** 市场平盘损失贷方 */
    FX67("FX67"),
    /** 结售汇收益借方-冲正 */
    FX68("FX68"),
    /** 结售汇损失-冲正 */
    FX69("FX69"),
    /** 钞汇互转收益借方-冲正 */
    FX70("FX70"),
    /** 市场平盘损失贷方-冲正 */
    FX71("FX71"),
    /** 市场平盘收益借方 */
    FX72("FX72"),
    /** 市场平盘收益借方-冲正 */
    FX73("FX73"),
    /** 钞汇互转收益贷方 */
    FX74("FX74"),
    /** 钞汇互转收益贷方-冲正 */
    FX75("FX75"),
    /** 国结清算-借记 */
    GJ01("GJ01"),
    /** 国结清算-借记-冲正 */
    GJ02("GJ02"),
    /** 国结清算-贷记 */
    GJ03("GJ03"),
    /** 国结清算-贷记-冲正 */
    GJ04("GJ04"),
    /** 国库实时扣税 */
    GK01("GK01"),
    /** 国库实时扣税-冲正 */
    GK02("GK02"),
    /** 国库现金缴款 */
    GK03("GK03"),
    /** 国库现金缴款-冲正 */
    GK04("GK04"),
    /** 国库差错退款 */
    GK05("GK05"),
    /** 国库差错退款-冲正 */
    GK06("GK06"),
    /** 小额汇兑往账(Comstar) */
    GL19("GL19"),
    /** 冲正-小额汇兑往账(Comstar) */
    GL20("GL20"),
    /** 大额汇兑往账(Comstar) */
    GL21("GL21"),
    /** 冲正-大额汇兑往账(Comstar) */
    GL22("GL22"),
    /** 资金系统从分行备份金到暂记户 */
    GL27("GL27"),
    /** 资金系统从分行备份金到暂记户-冲正 */
    GL28("GL28"),
    /** 现金购买国债 */
    GZ01("GZ01"),
    /** 现金购买国债-冲销 */
    GZ02("GZ02"),
    /** 转账购买凭证式国债支取 */
    GZ03("GZ03"),
    /** 转账购买凭证式国债支取-冲销 */
    GZ04("GZ04"),
    /** 转账购国债支取 */
    GZ05("GZ05"),
    /** 转账购国债支取-冲销 */
    GZ06("GZ06"),
    /** 国债现金兑付 */
    GZ07("GZ07"),
    /** 国债现金兑付-冲销 */
    GZ08("GZ08"),
    /** 凭证国债转账兑付存入 */
    GZ09("GZ09"),
    /** 凭证国债转账兑付存入-冲销 */
    GZ10("GZ10"),
    /** 国债转账提前兑付存入 */
    GZ17("GZ17"),
    /** 国债转账提前兑付存入-冲销 */
    GZ18("GZ18"),
    /** 国债强制扣划 */
    GZ30("GZ30"),
    /** 国债强制扣划-冲正 */
    GZ31("GZ31"),
    /** 国债自动兑付 */
    GZ34("GZ34"),
    /** 国债自动兑付-冲正 */
    GZ35("GZ35"),
    /** 国债兑付定期-存入 */
    GZ36("GZ36"),
    /** 国债划回兑付利息-冲销 */
    GZ37("GZ37"),
    /** 转账购买凭证式国债存入 */
    GZ40("GZ40"),
    /** 购买凭证式国债存入 */
    GZ402("GZ402"),
    /** 转账购买凭证式国债存入-冲销 */
    GZ41("GZ41"),
    /** 购买凭证式国债存入-冲销 */
    GZ412("GZ412"),
    /** 转账购国债存入 */
    GZ42("GZ42"),
    /** 转账购国债存入-冲销 */
    GZ43("GZ43"),
    /** 凭证国债转账兑付支取 */
    GZ44("GZ44"),
    /** 凭证国债兑付支取 */
    GZ442("GZ442"),
    /** 凭证国债转账兑付支取-冲销 */
    GZ45("GZ45"),
    /** 凭证国债兑付支取-冲销 */
    GZ452("GZ452"),
    /** 国债转账提前兑付支取 */
    GZ46("GZ46"),
    /** 国债转账提前兑付支取-冲销 */
    GZ47("GZ47"),
    /** 国债发行款上缴财政支取 */
    GZ48("GZ48"),
    /** 国债发行款上缴财政支取-冲销 */
    GZ49("GZ49"),
    /** 国债发行款上缴财政存入 */
    GZ50("GZ50"),
    /** 国债发行款上缴财政存入-冲销 */
    GZ51("GZ51"),
    /** 凭证国债我行持有本金-转出 */
    GZ52("GZ52"),
    /** 凭证国债我行持有本金-转入 */
    GZ53("GZ53"),
    /** 凭证国债利息确认 */
    GZ54("GZ54"),
    /** 凭证国债我行持有到期-转入 */
    GZ55("GZ55"),
    /** 凭证国债我行持有本金-转出-冲销 */
    GZ56("GZ56"),
    /** 凭证国债我行持有本金-转入-冲销 */
    GZ57("GZ57"),
    /** 凭证国债利息确认-冲销 */
    GZ58("GZ58"),
    /** 凭证国债我行持有到期-转入-冲销 */
    GZ59("GZ59"),
    /** 国债划回兑付利息 */
    GZ73("GZ73"),
    /** 国债划回提前兑付（代付利息转出） */
    GZ74("GZ74"),
    /** 国债划回提前兑付（兑付款项） */
    GZ75("GZ75"),
    /** 国债划回提前兑付(兑付本金/利息） */
    GZ76("GZ76"),
    /** 国债划回提前兑付(利息确认) */
    GZ77("GZ77"),
    /** 国债划回到期兑付本金 */
    GZ78("GZ78"),
    /** 国债划回到期兑付本金-冲销 */
    GZ80("GZ80"),
    /** 国债划回提前兑付(利息确认)-冲销 */
    GZ81("GZ81"),
    /** 国债划回提前兑付(兑付本金/利息）-冲销 */
    GZ82("GZ82"),
    /** 国债划回提前兑付（兑付款项）-冲销 */
    GZ83("GZ83"),
    /** 国债划回提前兑付（代付利息转出）-冲销 */
    GZ84("GZ84"),
    /** 国债转账提前兑付支取(利息) */
    GZ85("GZ85"),
    /** 国债转账提前兑付支取(利息)-冲销 */
    GZ86("GZ86"),
    /** 转投资包销模式-转出 */
    GZ87("GZ87"),
    /** 转投资包销模式-转出-冲销 */
    GZ88("GZ88"),
    /** 转投资包销模式-转入 */
    GZ89("GZ89"),
    /** 转投资包销模式-转入-冲销 */
    GZ90("GZ90"),
    /** 投资转回包销模式-转出 */
    GZ91("GZ91"),
    /** 投资转回包销模式-转出-冲销 */
    GZ92("GZ92"),
    /** 投资转回包销模式-转入 */
    GZ93("GZ93"),
    /** 投资转回包销模式-转入-冲销 */
    GZ94("GZ94"),
    /** 投资转回包销模式-转出 */
    GZ95("GZ95"),
    /** 投资转回包销模式-转出-冲销 */
    GZ96("GZ96"),
    /** 投资转回包销模式-转入 */
    GZ97("GZ97"),
    /** 投资转回包销模式-转入-冲销 */
    GZ98("GZ98"),
    /** 国债兑付定期-存入-冲正 */
    GZ99("GZ99"),
    /** 利差转回贷方 */
    GZA1("GZA1"),
    /** 利差转回贷方-冲销 */
    GZA2("GZA2"),
    /** 利差转回借方 */
    GZA3("GZA3"),
    /** 利差转回借方-冲销 */
    GZA4("GZA4"),
    /** 互联网金融往来-借记 */
    H001("H001"),
    /** 互联网金融往来-借记-冲正 */
    H002("H002"),
    /** 互联网金融往来-贷记 */
    H003("H003"),
    /** 互联网金融往来-贷记-冲正 */
    H004("H004"),
    /** 互联网金融扣划-贷记 */
    H005("H005"),
    /** 互联网金融扣划-贷记-冲正 */
    H006("H006"),
    /** 假币上缴 */
    HAO("HAO"),
    /** 结清后收益 */
    IAS("IAS"),
    /** 结清后收益-冲正 */
    IASR("IASR"),
    /** 电子钱包现金充值 */
    IC01("IC01"),
    /** 电子钱包现金充值-冲销 */
    IC02("IC02"),
    /** 电子钱包行内账户圈存 */
    IC03("IC03"),
    /** 电子钱包他代本圈存-银联 */
    IC04("IC04"),
    /** 电子现金账户现金圈提 */
    IC05("IC05"),
    /** 电子现金账户现金圈提-冲销 */
    IC06("IC06"),
    /** 电子现金账户圈提结清-到现金 */
    IC10("IC10"),
    /** 电子现金账户圈提-到客户帐 */
    IC11("IC11"),
    /** 电子钱包行内账户圈存-银联 */
    IC12("IC12"),
    /** 脱机消费 */
    IC13("IC13"),
    /** 脱机消费退货 */
    IC14("IC14"),
    /** 电子钱包行内账户圈存-冲销 */
    IC15("IC15"),
    /** 电子钱包他代本圈存-银联-冲销 */
    IC17("IC17"),
    /** 电子钱包现金充值银联-冲销 */
    IC18("IC18"),
    /** 电子现金账户圈提-到客户帐-冲销 */
    IC19("IC19"),
    /** 电子钱包行内账户圈存-银联-冲销 */
    IC20("IC20"),
    /** 电子钱包现金充值银联 */
    IC22("IC22"),
    /** 电子钱包现金挂失销户到期转营业外 */
    IC23("IC23"),
    /** ATM电子钱包现金行内充值 */
    IC24("IC24"),
    /** ATM电子钱包现金行内充值-冲销 */
    IC25("IC25"),
    /** ATM电子钱包行内账户圈存 */
    IC26("IC26"),
    /** ATM电子钱包行内账户圈存-冲销 */
    IC27("IC27"),
    /** 电子钱包自动圈存 */
    IC28("IC28"),
    /** 电子钱包自动圈存-冲销 */
    IC29("IC29"),
    /** 电子现金账户圈提结清-到现金-冲销 */
    IC30("IC30"),
    /** 本行POS指定账户圈存 -冲正 */
    IC31("IC31"),
    /** 本行POS非指定账户圈存 */
    IC32("IC32"),
    /** 本行POS指定账户圈存 */
    IC33("IC33"),
    /** 本行POS指定账户圈存 -冲正 */
    IC34("IC34"),
    /** 提入贷方 */
    ICNN("ICNN"),
    /** 提入贷方-冲销 */
    ICNR("ICNR"),
    /** 提入贷方退票 */
    ICRN("ICRN"),
    /** 提入贷方退票-冲销 */
    ICRR("ICRR"),
    /** 提入借方 */
    IDNN("IDNN"),
    /** 提入借方-冲销 */
    IDNR("IDNR"),
    /** 提入借方退票 */
    IDRN("IDRN"),
    /** 提入借方退票-冲销 */
    IDRR("IDRR"),
    /** 互联网信贷放款 */
    IM01("IM01"),
    /** 互联网信贷回收 */
    IM02("IM02"),
    /** 互联网信贷手续费收取 */
    IM03("IM03"),
    /** 互联网信贷放款-冲正 */
    IM04("IM04"),
    /** 互联网信贷回收-冲正 */
    IM05("IM05"),
    /** 互联网信贷手续费收取-冲正 */
    IM06("IM06"),
    /** 消金实时还款 */
    IM07("IM07"),
    /** 消金实时还款-冲销 */
    IM08("IM08"),
    /** 存款利息摊销 */
    INAM("INAM"),
    /** 负债利息转入 */
    INGD("INGD"),
    /** 负债利息转入-冲销 */
    INGR("INGR"),
    /** 押品入库 */
    INS("INS"),
    /** 内部账户结息(资产)-冲销 */
    INT5("INT5"),
    /** 内部账户结息(负债)-冲正 */
    INT6("INT6"),
    /** 资产利息转入 */
    INTC("INTC"),
    /** 资产利息转入-冲销 */
    INTCR("INTCR"),
    /** 利息转入 */
    INTD("INTD"),
    /** (负债)利息入第三方账户--负利率 */
    INTDF("INTDF"),
    /** (资产)利息入第三方账户--负利率-冲销 */
    INTF5("INTF5"),
    /** (负债)利息入第三方账户--负利率-冲正 */
    INTF6("INTF6"),
    /** 利息转入-冲销 */
    INTR("INTR"),
    /** 贷款利息返还 */
    IREC("IREC"),
    /** 国结损益转账支取-冲销 */
    IS01("IS01"),
    /** 国结损益转账支取 */
    IS02("IS02"),
    /** 国结损益转账存入-冲销 */
    IS03("IS03"),
    /** 国结损益转账存入 */
    IS04("IS04"),
    /** 国结存入保证金-借记-冲销 */
    IS05("IS05"),
    /** 国结存入保证金-借记 */
    IS06("IS06"),
    /** 国结存入保证金-贷记-冲销 */
    IS07("IS07"),
    /** 国结存入保证金-贷记 */
    IS08("IS08"),
    /** 国结退回保证金-借记-冲销 */
    IS09("IS09"),
    /** 国结退回保证金-借记 */
    IS10("IS10"),
    /** 国结退回保证金-贷记-冲销 */
    IS11("IS11"),
    /** 国结退回保证金-贷记 */
    IS12("IS12"),
    /** 贴现转出 */
    ISDTF("ISDTF"),
    /** 贴现转冲正 */
    ISDTFR("ISDTFR"),
    /** 贴现转入 */
    ISDTT("ISDTT"),
    /** 贴现转入冲正 */
    ISDTTR("ISDTTR"),
    /** 代保管物品入库 */
    ITEM_IN("ITEM_IN"),
    /** 代保管物品出库或删除 */
    ITEM_OUT("ITEM_OUT"),
    /** 久悬未取款 */
    JX01("JX01"),
    /** 久悬未取款强制扣划 */
    JX012("JX012"),
    /** 久悬未取款(司法扣划)--冲正 */
    JX02("JX02"),
    /** 集中作业转账存入 */
    JZ01("JZ01"),
    /** 集中作业转账存入-冲销 */
    JZ02("JZ02"),
    /** 集中作业转账支取 */
    JZ03("JZ03"),
    /** 集中作业转账支取-冲销 */
    JZ04("JZ04"),
    /** 晋惠宝转账转入 */
    KY01("KY01"),
    /** 晋惠宝转账转入-冲销 */
    KY02("KY02"),
    /** 晋惠宝转账支取 */
    KY03("KY03"),
    /** 晋惠宝转账支取-冲销 */
    KY04("KY04"),
    /** 理财购买-借记 */
    LC01("LC01"),
    /** 理财购买-借记-冲正 */
    LC02("LC02"),
    /** 理财购买-贷记 */
    LC03("LC03"),
    /** 理财购买-贷记-冲正 */
    LC04("LC04"),
    /** 理财赎回-借记 */
    LC05("LC05"),
    /** 理财赎回-借记-冲正 */
    LC06("LC06"),
    /** 理财赎回-贷记 */
    LC07("LC07"),
    /** 理财赎回-贷记-冲正 */
    LC08("LC08"),
    /** 已丢失凭证修改为未使用 */
    LCB_NUS("LCB_NUS"),
    /** 借出印鉴卡丢失后冲正 */
    LCB_WAY("LCB_WAY"),
    /** 凭证出库解除锁定 */
    LOC_NUS("LOC_NUS"),
    /** 锁定未使用凭证在途 */
    LOC_WAY("LOC_WAY"),
    /** 抵债资产处置(损毁) */
    MAR("MAR"),
    /** 无卡支付-贷记付款 */
    NP01("NP01"),
    /** 无卡支付-贷记付款-冲销 */
    NP02("NP02"),
    /** 无卡支付-协议支付 */
    NP03("NP03"),
    /** 无卡支付-协议支付-冲销 */
    NP04("NP04"),
    /** 无卡支付-退货 */
    NP05("NP05"),
    /** 无卡支付-退货-冲销 */
    NP06("NP06"),
    /** 无卡支付-直接支付 */
    NP07("NP07"),
    /** 无卡支付-直接支付-冲销 */
    NP08("NP08"),
    /** 无卡快捷支付调账-存入 */
    NP09("NP09"),
    /** 无卡快捷支付调账-支取 */
    NP10("NP10"),
    /** 非应计转回 */
    NPP("NPP"),
    /** 呆账转回呆滞 */
    NPPD("NPPD"),
    /** 未使用凭证非本行入库 */
    NULL_NUS("null_NUS"),
    /** 未使用凭证使用 */
    NUS_ACT("NUS_ACT"),
    /** 未使用凭证修改为作废 */
    NUS_CAN("NUS_CAN"),
    /** 未使用凭证修改为丢失 */
    NUS_LCB("NUS_LCB"),
    /** 凭证预约确认锁定 */
    NUS_LOC("NUS_LOC"),
    /** 未使用凭证出库（他行） */
    NUS_NULL("NUS_null"),
    /** 未使用的凭证修改为使用 */
    NUS_USE("NUS_USE"),
    /** 未使用凭证在途 */
    NUS_WAY("NUS_WAY"),
    /** 未使用凭证修改为待销毁 */
    NUS_WDE("NUS_WDE"),
    /** 提出贷方 */
    OCNN("OCNN"),
    /** 提出贷方-冲销 */
    OCNR("OCNR"),
    /** 提出贷方被退票 */
    OCRN("OCRN"),
    /** 提出贷方被退票-冲销 */
    OCRR("OCRR"),
    /** 提出借方 */
    ODNN("ODNN"),
    /** 提出借方-冲销 */
    ODNR("ODNR"),
    /** 债转股 */
    ODR("ODR"),
    /** 债转股冲正 */
    ODR1("ODR1"),
    /** 提出借方被退票 */
    ODRN("ODRN"),
    /** 提出借方被退票-冲销 */
    ODRR("ODRR"),
    /** 保函开立撤销 */
    OPEN("OPEN"),
    /** 保函开立 */
    OPN("OPN"),
    /** 异常入账 */
    OTCR("OTCR"),
    /** 异常入账-冲销 */
    OTDR("OTDR"),
    /** 押品出库 */
    OUS("OUS"),
    /** 抵债资产处置(自用) */
    OWN("OWN"),
    /** 大额金融机构普贷往账 */
    P001("P001"),
    /** 冲正-大额金融机构普贷往账 */
    P002("P002"),
    /** 大额金融机构普贷来账 */
    P003("P003"),
    /** 冲正-大额金融机构普贷来账 */
    P004("P004"),
    /** 小额金融机构普贷往账 */
    P005("P005"),
    /** 冲正-小额金融机构普贷往账 */
    P006("P006"),
    /** 小额金融机构普贷来账 */
    P007("P007"),
    /** 冲正-小额金融机构普贷来账 */
    P008("P008"),
    /** 大额汇兑往账 */
    P009("P009"),
    /** 冲正-大额汇兑往账 */
    P010("P010"),
    /** 大额客户普贷来账 */
    P011("P011"),
    /** 冲正-大额客户普贷来账 */
    P012("P012"),
    /** 小额汇兑往账 */
    P013("P013"),
    /** 冲正-小额汇兑往账 */
    P014("P014"),
    /** 小额客户普贷来账 */
    P015("P015"),
    /** 冲正-小额客户普贷来账 */
    P016("P016"),
    /** 小额跨行实时汇款往账 */
    P017("P017"),
    /** 冲正-小额跨行实时汇款往账 */
    P018("P018"),
    /** 小额跨行实时汇款来账 */
    P019("P019"),
    /** 冲正-小额跨行实时汇款来账 */
    P020("P020"),
    /** 大额金融机构跨境往账 */
    P021("P021"),
    /** 冲正-大额金融机构跨境往账 */
    P022("P022"),
    /** 大额金融机构跨境来账 */
    P023("P023"),
    /** 冲正-大额金融机构跨境来账 */
    P024("P024"),
    /** 大额客户跨境往账 */
    P025("P025"),
    /** 冲正-大额客户跨境往账 */
    P026("P026"),
    /** 大额客户跨境来账 */
    P027("P027"),
    /** 冲正-大额客户跨境来账 */
    P028("P028"),
    /** 大额托收往账 */
    P029("P029"),
    /** 冲正-大额托收往账 */
    P030("P030"),
    /** 大额托收来账 */
    P031("P031"),
    /** 冲正-大额托收来账 */
    P032("P032"),
    /** 小额托收往账 */
    P033("P033"),
    /** 冲正-小额托收往账 */
    P034("P034"),
    /** 小额托收来账 */
    P035("P035"),
    /** 冲正-小额托收来账 */
    P036("P036"),
    /** 定期贷记往账 */
    P041("P041"),
    /** 冲正-定期贷记往账 */
    P042("P042"),
    /** 定期贷记来账 */
    P043("P043"),
    /** 冲正-定期贷记来账 */
    P044("P044"),
    /** 兑付-银行本票(小额) */
    P055("P055"),
    /** 冲正-兑付-银行本票(小额) */
    P056("P056"),
    /** 汇票实时截留往账(回执入账) */
    P057("P057"),
    /** 冲正-汇票实时截留往账(回执入账) */
    P058("P058"),
    /** 银行汇票资金移存 */
    P063("P063"),
    /** 冲正-银行汇票资金移存 */
    P064("P064"),
    /** 城商行汇票多余资金划回 */
    P069("P069"),
    /** 冲正-城商行汇票多余资金划回 */
    P070("P070"),
    /** 城商行汇票逾期退回 */
    P073("P073"),
    /** 城商行汇票未用退回 */
    P074("P074"),
    /** 城商行汇票资金清算来账 */
    P075("P075"),
    /** 冲正-城商行汇票资金清算来账 */
    P076("P076"),
    /** 小额退汇来账 */
    P079("P079"),
    /** 冲正-小额退汇来账 */
    P080("P080"),
    /** 大额退汇来账 */
    P081("P081"),
    /** 冲正-大额退汇来账 */
    P082("P082"),
    /** 大额退汇往账 */
    P083("P083"),
    /** 冲正-大额退汇往账 */
    P084("P084"),
    /** 小额贷记退汇往账 */
    P085("P085"),
    /** 冲正-小额贷记退汇往账 */
    P086("P086"),
    /** 定期借记回执来账 */
    P087("P087"),
    /** 冲正-定期借记回执来账 */
    P088("P088"),
    /** 定期借记回执往账 */
    P089("P089"),
    /** 冲正-定期借记回执往账 */
    P090("P090"),
    /** 同业拆借往账 */
    P093("P093"),
    /** 冲正-同业拆借往账 */
    P094("P094"),
    /** 同业拆借来账 */
    P095("P095"),
    /** 冲正-同业拆借来账 */
    P096("P096"),
    /** 普通支票截留回执业务 */
    P099("P099"),
    /** 冲正-普通支票截留回执业务 */
    P100("P100"),
    /** 实时代付来账(付款方) */
    P103("P103"),
    /** 冲正-实时代付来账(付款方) */
    P104("P104"),
    /** 实时代付来账(收款方) */
    P105("P105"),
    /** 冲正-实时代付来账(收款方) */
    P106("P106"),
    /** 批量代收来账 */
    P107("P107"),
    /** 冲正-批量代收来账 */
    P108("P108"),
    /** 批量代收业务回执来账 */
    P109("P109"),
    /** 冲正-批量代收业务回执来账 */
    P110("P110"),
    /** 小额实时代收来账 */
    P115("P115"),
    /** 冲正-小额实时代收来账 */
    P116("P116"),
    /** 实时代收业务回执来账 */
    P117("P117"),
    /** 冲正-实时代收业务回执来账 */
    P118("P118"),
    /** 批量代付业务来账 */
    P121("P121"),
    /** 冲正-批量代付业务来账 */
    P122("P122"),
    /** 批量代付业务来账(收款方) */
    P123("P123"),
    /** 冲正-批量代付业务来账(收款方) */
    P124("P124"),
    /** 批量代付业务回执来账 */
    P125("P125"),
    /** 冲正-批量代付业务回执来账 */
    P126("P126"),
    /** 实时借记来账 */
    P139("P139"),
    /** 冲正-实时借记来账 */
    P140("P140"),
    /** 实时借记回执来账 */
    P141("P141"),
    /** 冲正-实时借记回执来账 */
    P142("P142"),
    /** 普通借记回执来账 */
    P143("P143"),
    /** 冲正-普通借记回执来账 */
    P144("P144"),
    /** 普通借记回执往账 */
    P145("P145"),
    /** 冲正-普通借记回执往账 */
    P146("P146"),
    /** 实时汇款回执往账 */
    P147("P147"),
    /** 冲正-实时汇款回执往账 */
    P148("P148"),
    /** 大额国库汇款往账 */
    P151("P151"),
    /** 冲正-大额国库汇款往账 */
    P152("P152"),
    /** 大额国库汇款来账 */
    P153("P153"),
    /** 冲正-大额国库汇款来账 */
    P154("P154"),
    /** 小额国库汇款往账 */
    P155("P155"),
    /** 冲正-小额国库汇款往账 */
    P156("P156"),
    /** 小额国库汇款来账 */
    P157("P157"),
    /** 冲正-小额国库汇款来账 */
    P158("P158"),
    /** 小额手工入账 */
    P159("P159"),
    /** 冲正-小额手工入账 */
    P160("P160"),
    /** 大额手工入账 */
    P161("P161"),
    /** 冲正-大额手工入账 */
    P162("P162"),
    /** 二代大额头寸清算(借记头寸) */
    P165("P165"),
    /** 二代小额头寸清算(借记头寸) */
    P167("P167"),
    /** 支票借记回执往账 */
    P168("P168"),
    /** 冲正-支票借记回执往账 */
    P169("P169"),
    /** 城商行汇票签发录入 */
    P173("P173"),
    /** 冲正-城商行汇票签发录入 */
    P174("P174"),
    /** 城商行汇票逾期付款 */
    P175("P175"),
    /** 冲正-城商行汇票逾期付款 */
    P176("P176"),
    /** 本票签发录入 */
    P177("P177"),
    /** 冲正-本票签发录入 */
    P178("P178"),
    /** 本票兑付(本行) */
    P179("P179"),
    /** 冲正-本票兑付(本行) */
    P180("P180"),
    /** 本票退回录入(本行) */
    P181("P181"),
    /** 冲正-本票退回录入(本行) */
    P182("P182"),
    /** 二代大额行间清算(贷记) */
    P189("P189"),
    /** 二代大额行间清算(借记) */
    P190("P190"),
    /** 二代小额行间清算(贷记) */
    P191("P191"),
    /** 二代小额行间清算(借记) */
    P192("P192"),
    /** 二代大额挂账 */
    P201("P201"),
    /** 二代小额挂账 */
    P203("P203"),
    /** 汇票移存户-签发户结清 */
    P205("P205"),
    /** 冲正-汇票移存户-签发户结清 */
    P206("P206"),
    /** 兑付-银行本票(小额)回执接收 */
    P207("P207"),
    /** 冲正-兑付-银行本票(小额)回执接收 */
    P208("P208"),
    /** 定期贷记单笔撤销 */
    P209("P209"),
    /** 冲正-定期贷记单笔撤销 */
    P210("P210"),
    /** 大额汇兑往账(直销) */
    P221("P221"),
    /** 冲正-大额汇兑往账(直销) */
    P222("P222"),
    /** 大额信用卡客户普贷来账 */
    P223("P223"),
    /** 冲正-大额信用卡客户普贷来账 */
    P224("P224"),
    /** 小额信用卡客户普贷来账 */
    P225("P225"),
    /** 冲正-小额信用卡客户普贷来账 */
    P226("P226"),
    /** 直销银行大额客户普贷提现 */
    P227("P227"),
    /** 冲正-直销银行大额客户普贷提现 */
    P228("P228"),
    /** 直销银行大额客户普贷来账充值 */
    P229("P229"),
    /** 冲正-直销银行大额客户普贷来账充值 */
    P230("P230"),
    /** 直销银行小额客户普贷来账充值 */
    P231("P231"),
    /** 冲正-直销银行小额客户普贷来账充值 */
    P232("P232"),
    /** 大额汇兑往账(集中作业) */
    P304("P304"),
    /** 冲正-大额汇兑往账(集中作业) */
    P305("P305"),
    /** 集中作业小额转账 */
    P306("P306"),
    /** 冲正-集中作业小额转账 */
    P307("P307"),
    /** 大额集中支付托收往账 */
    P308("P308"),
    /** 冲正-大额集中支付托收往账 */
    P309("P309"),
    /** 小额集中支付托收往账 */
    P310("P310"),
    /** 冲正-小额集中支付托收往账 */
    P311("P311"),
    /** 大额汇兑往账(网银) */
    P320("P320"),
    /** 冲正-大额汇兑往账(网银) */
    P321("P321"),
    /** 小额汇兑往账(网银) */
    P322("P322"),
    /** 冲正-小额汇兑往账(网银) */
    P323("P323"),
    /** 大额汇兑往账(手机银行) */
    P324("P324"),
    /** 冲正-大额汇兑往账(手机银行) */
    P325("P325"),
    /** 小额汇兑往账(手机银行) */
    P326("P326"),
    /** 冲正-小额汇兑往账(手机银行) */
    P327("P327"),
    /** 大额汇兑往账(VTM) */
    P328("P328"),
    /** 冲正-大额汇兑往账(VTM) */
    P329("P329"),
    /** 小额汇兑往账(VTM) */
    P330("P330"),
    /** 冲正-小额汇兑往账(VTM) */
    P331("P331"),
    /** 大额汇兑往账(STM) */
    P332("P332"),
    /** 冲正-大额汇兑往账(STM) */
    P333("P333"),
    /** 小额汇兑往账(STM) */
    P334("P334"),
    /** 冲正-小额汇兑往账(STM) */
    P335("P335"),
    /** 大额即时来账-网联资金清算(入账) */
    P336("P336"),
    /** 冲正-大额即时来账-网联资金清算(入账) */
    P337("P337"),
    /** 大额即时来账-网联资金清算(扣账) */
    P338("P338"),
    /** 冲正-大额即时来账-网联资金清算(扣账) */
    P339("P339"),
    /** 大额即时来账-电票线上清算(入账) */
    P340("P340"),
    /** 冲正-大额即时来账-电票线上清算(入账) */
    P341("P341"),
    /** 大额即时来账-电票线上清算(扣账) */
    P342("P342"),
    /** 冲正-大额即时来账-电票线上清算(扣账) */
    P343("P343"),
    /** 大额即时来账-常备借贷便利(入账) */
    P344("P344"),
    /** 冲正-大额即时来账-常备借贷便利(入账) */
    P345("P345"),
    /** 大额即时来账-常备借贷便利(扣账) */
    P346("P346"),
    /** 冲正-大额即时来账-常备借贷便利(扣账) */
    P347("P347"),
    /** 大额汇兑往账(住建部) */
    P349("P349"),
    /** 冲正-大额汇兑往账(住建部) */
    P350("P350"),
    /** 小额汇兑往账(住建部) */
    P351("P351"),
    /** 冲正-小额汇兑往账(住建部) */
    P352("P352"),
    /** E付银联清算(扣账) */
    P353("P353"),
    /** 冲正-E付银联清算(扣账) */
    P354("P354"),
    /** 大额即时来账-E付银联清算(垫资) */
    P355("P355"),
    /** 冲正-大额即时来账-E付银联清算(垫资) */
    P356("P356"),
    /** 大额即时来账-债券资金清算(入账) */
    P357("P357"),
    /** 冲正-大额即时来账-债券资金清算(入账) */
    P358("P358"),
    /** 大额即时来账-债券资金清算(扣账) */
    P359("P359"),
    /** 冲正-大额即时来账-债券资金清算(扣账) */
    P360("P360"),
    /** 银联条码交易入账 */
    P361("P361"),
    /** 冲正-银联条码交易入账 */
    P362("P362"),
    /** 同业存单到期债券还本付息 */
    P363("P363"),
    /** 冲正-同业存单到期债券还本付息 */
    P364("P364"),
    /** 划回国债发行手续费 */
    P365("P365"),
    /** 冲正-划回国债发行手续费 */
    P366("P366"),
    /** 划回国债兑付款项 */
    P367("P367"),
    /** 冲正-划回国债兑付款项 */
    P368("P368"),
    /** 借记卡银联清算资金(借记银联) */
    P369("P369"),
    /** 冲正-借记卡银联清算资金(借记银联) */
    P370("P370"),
    /** 借记卡银联清算资金(贷记银联) */
    P371("P371"),
    /** 冲正-借记卡银联清算资金(贷记银联) */
    P372("P372"),
    /** 信用卡银联清算资金(有卡借记信用卡) */
    P373("P373"),
    /** 冲正-信用卡银联清算资金(有卡借记信用卡) */
    P374("P374"),
    /** 信用卡银联清算资金(有卡贷记信用卡) */
    P375("P375"),
    /** 冲正-借记卡银联清算资金(有卡贷记信用卡) */
    P376("P376"),
    /** 信用卡银联清算资金(无卡借记信用卡) */
    P377("P377"),
    /** 冲正-信用卡银联清算资金(无卡借记信用卡) */
    P378("P378"),
    /** 信用卡银联清算资金(无卡贷记信用卡) */
    P379("P379"),
    /** 冲正-借记卡银联清算资金(无卡贷记信用卡) */
    P380("P380"),
    /** 票据服务费 */
    P381("P381"),
    /** 二代大额头寸清算(贷记头寸) */
    P382("P382"),
    /** 二代小额头寸清算(贷记头寸) */
    P383("P383"),
    /** 冲正-票据服务费 */
    P384("P384"),
    /** 贷记卡小额手工入账 */
    P386("P386"),
    /** 冲正-贷记卡小额手工入账 */
    P387("P387"),
    /** 贷记卡大额手工入账 */
    P388("P388"),
    /** 冲正-贷记卡大额手工入账 */
    P389("P389"),
    /** 前付息产品利息调整贷方单边 */
    PACR("PACR"),
    /** 保函赔付 */
    PAD("PAD"),
    /** 保函赔付撤销 */
    PAID("PAID"),
    /** 支出费用摊销 */
    PAMOR("PAMOR"),
    /** 支出费用摊销-冲销 */
    PAMRR("PAMRR"),
    /** 费用付费 */
    PFEE("PFEE"),
    /** 费用付费-冲销 */
    PFEER("PFEER"),
    /** 票据资金清算-借记 */
    PJ01("PJ01"),
    /** 票据资金清算-借记-冲销 */
    PJ02("PJ02"),
    /** 票据资金清算-贷记 */
    PJ03("PJ03"),
    /** 票据资金清算-贷记冲销 */
    PJ04("PJ04"),
    /** 质押 */
    PLED("PLED"),
    /** 批量记账-冲销 */
    PLJR("PLJR"),
    /** 批量记账 */
    PLJZ("PLJZ"),
    /** 本票转账签发 */
    PN01("PN01"),
    /** 冲正-本票转账签发 */
    PN02("PN02"),
    /** 本票现金签发 */
    PN03("PN03"),
    /** 冲正-本票现金签发 */
    PN04("PN04"),
    /** 本票转账兑付 */
    PN05("PN05"),
    /** 冲正-本票转账兑付 */
    PN06("PN06"),
    /** 本票现金兑付 */
    PN07("PN07"),
    /** 冲正-本票现金兑付 */
    PN08("PN08"),
    /** 本票转账退回 */
    PN09("PN09"),
    /** 冲正-本票转账退回 */
    PN10("PN10"),
    /** 本票现金退回 */
    PN11("PN11"),
    /** 冲正-本票现金退回 */
    PN12("PN12"),
    /** 本票过期处理 */
    PN13("PN13"),
    /** 冲正-本票过期处理 */
    PN14("PN14"),
    /** 本票解付 */
    PN15("PN15"),
    /** 冲正-本票解付 */
    PN16("PN16"),
    /** 本票法院执行 */
    PN17("PN17"),
    /** 冲正-本票法院执行 */
    PN18("PN18"),
    /** 转非应计 */
    PNP("PNP"),
    /** 呆滞转呆账 */
    PNPD("PNPD"),
    /** 差错调整(贷记客户账)-冲销 */
    PORC("PORC"),
    /** 差错调整(贷记客户账) */
    POSC("POSC"),
    /** 抵债资产入账接收费用 */
    POSF("POSF"),
    /** 差错调整(借记客户账) */
    POSQ("POSQ"),
    /** 差错调整(借记客户账)-冲销 */
    POSR("POSR"),
    /** 抵债资产入账 */
    POST("POST"),
    /** 资产证券化封包后转出金额回收 */
    PREC("PREC"),
    /** 抵债资产拨备计提 */
    PROA("PROA"),
    /** POS商户入账-贷记卡 */
    PS01("PS01"),
    /** POS商户转出 */
    PS02("PS02"),
    /** 大额分期手续费 */
    PS03("PS03"),
    /** POS商户入账-冲销 */
    PS04("PS04"),
    /** POS商户转出-冲销 */
    PS05("PS05"),
    /** 大额分期手续费-冲销 */
    PS06("PS06"),
    /** 同城交换清算-借 */
    PT01("PT01"),
    /** 同城交换清算-借方冲正 */
    PT02("PT02"),
    /** 待抵用票据款-贷 */
    PT03("PT03"),
    /** 待抵用票据款-贷方冲正 */
    PT04("PT04"),
    /** 待报解预算收入-贷 */
    PT05("PT05"),
    /** 待报解预算收入-贷方冲正 */
    PT06("PT06"),
    /** 待报解预算收入-借 */
    PT07("PT07"),
    /** 待报解预算收入-借方冲正 */
    PT08("PT08"),
    /** 同城交换清算-贷 */
    PT09("PT09"),
    /** 同城交换清算-贷方冲正 */
    PT10("PT10"),
    /** 应解汇款-借 */
    PT11("PT11"),
    /** 应解汇款-借方冲正 */
    PT12("PT12"),
    /** 待抵用票据款-借 */
    PT13("PT13"),
    /** 待抵用票据款-借方冲正 */
    PT14("PT14"),
    /** 同城交换清算退票-贷 */
    PT15("PT15"),
    /** 同城交换清算退票-贷方冲正 */
    PT16("PT16"),
    /** 同城交换清算退票-借 */
    PT17("PT17"),
    /** 同城交换清算退票-借方冲正 */
    PT18("PT18"),
    /** 同城往来分户-贷 */
    PT19("PT19"),
    /** 同城往来分户-贷方冲正 */
    PT20("PT20"),
    /** 同城往来分户-借 */
    PT21("PT21"),
    /** 同城往来分户-借方冲正 */
    PT22("PT22"),
    /** 存放中央行备付金-贷 */
    PT23("PT23"),
    /** 存放中央行备付金-贷方冲正 */
    PT24("PT24"),
    /** 存放中央行备付金-借 */
    PT25("PT25"),
    /** 存放中央行备付金-借方冲正 */
    PT26("PT26"),
    /** 客户帐-借 */
    PT51("PT51"),
    /** 客户帐-借方冲正 */
    PT52("PT52"),
    /** 客户帐-贷 */
    PT53("PT53"),
    /** 客户帐-贷方冲正 */
    PT54("PT54"),
    /** 快窗行内取款 */
    QE01("QE01"),
    /** 快窗行内取款-冲销 */
    QE02("QE02"),
    /** 快窗行内转账存入 */
    QE03("QE03"),
    /** 快窗行内转账存入-冲销 */
    QE04("QE04"),
    /** 快窗行内转账支取 */
    QE05("QE05"),
    /** 快窗行内转账支取-冲销 */
    QE06("QE06"),
    /** 快窗行内存入 */
    QE07("QE07"),
    /** 快窗行内存入-冲销 */
    QE08("QE08"),
    /** 快窗本代他取款 */
    QE09("QE09"),
    /** 快窗本代他取款-冲销 */
    QE10("QE10"),
    /** 快窗本代他转账本行转出 */
    QE11("QE11"),
    /** 快窗本代他转账本行转出-冲销 */
    QE12("QE12"),
    /** 快窗本代他转账他行转出 */
    QE13("QE13"),
    /** 快窗本代他转账他行转出-冲销 */
    QE14("QE14"),
    /** 快窗行内转账存入-次日 */
    QE15("QE15"),
    /** 快窗行内转账存入-次日-冲销 */
    QE16("QE16"),
    /** 快窗行内转账支取-次日 */
    QE17("QE17"),
    /** 快窗行内转账支取-次日-冲销 */
    QE18("QE18"),
    /** 快窗信用卡预借现金 */
    QE25("QE25"),
    /** 快窗信用卡预借现金-冲正 */
    QE26("QE26"),
    /** 快窗信用卡现金还款 */
    QE27("QE27"),
    /** 快窗信用卡现金还款-冲正 */
    QE28("QE28"),
    /** 快窗信用卡转账支取 */
    QE29("QE29"),
    /** 快窗信用卡转账支取-冲正 */
    QE30("QE30"),
    /** 快窗信用卡转账存入 */
    QE31("QE31"),
    /** 快窗信用卡转账存入-冲正 */
    QE32("QE32"),
    /** 优惠券减免-冲销 */
    RCOUPON("RCOUPON"),
    /** 优惠券减免金额回冲-冲销 */
    RCOUPONB("RCOUPONB"),
    /** 债权减免-冲正 */
    RDEF("RDEF"),
    /** 回收 */
    REC("REC"),
    /** 贷款回收 */
    REC1("REC1"),
    /** 贷款回收-冲销 */
    REC2("REC2"),
    /** 贷款现金回收 */
    RECC("RECC"),
    /** 贷款现金回收-冲销 */
    RECR("RECR"),
    /** 资产转让后正常逾期贷款回收 */
    RECT("RECT"),
    /** 资产转让后正常逾期贷款回收-冲销 */
    RECTR("RECTR"),
    /** 福费廷转上游回收折价 */
    REDS("REDS"),
    /** 抵债资产处置(租赁) */
    RENT("RENT"),
    /** 福费廷转上游回收溢价 */
    REPR("REPR"),
    /** 保函收回 */
    REV("REV"),
    /** 费用收取 */
    RFEE("RFEE"),
    /** 费用收取-冲销 */
    RFEER("RFEER"),
    /** 存入-长款处理-冲销 */
    RK01("RK01"),
    /** 现金-长款处理-冲销 */
    RK02("RK02"),
    /** 总账-长款处理-冲销 */
    RK03("RK03"),
    /** 信用卡账户-长款处理-冲销 */
    RK04("RK04"),
    /** 银联清算-长款处理-冲销 */
    RK05("RK05"),
    /** 证券化封包后券商权益收回 */
    RREC("RREC"),
    /** 证券化封包后券商权益收回-冲销 */
    RRER("RRER"),
    /** 贷款豁免-冲销 */
    RWAV("RWAV"),
    /** 抵债资产处置(变卖) */
    SALE("SALE"),
    /** 多法人清算（专用） */
    SETTLE("SETTLE"),
    /** 票据内转行间清算 -冲销 */
    SETTLEC("SETTLEC"),
    /** 票据内转行间清算 */
    SETTLED("SETTLED"),
    /** 资产证券化发行后非应计回收-不转产品 */
    SFRECZ("SFRECZ"),
    /** 大额汇兑往账(省财政) */
    SG01("SG01"),
    /** 冲正-大额汇兑往账(省财政) */
    SG02("SG02"),
    /** 国库集中支付支取 */
    SG11("SG11"),
    /** 国库集中支付存入 */
    SG12("SG12"),
    /** 国库集中支付支取-冲销 */
    SG13("SG13"),
    /** 国库集中支付存入-冲销 */
    SG14("SG14"),
    /** 省金服往账-现金 */
    SJ01("SJ01"),
    /** 省金服往账-现金-冲正 */
    SJ02("SJ02"),
    /** 省金服往账-转账 */
    SJ03("SJ03"),
    /** 省金服往账-转账-冲正 */
    SJ04("SJ04"),
    /** 省金服维护入账 */
    SJ05("SJ05"),
    /** 省金服维护入账-冲正 */
    SJ06("SJ06"),
    /** 省金服来帐入账 */
    SJ07("SJ07"),
    /** 省金服来帐入账-冲正 */
    SJ08("SJ08"),
    /** 省金服实时扣款 */
    SJ09("SJ09"),
    /** 省金服实时扣款-冲正 */
    SJ10("SJ10"),
    /** 省金服批量代付 */
    SJ11("SJ11"),
    /** 省金服批量代付-冲正 */
    SJ12("SJ12"),
    /** 省金服扣税 */
    SJ13("SJ13"),
    /** 省金服扣税-冲正 */
    SJ14("SJ14"),
    /** 省金服定期贷记往帐 */
    SJ15("SJ15"),
    /** 省金服定期贷记往帐-冲正 */
    SJ16("SJ16"),
    /** 省金服退税 */
    SJ17("SJ17"),
    /** 省金服退税-冲正 */
    SJ18("SJ18"),
    /** 省金服定期借记来帐 */
    SJ19("SJ19"),
    /** 省金服定期借记来帐-冲正 */
    SJ20("SJ20"),
    /** 省金服批量贷记来帐 */
    SJ21("SJ21"),
    /** 省金服批量贷记来帐-冲正 */
    SJ22("SJ22"),
    /** 现金缴款退款-现金 */
    SJ23("SJ23"),
    /** 现金缴款退款-现金-冲正 */
    SJ24("SJ24"),
    /** 现金缴款退款-转账 */
    SJ25("SJ25"),
    /** 现金缴款退款-转账-冲正 */
    SJ26("SJ26"),
    /** 现金缴款 */
    SJ27("SJ27"),
    /** 现金缴款-冲正 */
    SJ28("SJ28"),
    /** 转账缴款 */
    SJ29("SJ29"),
    /** 转账缴款-冲正 */
    SJ30("SJ30"),
    /** 假币退还 */
    SM012("SM012"),
    /** 假币库存增加 */
    SM01("SM01"),
    /** 假币库存减少 */
    SM02("SM02"),
    /** 资产证券化发行后转出金额回收 */
    SREC("SREC"),
    /** 资产证券化行内利息收回-不转产品 */
    SRECZ("SRECZ"),
    /** 资产证券化行内利息收回-不转产品冲销 */
    SRECZR("SRECZR"),
    /** 受托支付入账 */
    ST01("ST01"),
    /** 受托支付入账-冲正 */
    ST02("ST02"),
    /** 受托支付扣款 */
    ST03("ST03"),
    /** 受托支付扣款-冲正 */
    ST04("ST04"),
    /** 退汇退款 */
    ST05("ST05"),
    /** 退汇退款-冲正 */
    ST06("ST06"),
    /** 拒绝退款 */
    ST07("ST07"),
    /** 拒绝退款-冲正 */
    ST08("ST08"),
    /** 印花税 */
    STAM("STAM"),
    /** 印花税-冲正 */
    STAR("STAR"),
    /** 深同城往帐-转账 */
    SZ01("SZ01"),
    /** 深同城往帐-转账-冲正 */
    SZ02("SZ02"),
    /** 深同城往帐-现金 */
    SZ03("SZ03"),
    /** 深同城往帐-现金-冲正 */
    SZ04("SZ04"),
    /** 深同城来帐入账 */
    SZ05("SZ05"),
    /** 深同城来帐入账-冲正 */
    SZ06("SZ06"),
    /** 深同城来帐维护入账 */
    SZ07("SZ07"),
    /** 深同城来帐维护入账-冲正 */
    SZ08("SZ08"),
    /** 深同城往帐删除 */
    SZ09("SZ09"),
    /** 深同城往帐删除-冲正 */
    SZ10("SZ10"),
    /** 深同城单笔代付 */
    SZ11("SZ11"),
    /** 深同城单笔代付-冲正 */
    SZ12("SZ12"),
    /** 深同城提回票据 */
    SZ13("SZ13"),
    /** 深同城提回票据-冲正 */
    SZ14("SZ14"),
    /** 深同城单笔借记入账 */
    SZ15("SZ15"),
    /** 深同城单笔借记入账-冲正 */
    SZ16("SZ16"),
    /** 深同城主动缴费-转账 */
    SZ17("SZ17"),
    /** 深同城主动缴费-转账-冲正 */
    SZ18("SZ18"),
    /** 深同城主动缴费-现金 */
    SZ19("SZ19"),
    /** 深同城主动缴费-现金-冲正 */
    SZ20("SZ20"),
    /** 深同城来帐入账 */
    SZ21("SZ21"),
    /** 深同城来帐入账-冲正 */
    SZ22("SZ22"),
    /** 同业清算-贷记 */
    T057("T057"),
    /** 同业清算-贷记-冲正 */
    T058("T058"),
    /** 同业清算-借记 */
    T059("T059"),
    /** 同业清算-借记-冲正 */
    T060("T060"),
    /** 银行承兑汇票出票 */
    T111("T111"),
    /** 银行承兑汇票出票冲正 */
    T112("T112"),
    /** 银行承兑汇票未到期退回 */
    T114("T114"),
    /** 银承正常兑付 */
    T115("T115"),
    /** 银承正常兑付冲正 */
    T116("T116"),
    /** 银承到期退回 */
    T117("T117"),
    /** 银承到期退回冲正 */
    T118("T118"),
    /** 银承逾期兑付 */
    T119("T119"),
    /** 银承逾期兑付冲正 */
    T120("T120"),
    /** 银承丧失兑付 */
    T121("T121"),
    /** 银承丧失兑付冲正 */
    T122("T122"),
    /** 银行承兑汇票备款-活期转账 */
    T123("T123"),
    /** 银行承兑汇票备款-定期支取 */
    T124("T124"),
    /** 假币收缴 */
    TAO("TAO"),
    /** 代扣利息税 */
    TAX12("TAX12"),
    /** 利息税 */
    TAX1("TAX1"),
    /** 代扣代缴非居民企业利息税-借方 */
    TAX2("TAX2"),
    /** 代扣代缴非居民企业利息税-借方-冲正 */
    TAX2R("TAX2R"),
    /** 代扣代缴非居民企业利息税-客户账 */
    TAX3("TAX3"),
    /** 代扣代缴非居民企业利息税-客户账-冲正 */
    TAX3R("TAX3R"),
    /** 代扣利息税-冲销 */
    TAXR2("TAXR2"),
    /** 利息税-冲销 */
    TAXR("TAXR"),
    /** 现金入尾箱 */
    TB_IN("TB_IN"),
    /** 现金出尾箱 */
    TB_OUT("TB_OUT"),
    /** 行外现金出库 */
    TB012("TB012"),
    /** 本地人行现金入库 */
    TB01("TB01"),
    /** 本地人行现金入库确认 */
    TB02("TB02"),
    /** 异地人行现金入库 */
    TB032("TB032"),
    /** 行外现金入库 */
    TB03("TB03"),
    /** 人行现金入库 */
    TB042("TB042"),
    /** 异地人行现金入库确认 */
    TB04("TB04"),
    /** 现金退回 */
    TB052("TB052"),
    /** 联网取现人行现金入库记账 */
    TB05("TB05"),
    /** 异地人行现金出库 */
    TB062("TB062"),
    /** 联网取现人行现金入库 */
    TB06("TB06"),
    /** 异地人行现金入库 */
    TB072("TB072"),
    /** 本地人行现金出库 */
    TB07("TB07"),
    /** 本地人行现金出库确认 */
    TB08("TB08"),
    /** 异地人行现金出库 */
    TB09("TB09"),
    /** 异地人行现金出库确认 */
    TB10("TB10"),
    /** 联网取现人行现金出库 */
    TB11("TB11"),
    /** 联网取现人行现金出库确认 */
    TB12("TB12"),
    /** 同业现金入库 */
    TB13("TB13"),
    /** 同业现金入库确认 */
    TB14("TB14"),
    /** 同业现金出库 */
    TB15("TB15"),
    /** 同业现金出库确认 */
    TB16("TB16"),
    /** 行内现金入库 */
    TB17("TB17"),
    /** 行内现金出库 */
    TB18("TB18"),
    /** 本地人行现金入库退回 */
    TB19("TB19"),
    /** 异地人行现金入库退回 */
    TB20("TB20"),
    /** 联网取现人行现金入库退回 */
    TB21("TB21"),
    /** 同业现金入库退回 */
    TB22("TB22"),
    /** 行内现金出库退回 */
    TB23("TB23"),
    /** 资产证券化赎回-不转产品 */
    TBBY("TBBY"),
    /** 资产证券化赎回内部账户贷记 */
    TBBYZ2("TBBYZ2"),
    /** 资产证券化赎回-转产品 */
    TBBYZ("TBBYZ"),
    /** 收妥入账 */
    TCCR("TCCR"),
    /** 收妥入账-冲销 */
    TCDR("TCDR"),
    /** 银银合作三方存管转出 */
    TD01("TD01"),
    /** 银银合作三方存管转出-冲销 */
    TD02("TD02"),
    /** 银银合作三方存管转入 */
    TD03("TD03"),
    /** 银银合作三方存管转入-冲销 */
    TD04("TD04"),
    /** 贷款终止 */
    TER("TER"),
    /** 转账缴税(存入) */
    TI01("TI01"),
    /** 转账缴税(存入)-冲销 */
    TI02("TI02"),
    /** 转账缴税(支取) */
    TI03("TI03"),
    /** 转账缴税(支取)-冲销 */
    TI04("TI04"),
    /** 现金缴税 */
    TI05("TI05"),
    /** 现金缴税-冲销 */
    TI06("TI06"),
    /** 转账缴税(支取)-异地 */
    TI07("TI07"),
    /** 转账缴税(支取)-异地-冲销 */
    TI08("TI08"),
    /** 转账缴税(存入)-异地 */
    TI09("TI09"),
    /** 转账缴税(存入)-异地-冲销 */
    TI10("TI10"),
    /** 资产转让回收冲给第三方冲正 */
    TR98("TR98"),
    /** 资产转让回收冲给第三方 */
    TR99("TR99"),
    /** 利息转移前 */
    TRBF("TRBF"),
    /** 资产证券化赎回结算账户 */
    TRBR("TRBR"),
    /** 利息转移后 */
    TRBT("TRBT"),
    /** 客户变更-变更前 */
    TRCF("TRCF"),
    /** 客户变更-变更后 */
    TRCT("TRCT"),
    /** 折价 */
    TRDS("TRDS"),
    /** 资产转让撤销-溢价冲销 */
    TRDSC("TRDSC"),
    /** 行内转让-折价 */
    TRDSI2("TRDSI2"),
    /** 行内转让折价（转入机构盈利） */
    TRDSI("TRDSI"),
    /** 资产证券化递延负债-不转产品 */
    TRDSL("TRDSL"),
    /** 资产转让-折价 */
    TRDSO("TRDSO"),
    /** 资产转让-折价-冲销 */
    TRDSOR("TRDSOR"),
    /** 行内转让折价（转入机构盈利）-冲正 */
    TRDSR("TRDSR"),
    /** 资产转让行内利息入账 */
    TREC("TREC"),
    /** 资产证券化行内利息收回-不转产品 */
    TRECZ("TRECZ"),
    /** 资产证券化行内利息收回-不转产品冲销 */
    TRECZR("TRECZR"),
    /** 发行 */
    TRFA("TRFA"),
    /** 本金转移 */
    TRFB("TRFB"),
    /** 封包前 */
    TRFF("TRFF"),
    /** 封包后 */
    TRFT("TRFT"),
    /** 回购前 */
    TRIF("TRIF"),
    /** 资产转让利息冲减 */
    TRIO("TRIO"),
    /** 资产转让撤销-利息冲减冲销 */
    TRIOC("TRIOC"),
    /** 资产转让利息冲减-冲销 */
    TRIOR("TRIOR"),
    /** 回购后 */
    TRIT("TRIT"),
    /** 转让前 */
    TROF("TROF"),
    /** 转让后 */
    TROT("TROT"),
    /** 资产证券化封包-不转产品 */
    TRPC("TRPC"),
    /** 资产证券化封包前移-不转产品 */
    TRPCM("TRPCM"),
    /** 产品转出 */
    TRPF("TRPF"),
    /** 行内转让 */
    TRPI("TRPI"),
    /** 行内转让转让对价-转出机构 */
    TRPIF2("TRPIF2"),
    /** 行内转让对价-转出机构 */
    TRPIF("TRPIF"),
    /** 行内转让对价-转出机构-冲销 */
    TRPIFR("TRPIFR"),
    /** 行内转让-冲正 */
    TRPIR("TRPIR"),
    /** 行内转让对价-转入机构 */
    TRPIT2("TRPIT2"),
    /** 行内转让转让对价-转入机构 */
    TRPIT("TRPIT"),
    /** 行内转让对价-转入机构-冲销 */
    TRPITR("TRPITR"),
    /** 资产证券化封包-不转产品 */
    TRPK("TRPK"),
    /** 资产证券化前移内部账户贷记 */
    TRPKC("TRPKC"),
    /** 资产证券化前移内部账户贷记-冲销 */
    TRPKCR("TRPKCR"),
    /** 资产证券化前移内部账户借记 */
    TRPKD("TRPKD"),
    /** 资产证券化前移内部账户借记-冲销 */
    TRPKDR("TRPKDR"),
    /** 资产证券化封包前移-不转产品 */
    TRPKM("TRPKM"),
    /** 溢价 */
    TRPR("TRPR"),
    /** 资产转让撤销-折价冲销 */
    TRPRC("TRPRC"),
    /** 贷款转回 */
    TRPRF("TRPRF"),
    /** 行内转让-溢价 */
    TRPRI2("TRPRI2"),
    /** 行内转让溢价（转出机构盈利） */
    TRPRI("TRPRI"),
    /** 资产转让-溢价 */
    TRPRO("TRPRO"),
    /** 资产转让-溢价-冲销 */
    TRPROR("TRPROR"),
    /** 行内转让溢价（转出机构盈利）-冲正 */
    TRPRR("TRPRR"),
    /** 贷款置换 */
    TRPRT("TRPRT"),
    /** 产品转入 */
    TRPT("TRPT"),
    /** 资产转让回收冲给第三方 */
    TRREC("TRREC"),
    /** 资产转让撤销-冲给第三方的回收冲销 */
    TRRECC("TRRECC"),
    /** 资产转让回收冲给第三方-冲销 */
    TRRECR("TRRECR"),
    /** 发行 */
    TRSA("TRSA"),
    /** 资产证券化发行-不转产品 */
    TRSAZ("TRSAZ"),
    /** 资产证券化封包发行券商所属 */
    TRSB("TRSB"),
    /** 发行撤销 */
    TRSC("TRSC"),
    /** 资产证券化发行撤销-不转产品 */
    TRSCZ("TRSCZ"),
    /** 资产转让表外托管 */
    TRSLT("TRSLT"),
    /** 资产转让撤销-表外托管冲销 */
    TRSLTC("TRSLTC"),
    /** 资产转让表外托管-冲销 */
    TRSLTR("TRSLTR"),
    /** 资产证券化封包发行券商所属-冲正 */
    TRSR("TRSR"),
    /** 资产证券化内部账户贷记 */
    TRTC("TRTC"),
    /** 资产证券化内部账户贷记-冲销 */
    TRTCR("TRTCR"),
    /** 资产证券化内部账户借记 */
    TRTD("TRTD"),
    /** 资产证券化内部账户借记-冲销 */
    TRTDR("TRTDR"),
    /** 资产转让豁免 */
    TRWV("TRWV"),
    /** 同业代付 */
    TYDF("TYDF"),
    /** 同业代付计提 */
    TYDFACR("TYDFACR"),
    /** 同业代付计提调整 */
    TYDFADJ("TYDFADJ"),
    /** 同业代付登记撤销 */
    TYDFCAN("TYDFCAN"),
    /** 同业代付登记 */
    TYDFDJ("TYDFDJ"),
    /** 银联他代本ATM取款 */
    UC01("UC01"),
    /** 银联他代本ATM取款-冲销 */
    UC02("UC02"),
    /** 他代本ATM转账（转出） */
    UC07("UC07"),
    /** 他代本ATM转账（转出）-冲销 */
    UC08("UC08"),
    /** 他代本ATM转账转入 */
    UC09("UC09"),
    /** 他代本ATM转账转入确认 */
    UC10("UC10"),
    /** 银联POS消费（他代本） */
    UC11("UC11"),
    /** 银联POS消费（他代本）-冲销 */
    UC12("UC12"),
    /** 银联POS消费撤销（他代本） */
    UC13("UC13"),
    /** 银联POS消费撤销（他代本）-冲销 */
    UC14("UC14"),
    /** 银联POS退货（他代本） */
    UC15("UC15"),
    /** 银联POS退货（他代本）-冲销 */
    UC16("UC16"),
    /** 银联POS预授权完成 */
    UC17("UC17"),
    /** 银联银联POS预授权完成-冲销 */
    UC18("UC18"),
    /** 银联POS预授权完成撤销 */
    UC19("UC19"),
    /** 银联POS预授权完成撤销-冲销 */
    UC20("UC20"),
    /** 他代本CDM存款 */
    UC34("UC34"),
    /** 他代本CDM存款撤消 */
    UC35("UC35"),
    /** 他代本CDM存款撤消-冲销 */
    UC36("UC36"),
    /** 他代本CDM存款确认 */
    UC37("UC37"),
    /** 他代本CDM存款确认-冲销 */
    UC38("UC38"),
    /** 他代本贷记 */
    UC42("UC42"),
    /** 他代本代收 */
    UC43("UC43"),
    /** 他代本代收-冲销 */
    UC44("UC44"),
    /** 他代本代收撤销 */
    UC45("UC45"),
    /** 他代本代收撤销-冲销 */
    UC46("UC46"),
    /** 本行银联助农取款 */
    UC47("UC47"),
    /** 本行银联助农取款-冲销 */
    UC48("UC48"),
    /** 本行卡银联助农转账（转入） */
    UC50("UC50"),
    /** 本行卡银联助农转账（转入）-冲销 */
    UC51("UC51"),
    /** 本行卡银联助农转账（转出） */
    UC52("UC52"),
    /** 本行卡银联助农转账（转出）-冲销 */
    UC53("UC53"),
    /** 银联借记转账转入-发起方 */
    UC58("UC58"),
    /** 银联借记转账转入-发起方-冲销 */
    UC59("UC59"),
    /** 银联借记转账转出-服务方 */
    UC60("UC60"),
    /** 银联借记转账转出-服务方-冲销 */
    UC61("UC61"),
    /** 银联差错调账借记客户账 */
    UC70("UC70"),
    /** 银联差错调账借记客户账-冲销 */
    UC71("UC71"),
    /** 银联差错调账贷记客户账 */
    UC72("UC72"),
    /** 银联差错调账贷记客户账-冲销 */
    UC73("UC73"),
    /** 银联差错调账贷记电子现金 */
    UC74("UC74"),
    /** 银联转接借记卡跨行手续费收入 */
    UC75("UC75"),
    /** 银联转接借记卡跨行手续费收入-冲销 */
    UC76("UC76"),
    /** 银联转接借记卡跨行手续费支出 */
    UC77("UC77"),
    /** 银联转接借记卡跨行手续费支出-冲销 */
    UC78("UC78"),
    /** 银联跨行转接手续费收入分配 */
    UC79("UC79"),
    /** 银联跨行转接手续费收入分配-冲销 */
    UC80("UC80"),
    /** 银联跨行转接手续费支出分配 */
    UC81("UC81"),
    /** 银联跨行转接手续费支出分配-冲销 */
    UC82("UC82"),
    /** 预付费卡借方轧差 */
    UC83("UC83"),
    /** 预付费卡借方轧差-冲销 */
    UC84("UC84"),
    /** 预付费卡贷方轧差 */
    UC85("UC85"),
    /** 预付费卡贷方轧差-冲销 */
    UC86("UC86"),
    /** 银联转接信用卡跨行手续费收入 */
    UC87("UC87"),
    /** 银联转接信用卡跨行手续费收入-冲销 */
    UC88("UC88"),
    /** 银联转接信用卡跨行手续费支出 */
    UC89("UC89"),
    /** 银联转接信用卡跨行手续费支出-冲销 */
    UC90("UC90"),
    /** 信用卡云闪付跨行还款记账 */
    UC91("UC91"),
    /** 信用卡云闪付跨行还款记账-冲销 */
    UC92("UC92"),
    /** 信用卡云闪付跨行还款手续费支出 */
    UC93("UC93"),
    /** 信用卡云闪付跨行还款手续费支出-冲销 */
    UC94("UC94"),
    /** 他代本CDM存款-冲销 */
    UC95("UC95"),
    /** 他代本ATM转账转入-冲销 */
    UC96("UC96"),
    /** 他代本ATM转账转入确认-冲销 */
    UC97("UC97"),
    /** 他代本贷记-冲销 */
    UC98("UC98"),
    /** 银联差错调账贷记电子现金-冲销 */
    UC99("UC99");

    private String value;

    private TranType(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

    public static TranType byValue(String value) {
        for (TranType item : values()) {
            if (item.getValue().equals(value)) {
                return item;
            }
        }
        return null;
    }
}